{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"2ce83f2f-46ad-51b8-afa0-ffd0fd967cf3","html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Jason’s story is very similar to my own when it comes to speaking, but he’s been at it quite a bit longer. Now, he’s\nbuilt a name for himself in the Ruby community as one of the top people in testing, and has spoken internationally at events\nof all sizes. I’ve dealt with the problem of testing legacy systems before, so <a href=\"https://www.youtube.com/watch?v=NTr0h4v-jHw\">I enjoyed Jason’s talk on the issue</a>. Read on to learn more about Jason’s experience and advice for fellow speakers.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/BkjG0j1.jpg\" class=\"left\">\n<p>I don’t remember exactly how or why I first got into public speaking. I believe my first tech talks were at small user groups in the Grand Rapids, Michigan tech community around 2010 or so. From there I got into guesting on podcasts, then hosting my own podcast, and then speaking at conferences.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I have an altruistic reason and a selfish reason for speaking at conferences:</p>\n<p>The altruistic reason is that I can help a lot of people by speaking at conferences and sharing my message with attendees.</p>\n<p>The selfish reason is that speaking at conferences is a good way to boost my career prospects as a technology consultant. Since I’ve only started speaking at conferences about six months ago, I think it’s too early to expect to see any tangible benefit from it yet. One way conference speaking has intangibly benefited me though is that I can now list in my bio that I’ve spoken at certain conferences like RubyConf India which I think carries a lot of weight among my peers, and I can truthfully say that I’m an “international speaker”.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first conference talk was at a regional conference called DevOpsDays Midwest in St. Louis, Missouri in September 2018. Since I had already been speaking at local user groups for years before that point, this speaking gig didn’t feel like too big of a jump up. I’m happy to say that as far as I can tell, the talk went fine.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve applied to many dozens of conferences. I’ve spoken at five conferences at the time of this interview with two more conference talks coming up, for a total of seven. I’ve been accepted to more conferences than that but sometimes I can’t go because there’s a schedule conflict or the travel expense is too much to justify at the time.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I don’t have a pre-talk routine. I rehearse beforehand but on the day of the talk I just get up and do it.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>I only have one piece of advice: If getting a talk proposal accepted seems like an unattainable goal, just keep sending in proposals and you’ll probably eventually get something accepted.</p>\n<p>I had to submit dozens of proposals before I finally got a talk accepted, at least a talk at a conference I was able to attend. At this point I’ve actually gotten more talks accepted than I can take on and I’ve had to throttle back on sending in proposals. The act of giving my first talk gave me a couple ideas for my next talk. My next talk gave me several more ideas for future talks, and so on. The more I submitted proposals and the more I spoke, the easier it all got.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I think part of my motivation for speaking at conferences was seeing the success that my friend <a href=\"https://twitter.com/AlainChautard\">Alain Chautard</a> has had with it and seeing the impact speaking has had on his consulting career.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/wJwvmuK4tQw' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Alain Chautard at NG Conf 2018</em></p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>You can learn more about me and what I do at <a href=\"https://www.codewithjason.com/\">CodeWithJason.com</a>. Any of <a href=\"https://www.codewithjason.com/speaking/\">my upcoming speaking gigs can be found here</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Jason Swett, Podcaster and Ruby Testing Aficionado","path":"/blog/speakers-story-jason-swett/","category":"Speaker's Story","tags":null,"date":"2019/05/11","image":"https://i.imgur.com/BkjG0j1.jpg"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}