{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"aeadb8c6-6d62-53b9-83bd-98437a2d3514","html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/w36pjbN.jpg?1\" class=\"left\">\n<p>Hi, I am Drishti Jain a Computer Engineer at heart and a technology enthusiast. I love to use technology to help the less fortunate. I am a social entrepreneur. I am the Co-founder and President of the non-profit organisation <a href=\"https://www.facebook.com/samyakdrishtifoundation\">Samyak Drishti Foundation</a> which works in environment, education and healthcare sectors in 10 cities across India. I have been titled <a href=\"https://www.instagram.com/theoptimistcitizen/p/BdT0mVJnMhU/\">Eco-Warrior thrice by the Government of Maharashtra, India</a>.</p>\n<p>I have been a good orator since a young age. I got into public speaking at school in grade 4; when I had to give a speech on Mahatma Gandhi Jayanti (birth anniversary). Ever since, I’ve loved the stage and sharing knowledge with all. [Fun Fact: I also host music concerts sometimes :) ]</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>Speaking at conferences has definitely benefited my career. It’s allowed me to expand my network in ways that I’ve never imagined before!</p>\n<p>I got into conference speaking first by writing blog posts which eventually led to speaking at local meetups and then conferences. I like that by speaking at conferences I can help others learn. <strong>It’s really cool that the way I present something or specifically explain something can help make whatever I’m talking about click with someone in a way that it hasn’t before.</strong></p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I gave my first conference talk not too long ago! Big shout out to CodeStock for allowing me the opportunity. I’m really happy with the way my talk turned out. I talk fast naturally and talk even faster when I’m nervous so I was worried that my 60-minute time slot would end up being closer to 20 minutes. I took my time and a couple deep breaths and managed to use up most of my allotted time though!</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’m still pretty new to the speaker circuit so I’ve only applied to around eight conferences. I’ve spoken at one so far and am currently on the waitlist for another. <strong>I really appreciate when conferences give you feedback so you can apply that to the next one you submit to. I’m learning from each rejection I get.</strong></p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I don’t like to attend a session before my talk as I like to take that time to be by myself and compose my thoughts. I’ll typically run through my slides one last time but I’ll only do a visual run through - I won’t actually practice. I also like to take a minute or two to go somewhere on my own and give myself a little pep talk!</p>\n<h3>What advice do you have for new speakers?</h3>\n<p><strong>Go for it! You can never succeed if you don’t try.</strong> Submit to conferences that seems interesting to you and don’t give up on trying again if one tells you no. Even the most experienced speakers get rejections.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I really love watching Chloe Condon’s talks. I love how she injects humor into them.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/2n3GHyWTaM8' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Chloe Condon at DevXcon, 2018</em></p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>Feel free to follow me on Twitter! My handle is <a href=\"https://twitter.com/karaluton\">@karaluton</a>. I tweet a lot about the tech world and, if I’m being completely honest, about dogs too.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Drishti Jain, Social Entrepreneur and Technology Enthusiast","path":"/blog/speakers-story-drishti-jain/","category":"Speaker's Story","tags":null,"date":"2019/06/22","image":"https://i.imgur.com/w36pjbN.jpg?1"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}