{"pageContext":{"isCreatedByStatefulCreatePages":false,"group":[{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>As a freelance developer, it can be hard to justify the time and energy required to speak at conferences, but for George Mandis, the experience is well worth it. Like many speakers, George is an experienced software developer who’s passionate about mentoring and teaching newcomers to the field. In this week’s interview, hear more about how speaking at over 20 conferences so far has helped take George’s career to the next level.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://georgemandis.s3.amazonaws.com/holyjs-piter-2017/me-holy-js.jpg\" class=\"right\">\n<p>My name is <a href=\"https://george.mand.is/\">George Mandis</a>. I’m currently a full stack, independent web developer at <a href=\"https://snaptortoise.com/\">SnapTortoise</a> based out of Portland, Oregon, though I wear quite a few other hats. I’ve been freelancing for 13 years, but over the past 4 or 5 years I’ve gravitated towards mentorship roles. Teaching classes, workshops, leading bootcamps and working with junior developers one-on-one has been a rewarding experience and speaking feels like a natural extension to this.</p>\n<p>My first foray into speaking was actually at an Ignite event in Portland where I summarized, in 5 minutes, my experience <a href=\"https://www.youtube.com/watch?v=T2QC43jwPyM\">living as a digital nomad</a> for a year. I was terrified to speak in front of so many people, but it went well! After that I though I should look into conference speaking as a way to advance myself professionally, extend the aforementioned mentoring activities I mentioned and continue to travel and see the world, which is one my biggest passions.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/T2QC43jwPyM' frameborder='0' allowfullscreen></iframe></div>\n<h3>What do you like about speaking at conferences?</h3>\n<p><strong>Speaking at conferences is a really fun way to meet other developers and get outside perspectives on things — not just outside your particular industry, but outside your own country!</strong></p>\n<p>It’s always interesting to me to see one type of work or technology in-demand in one place and find it barely mentioned at all in another. It’s also nice to humanize other developers and put a face and a personality to a name. These conferences also have a tendency to be expensive and difficult to otherwise attend, as an independent developer. Being able to attend these conferences and pick the brain of people who work at some very large, influential tech companies is a wonderful opportunity.</p>\n<p>I think the process of preparing a talk and speaking in front of a large group people could benefit anyone’s career, but for mine it’s certainly opened some doors. <strong>Recently I joined the Google Developer Expert program, which is something that would have very likely not happened without my conference speaking.</strong></p>\n<p>The other benefit of speaking is I’ve found it’s a great opportunity to talk about the things you want to be doing, even if it’s not the thing you’re necessarily doing in your day-to-day. My talks tend to focus on creativity, art, hardware-dabbling and making interesting, outside-the-box projects through JavaScript. Speaking on these topics has allowed me to spend more time immersed in that world and meet other like-minded and very talented people with similar interests.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My very first “talk” was the 5-minute Ignite talk I mentioned earlier, but my first <em>technical</em> talk was at HolyJS in Russia. I remember applying to a number of conferences by that point in the year. Some had accepted me but had no budget for travel, but HolyJS was the first one where everything lined up.</p>\n<p>The idea of talking for a full hour was incredibly daunting — I’d never done that before! When I pulled up the conference website I became even more nervous — David Crockford and Lea Verou were two developers I’d read and followed for most of my career, and they were head-lining the conference! My attitude going in was, <strong>if this goes terribly, at least I’m 2000 miles from home and probably won’t ever run into any of these people again.</strong> It sounds funny, but it really took the pressure off!</p>\n<p>Fortunately it went well, and I’m happy to say I’ve seen several familiar faces from that conference at other conferences since then.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’m not sure I could put a number on the number I’ve applied to. I’ve spoken at something around 20 now, but can guarantee you <strong>my acceptance rate is in the single digits, percentage-wise.</strong> Like most opportunities, it really is a numbers game. You have to be diligent and persistent, but also mindful of how you might be able to tweak your proposals to better suit a particular conference’s theme.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>If I have time a day or two before the conference <strong>I like to walk to the venue from wherever I’m staying so that I’m not thinking too hard about finding it on the day I present.</strong> In the hours leading up to the presentation I practice saying key sentences and takeaways for specific slides as I go through the slide from beginning to end, over and over, and make sure all my demos work. Once it’s about 30-minutes or so to go I’ll put the slides away and just try to clear my head. This routine changes depending on how new the talk is and how comfortable I’m feeling with it.</p>\n<p><strong>I also try to see as many other talks as I can</strong>, though I that can be difficult sometimes when my nerves are racing and my talk is still looming. After I’ve given my talk I’m much more relaxed and find it easier to enjoy the other talks. I try to make a point of shaking hands with all the speakers I see and letting them know I really appreciated what they spoke on. Other speakers might have differing opinions on that, but I know I genuinely appreciate it when someone in the audience comes up to me just to let me know they enjoyed my talk.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>When it comes to applying <strong>it really is a numbers game.</strong></p>\n<p>Apply early and often and try not to get too down on yourself if your talk isn’t accepted. For topics, there are many schools of thought on this, but I personally feel sharing a case study or story about how you used a particular piece of technology to achieve a specific goal is a good approach for giving your talk structure. Talking about why technology X is cool in general way can be just fine, but sharing how we used X at Y to achieve Z gives the audience something more concrete to walk away with.</p>\n<p>If you’re giving a workshop you can dive more deeply into the nitty-gritty workings of a thing and keep your focus there, but in a 20-40 minutes talk it’s more about introducing an idea and making the case for why others should have interest in it.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>There are quite a few, but I’ll mention two people I met at my very first talk who I think are wonderful: <a href=\"https://twitter.com/LeaVerou\">Lea Verou</a> and <a href=\"https://twitter.com/g33konaut\">Martin Splitt</a>. The list could be much longer, but I’ll stick with those for fear of omitting someone! I feel both of them have real passion for the web as an open platform and convey their enthusiasm and knowledge very well when they speak.</p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>Next, I’ll be giving a talk called <a href=\"https://www.crowdsupply.com/teardown/portland-2019\">“Hacking Hardware with JavaScript” at Teardown 2019 in Portland, Oregon</a>.</p>\n<p>You can find out more about me, my projects, writing and where I’m speaking next on my website: <a href=\"https://george.mand.is/\">george.mand.is</a> and follow me on Twitter at <a href=\"https://twitter.com/georgeMandis\">@georgeMandis</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: George Mandis, Digital Nomad and Web Developer","path":"/blog/speakers-story-george-mandis/","category":"Speaker's Story","tags":null,"date":"2019/06/08","image":"https://georgemandis.s3.amazonaws.com/holyjs-piter-2017/me-holy-js.jpg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>This week, I interviewed Rhia Dixon, a relatively new conference speaker who’s been accepted to speak at 6 conferences in her first year on the stage! While new to speaking at conferences, Rhia obviously has a gift for communication, and sometimes beginners are actually the best people to take advice from. Read on to hear Rhia’s fresh approach to tech conference speaking and some of the fantastic women in tech who have inspired her.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/GLa6cwP.png\" class=\"right\">\n<p>I’m a software engineer from Kansas City, Missouri. I love to tech, and I love to share the cool things I’ve learned with other people.</p>\n<p>I have always enjoyed going to schools to speak to students, but I was intrigued by conference speaking. One fateful evening I told <a href=\"https://twitter.com/likeOMGitsFEDAY\">Jennifer Wadella</a>, founder of Kansas City Women in Technology, that I was interested in speaking at tech conferences. She volunteered to be my mentor, set me up with resources for writing abstracts, and she sent me links to open CFPs for various conferences for me to begin submitting those abstracts. It felt like a whirlwind of events…I was writing abstracts the first week of December 2018, submitting those to conferences within the next week, and I got my first acceptance in January!</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>What I like about public speaking is that it puts me in a new place to help other people. I am thrilled that I’m providing content that people want to hear, and content that they can take something from to apply to their lives.</p>\n<p>I do believe it has benefited my career, and it has helped me to shine a light on the things I believe are great.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first conference was DevFest KC this past February in Kansas City. <strong>I was super nervous, and I told the audience this was my first time speaking at a conference. I’m used to trying to engage small groups of teenagers, not 20-40 adults.</strong> However, I needn’t have worried so much. My audience was engaged, they asked questions, and they were eager to participate. By the end of the talk, they didn’t believe that was my first time.</p>\n\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 56.25%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <iframe src=\"https://player.vimeo.com/video/312227563\" frameborder=\"0\" allow=\"autoplay; fullscreen\" allowfullscreen style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          \n<p><a href=\"https://vimeo.com/312227563\">Rhia Dixon at the KC Women in Technology 2019 Kickoff</a></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>At the time of this response, I have applied to 28 conferences. Thus far, I have been accepted to speak at 6 of the 16 conferences that have announced their speakers (1 of which I’ve already done).</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>My pre-talk routine consists of taking one last look at my slides, a few deep breaths, and listening to whatever song that currently has my ears hostage (typically something upbeat and relatively positive with great musicality).</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>I would pass on some of the best advice I’ve received:</p>\n<ul>\n<li>Pick a topic that you wouldn’t mind speaking about for hours and make it interesting for the version of you that would benefit from the talk.</li>\n<li>Write your abstract in such a way that the reader gets a pretty good understanding of why they should be at your talk and what they will get from attending.</li>\n<li>While you may not feel like the expert on this topic, the people listening to you came to hear YOU! Remember you’ve got friends in the audience — some you may know, and some you may not know…yet.</li>\n<li>Find people from varying backgrounds to read your abstracts — <strong>I have a speaker in tech, a speaker not in tech, and a non-speaker in tech review all of my abstracts to tell me what they think the point is, what they would expect to learn, and offer alternative titles.</strong> I’ve found this particularly helpful for tweaking my abstracts and tailoring my talks.</li>\n</ul>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>Oh, I have plenty! <a href=\"https://twitter.com/likeOMGitsFEDAY\">Jennifer Wadella</a> is one of my favorites — I know her, she’s relatable, she doesn’t take herself too seriously, and she has a ball on stage sharing what she knows. I’m also inspired by <a href=\"https://twitter.com/techgirl1908\">Angie Jones</a> and <a href=\"https://twitter.com/DrShirleyDavis\">Dr. Shirley Davis</a>. I aspire to these levels of awesomeness and badassery.</p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>I’m pretty active on <a href=\"https://twitter.com/TheFakeRiRi\">Twitter (@TheFakeRiRi)</a>, and I post <a href=\"https://www.rhiadixon.com\">my upcoming conferences on my website</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Rhia Dixon, Software Engineer and Breakout Speaker","path":"/blog/speakers-story-rhia-dixon/","category":"Speaker's Story","tags":null,"date":"2019/05/31","image":"https://drive.google.com/uc?id=17xfunskFSE9KSViA-7Gi9KCJIy0NSvZP"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Like many conference speakers, John got his start speaking at local meetups. Over time, he got more comfortable in\nfront of a crowd, and has now spoken at over 20 technology conferences on a variety of topics. Now it’s become\npart of the way he helps his company, Comcast, make an impact on the technology community.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p><a data-flickr-embed=\"true\" href=\"https://www.flickr.com/photos/linuxfoundation/44425350705/in/faves-17844497@N00/\" title=\"1E6A7337_Web\"><img src=\"https://live.staticflickr.com/1958/44425350705_260783ba05_z.jpg\" width=\"427\" height=\"640\" alt=\"1E6A7337_Web\" class=\"left\"></a><script async src=\"//embedr.flickr.com/assets/client-code.js\" charset=\"utf-8\"></script></p>\n<p>I’m John Riviello and I’ve been working as a frontend web developer for over 20 years. I currently work at Comcast where I am the lead web developer for xFi. My first public presentation was at a Sass meetup in Philadelphia in 2012 where I volunteered to talk about a new open source project I was working on. From there I spoke at a few “unconferences” &#x26; “unconference tracks” at other conferences (where basically as long as you show up and there’s an open speaking slot, it’s yours) before I was first accepted to speak at a conference.</p>\n<p><em>Photo Credit: <a href=\"https://www.flickr.com/photos/linuxfoundation/44425350705/in/faves-17844497@N00/\">The Linux Foundation, some rights reserved</a></em></p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>The thing I enjoy the most is sharing my experiences, both on stage and in the conversations with attendees afterwards. It has also allowed me to travel to some fun and interesting places.</p>\n<p>There are a couple areas where it has directly benefited my career. <strong>I was given the opportunity to <a href=\"http://www.lynda.com/CSS-tutorials/CSS-Sass-Converting-Existing-Site/434463-2.html\">create a course for Lynda.com</a> because I met Lynda.com staff author <a href=\"http://www.raybo.org/\">Ray Villalobos</a> after we both spoke at a conference.</strong> It turned out that we were both speaking at another conference a few months later, so he made a point to check out my talk at that conference. He enjoyed it so he recommended me as a course author. Prior to that I had not even considered authoring a course, and after he sold me on the idea, it because a reality that never would have been had I not met Ray. In addition, at my current role at Comcast I am expected to be having an impact outside of the company, and public speaking is the path I’ve been leaning on to accomplish that.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>The first conference I was accepted to speak at via a CFP was the University of Illinois Web Conference in 2015. When I talked to folks that attended afterwards, everyone had good things to say, but given it was my first talk I essentially took that as I did not too anything terribly wrong, which was a great first step.</p>\n<p>My favorite talk I’ve given so far is “The Critical Career Path Conversation” which I premiered at The Lead Developer NYC in 2018. You can <a href=\"https://www.youtube.com/watch?list=PLBzScQzZ83I8H8_0Qete6Bs5EcW3p0kZF&#x26;v=hMz6QDURQOM\">view it on YouTube</a>, including a fun glitch about one-third of the way through for you all to enjoy watching me struggle &#x26; recover from.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/hMz6QDURQOM' frameborder='0' allowfullscreen></iframe></div>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve applied to about 70 so far and spoken at 20.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>Yes, but I wouldn’t recommend it 😜.</p>\n<p>I usually spend the hour before looking and my slide notes one last time and inevitably tweak a few things here or there. My system is to write out what I’m planning to say for each slide in the slide notes but then I rarely ever follow it directly once I start talking. It’s just a comfort feeling knowing that if I totally forget what I was going to say, the script is there.</p>\n<p>The last thing I do, which I do recommend, is to <strong>make sure you start off smiling</strong> 😃.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>There is so much I could say here but I’ll limit it to a few quick hits:</p>\n<ol>\n<li>\n<p><strong>Imposter syndrome is real and a totally normal feeling</strong>, so do not let that hold you back. Especially early on, I always had a feeling of “everyone in the audience will already know what I’m talking about.” That is not the case. If they did, they would not be there. Those that show up want to hear YOU and learn from your experiences. If it turns out there are a few people that decide to leave during the talk for whatever reason, there is nothing wrong with that.</p>\n</li>\n<li>\n<p>During the intro of your talk, let the audience know how you intend to take questions (raise your hand during the talk, hold them until the end, chat in the hallway later, email, etc.). If someone asks a question that you don’t know the answer to, it is much better to say “That is a great question. I don’t know what the answer is so let me get back to you,” than to try to make up an answer on the spot.</p>\n</li>\n<li>\n<p>My CFP acceptance rate went up when I internalized <a href=\"https://twitter.com/getify/status/804018344412217344\">this piece of advice from Fluent organizer Kyle Simpson</a>:</p>\n</li>\n</ol>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/advice?src=hash&amp;ref_src=twsrc%5Etfw\">#advice</a> <a href=\"https://twitter.com/hashtag/designingATalk?src=hash&amp;ref_src=twsrc%5Etfw\">#designingATalk</a><br><br>OK talks are about the topic.<br><br>Good talks are about the speaker/presentation.<br><br>Great talks are about the audience.</p>&mdash; getify (@getify) <a href=\"https://twitter.com/getify/status/804018344412217344?ref_src=twsrc%5Etfw\">November 30, 2016</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>There are 2 in particular that I look up to:</p>\n<p><a href=\"https://meowni.ca/\">Monica Dinculescu</a> because when it comes to technical knowledge, she does an excellent job of taking a topic and distilling it down so that the audience can understand it and apply it immediately. She is able to do it while keeping her talk entertaining with healthy doses of humor and emojis.</p>\n<p><a href=\"http://www.agiledeveloper.com/\">Venkat Subramaniam</a> is a marathon speaker that I am amazed by. He is a superhuman when it comes to learning new content and teaching it. At the last conference I spoke at, Venkat delivered a full day workshop on the first day and then gave a talk at literally every possible speaking slot over the course of the next 3 days, which totaled 13 separate 90 minute talks. The thing that amazes me even more (especially given my typical pre-talk routine) is he has no slides. He starts off each talk with some bullet point topics in a text editor and the magic happens from there.</p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>I tweet infrequently at <a href=\"https://twitter.com/johnriv?lang=en\">@JohnRiv</a>. In the middle of July I’ll be at <a href=\"https://uberconf.com\">ÜberConf</a> in Denver running a full-day workshop on Web Components and giving a couple talks in the days that follow. As the name suggests, ÜberConf covers a ton of topics related to software development, and Venkat Subramaniam will be speaking there, so if you’re not already familiar with the conference, check it out!</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: John Riviello, Frontend Web Developer","path":"/blog/speakers-story-john-riviello/","category":"Speaker's Story","tags":null,"date":"2019/05/25","image":"https://drive.google.com/uc?id=1_tg_KavLUtRf2te9DB1qu8fy1ybINI_N"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Jaime and I shared the stage once at <a href=\"https://theleaddeveloper.com/\">The Lead Dev</a>, and since then I’ve gotten to know Jaime a bit more on Twitter and by following his podcast, <a href=\"https://mtjc.fireside.fm/\">More Than Just Code</a>. Jaime has spoken at a lot of conferences, but like many of us, he’s applied at an order of magnitude more. Read on to learn more about his process and some of his suggestions for new speakers.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/ozbikNQ.png\" class=\"left\">\n<p>I’m Jaime Lopez Jr and I’m a software developer by day and a podcaster by night.</p>\n<p>I got into public speaking because I wanted to reach a new audience where I could share my knowledge, experiences, and stories. I’ve co-hosted a podcast (<a href=\"https://mtjc.fireside.fm/\">More Than Just Code</a>) for the past 4-5 years, so public speaking was a natural extension of that experience.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I like being able to share things that I have learned because I hope that my experiences can be helpful to others who encounter the same struggles that I have encountered.</p>\n<p>Speaking at conferences has benefited my career by providing an opportunity to meet other people in the industry that I wouldn’t ordinarily get a chance to meet!</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I do remember my first conference talk. I co-presented a talk at 360iDev in Denver, Colorado with <a href=\"https://twitter.com/timmitra\">Tim Mitra</a> (my friend and a co-host of More Than Just Code).</p>\n<p>The talk went very well from what I recall. The topic was about the way that hosting a technical podcast can help developers in their careers, which plays to our strengths as experienced podcasters. Of course it also helped that we had a few die-hard fans in the audience!</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Looking at my Google Sheets spreadsheet where I track this, I’ve applied to about <strong>115 conferences in the past three years or so</strong>. I’ve been accepted by 14 conferences and have spoken at (or am scheduled to speak at) 9 of those conferences.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I like to find a quiet place to collect my thoughts about an hour prior to when I give my presentation. It certainly helps when there is a dedicated room for speakers to do this! Also, if possible I try to check out the room where I’ll be speaking so I can get a sense of the acoustics as well as how the audience will experience the presentation.</p>\n<p><strong>I generally try not to memorize my talks because it causes me to become robotic when speaking</strong>. Instead, I walk through the main points (generally a single word) that I want to mention related to my slides or code that I’m sharing.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>There is one main piece of advice that I can give new speakers:</p>\n<p><strong>It is usually difficult to get started as a conference speaker in terms of getting your CFP submissions accepted. This is totally okay and you don’t need to worry about it!</strong></p>\n<p>I subscribed to the (now-defunct) <a href=\"https://techspeak.email/\">Technically Speaking newsletter</a> that was put together by Chiu-Ki Chan and Cate Huston. The content in that newsletter (which is still available online) helped me craft my CFP submissions so that there is a better chance of being accepted. As well, the Technically Speaking newsletter helped me feel better about CFP acceptance rates (which if I recall they said was somewhere about 10%).</p>\n<p>If I’ve learned anything over the past few years of submitting to CFPs, <strong>it’s that it is better to submit to many conferences that you think would benefit from your talk than it is to be fixated on any particular conference</strong> (which puts all of your hopes and dreams on a single CFP).</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>There are two speakers that come to mind.</p>\n<p>First is <a href=\"https://twitter.com/savinola\">Laura Savino</a>. The way she gives technical presentations makes the audience feel as if they’re going along on a shared journey. Each step of the way seems like a friend is sharing their favorite locations in an unfamiliar city.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/vkb9z68nhyo' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Readable Code - Laura Savino - DDD Europe 2018</em></p>\n<p>Second is <a href=\"https://twitter.com/nmeans\">Nickolas Means</a>. I’ve been impressed with the way that he can smoothly deliver stories that involve a lot of technical detail. The way he presents the topics at hand leaves the audience on the edge of their seat.</p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>I have a website: <a href=\"http://www.devwiththehair.com/\">http://www.devwiththehair.com/</a></p>\n<p>I co-host <a href=\"https://mtjc.fireside.fm/\">the More Than Just Code podcast</a></p>\n<p>I’m on Twitter: <a href=\"https://twitter.com/DevWithTheHair\">@DevWithTheHair</a></p>\n<p>My upcoming and previous conference talks <a href=\"https://github.com/DevWithTheHair/Conference-Talks\">can be found on GitHub</a></p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Jaime Lopez, the Dev With the Hair","path":"/blog/speakers-story-jaime-lopez-jr/","category":"Speaker's Story","tags":null,"date":"2019/05/17","image":"https://drive.google.com/uc?id=1E953n9DzKH8Iwj9fMtRAhLpRy8O9F9S2"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Jason’s story is very similar to my own when it comes to speaking, but he’s been at it quite a bit longer. Now, he’s\nbuilt a name for himself in the Ruby community as one of the top people in testing, and has spoken internationally at events\nof all sizes. I’ve dealt with the problem of testing legacy systems before, so <a href=\"https://www.youtube.com/watch?v=NTr0h4v-jHw\">I enjoyed Jason’s talk on the issue</a>. Read on to learn more about Jason’s experience and advice for fellow speakers.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/BkjG0j1.jpg\" class=\"left\">\n<p>I don’t remember exactly how or why I first got into public speaking. I believe my first tech talks were at small user groups in the Grand Rapids, Michigan tech community around 2010 or so. From there I got into guesting on podcasts, then hosting my own podcast, and then speaking at conferences.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I have an altruistic reason and a selfish reason for speaking at conferences:</p>\n<p>The altruistic reason is that I can help a lot of people by speaking at conferences and sharing my message with attendees.</p>\n<p>The selfish reason is that speaking at conferences is a good way to boost my career prospects as a technology consultant. Since I’ve only started speaking at conferences about six months ago, I think it’s too early to expect to see any tangible benefit from it yet. One way conference speaking has intangibly benefited me though is that I can now list in my bio that I’ve spoken at certain conferences like RubyConf India which I think carries a lot of weight among my peers, and I can truthfully say that I’m an “international speaker”.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first conference talk was at a regional conference called DevOpsDays Midwest in St. Louis, Missouri in September 2018. Since I had already been speaking at local user groups for years before that point, this speaking gig didn’t feel like too big of a jump up. I’m happy to say that as far as I can tell, the talk went fine.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve applied to many dozens of conferences. I’ve spoken at five conferences at the time of this interview with two more conference talks coming up, for a total of seven. I’ve been accepted to more conferences than that but sometimes I can’t go because there’s a schedule conflict or the travel expense is too much to justify at the time.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I don’t have a pre-talk routine. I rehearse beforehand but on the day of the talk I just get up and do it.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>I only have one piece of advice: If getting a talk proposal accepted seems like an unattainable goal, just keep sending in proposals and you’ll probably eventually get something accepted.</p>\n<p>I had to submit dozens of proposals before I finally got a talk accepted, at least a talk at a conference I was able to attend. At this point I’ve actually gotten more talks accepted than I can take on and I’ve had to throttle back on sending in proposals. The act of giving my first talk gave me a couple ideas for my next talk. My next talk gave me several more ideas for future talks, and so on. The more I submitted proposals and the more I spoke, the easier it all got.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I think part of my motivation for speaking at conferences was seeing the success that my friend <a href=\"https://twitter.com/AlainChautard\">Alain Chautard</a> has had with it and seeing the impact speaking has had on his consulting career.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/wJwvmuK4tQw' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Alain Chautard at NG Conf 2018</em></p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>You can learn more about me and what I do at <a href=\"https://www.codewithjason.com/\">CodeWithJason.com</a>. Any of <a href=\"https://www.codewithjason.com/speaking/\">my upcoming speaking gigs can be found here</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Jason Swett, Podcaster and Ruby Testing Aficionado","path":"/blog/speakers-story-jason-swett/","category":"Speaker's Story","tags":null,"date":"2019/05/11","image":"https://drive.google.com/uc?id=1OSlfQKq_bPROpzgzgrsg4eO8e6dDGot2"}}}],"pathPrefix":"content","first":false,"last":false,"index":5,"pageCount":8,"additionalContext":{}}}