{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"remark":{"posts":[{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>As companies recognize the need for accessible software on the web, conference speakers like Adrián are finding more opportunities to spread the word. After speaking at local several meetups, Adrián started applying to conferences and has now been a speaker at 4 international gatherings. One of my favorite parts about speaking is the same as Adrián’s: meeting people from around the world.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/sZRtBDT.jpg?1\" class=\"left\">\n<p>My name is Adrián Bolonio. I’m an experienced Spanish Frontend developer and Web Team Lead, focusing now in Web Accessibility (a11y). Since 2012 I’ve been living and working in Vienna. I currently work at <a href=\"www.willhaben.at\">willhaben</a>, the biggest classified company in Austria with the 2nd highest traffic of all Austrian websites.</p>\n<p>I started speaking at local meetups in Vienna, such as ViennaJS, ReactJS and then I talked at the DevFest Vienna, organised by the local Google Developer Group. I had the opportunity to organise an internal frontend conference inside my company for 100 people and I gave a talk as well there. I’m now sending more CFPs to International conferences to continue my speaking path.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I like the feeling to contribution to the community. Sharing the knowledge I’ve acquired over the years as a developer helps me improve my public speaking skills as well. Another thing that I love from conferences is networking and meeting new and amazingly interesting people from all over the world who share your interest and sometimes even hobbies.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I do remember my first talk. It was in the Vienna JS meetup, and I talked about a new library my team and I built at my current company. The idea was to share the library and promote it as open-source so anyone could use it. I was extremely nervous before going onto the stage, but the fact that my audience were developers too allowed me to relax a bit. At the end it went very well and smoothly. I got some very interesting questions after the talk and the people liked it.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/tJXzyHHh4pc' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Adrián Bolonio at ViennaJS</em></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve applied to around 15 international conferences so far. In the last 2 years I’ve been accepted to 4 conferences and several meetups.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/yKYA-7tczuk' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Adrián Bolonio on Accessibility at DevFest Vienna, 2018</em></p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>At the beginning I was nervous and my only routine was trying to calm down. Now I’m a bit more experienced, so I check that my computer has enough battery or I have a charger that works. I check that all my other applications are closed and my notifications are muted. I check that the microphone works properly and the screen where the presentation is shown is readable from any point in the venue.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>I think the best and more difficult advice is “calm down”.</p>\n<p>It’s ok to be a bit nervous, but try to understand that if you have been chosen to give a talk at a conference or at a local meetup it’s because you’re an expert in that field, so you know what you’re talking about. Just calm down, enjoy the talk, and accept any feedback.</p>\n<p>It needs to be fun for you, you don’t have to suffer, so please enjoy the process.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>Since I’m very focused now on Web Accessibility I follow a lot of experts, but some of them are <a href=\"https://twitter.com/mmatuzo\">Manuel Matuzovic</a>, <a href=\"https://twitter.com/_sergeikriger\">Sergei Kriger</a> and <a href=\"https://twitter.com/marcysutton\">Marcy Sutton</a>.</p>\n<h3>Where can readers find more about you?</h3>\n<p>My next speaker appearance in a conference will be at the <a href=\"https://jsconf.co/\">JSConf Colombia</a> on October 18th &#x26; 19th, 2019. You can follow me in <a href=\"https://twitter.com/bolonio\">Twitter</a> or <a href=\"https://www.instagram.com/bolonio/\">Instagram</a>, and check <a href=\"https://speakerdeck.com/bolonio/\">my latest talk slides on my deck</a> as well as my repositories in <a href=\"https://github.com/bolonio\">GitHub</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Adrián Bolonio, Team Lead and Accessibility Advocate","path":"/blog/speaker-adrian-bolonio/","category":"Speaker's Story","tags":null,"date":"2019/08/30","image":"https://i.imgur.com/sZRtBDT.jpg?1"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>It’s no surprise that many tech conference speakers are also involved or helping organize local meetup groups. My\nguest this week - JC Hiatt - actually runs three of them, and this year he organized <a href=\"https://magnoliajs.com/\">his first conference</a>.\nIn addition, JC works as a software engineer and is on track to speak at several conferences in the upcoming year. JC has some\ngreat tips for speakers - from both an organizer’s and speaker’s perspective.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/9yzgNfr.jpg\" class=\"right\">\n<p>I work as Software Engineer at Growth Manager at <a href=\"https://echobind.com/\">Echobind</a>, a remote web and mobile consultancy for healthcare, life science, and technology companies (we’re hiring!) . On the side, I am also working on growing DevLifts, a company I started to help developers get fit.</p>\n<p>I got into public speaking through starting to speak at local meetups a few years ago, and then subsequently running 3 meetups and having a hard time finding speakers sometimes.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I love speaking at conferences because I get to share my ideas with a lot of people in a conversational (and more human) manner (as opposed to Twitter) and have those ideas put to the test. I also love getting to meet lots of new developers! Attending conferences is obviously a way to do that, but speaking can make it easier since people will want to come talk to you after your talk.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I actually just gave my first conference talk earlier this month! Going into it, I was a little nervous just because I was covering a fairly sensitive topic (fitness &#x26; health), but it went great. I got to meet a bunch of developers and hear about what they do to stay fit and healthy.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Until recently, I had applied to maybe 5-6 conferences and been rejected by all by 1. But in the past 2 months I got more aggressive with it and have applied to 30ish conferences. I’ve been accepted by 3 so far.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>About 15 minutes before, I’ll make sure to find the MC (or whoever is in charge of getting me to the right place for my talk) and checking in with them so they know where I am. I’ll have a glass of water and go to the bathroom. Then I’ll grab another glass of water to sip throughout the talk if necessary. I’ll also turn my phone off and put it in my backpack or somewhere not on my person. Most importantly, I always make sure my notifications are muted!!!</p>\n<h3>What advice do you have for new speakers?</h3>\n<p><a href=\"https://twitter.com/GantLaborde\">Gant Laborde</a> gave me some fantastic advice before my first conference talk. I was a bit nervous and he said, “You’re not nervous. You’re excited.”</p>\n<p>Nervousness is inward focused — I’m afraid I’ll screw up, I’m afraid something will go wrong, I’m afraid they’ll hate my talk, I’m afraid I’ll start Twitter war.</p>\n<p>Being excited is outward focused — I’m excited to give this talk to help others with this area of their lives. I’m doing this because I want to help other developers. If at least one person walks away feeling good/empowered/excited/etc., I’ll be happy.</p>\n<p>As a conference organizer, I’ll also say to new speakers:</p>\n<ol>\n<li>\n<p>Show up early (at least an hour before your talk). This makes the organizers much less stressed if they know you are in the building because they’ve seen you.</p>\n</li>\n<li>\n<p>Make sure the MC can find you 15-20 minutes before your talk.</p>\n</li>\n<li>\n<p>Practice your talk. If you didn’t, it’s obvious.</p>\n</li>\n<li>\n<p>Be flexible. Organizing conferences is hard and usually being done for free as a labor of love. Being a diva because you can’t get a certain type of water will definitely get you on the <em>do-not-invite-back</em> list.</p>\n</li>\n</ol>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>So many, but here are a few:</p>\n<ol>\n<li>\n<p><a href=\"https://twitter.com/GantLaborde\">Gant Laborde</a> is hands down the best speaker I know. I love being part of his audience.</p>\n</li>\n<li>\n<p><a href=\"https://twitter.com/ken_wheeler\">Ken Wheeler</a> has the best combination of jokes and crazy good demos.</p>\n</li>\n<li>\n<p><a href=\"https://twitter.com/dabit3\">Nader Dabit</a> got me into speaking because he’s one of the first people I saw give a tech talk at our local meetup years ago.</p>\n</li>\n<li>\n<p><a href=\"https://twitter.com/dan_abramov\">Dan Abramov</a> because daaaaaang does that dude know how to keep a crowd engaged.</p>\n</li>\n<li>\n<p><a href=\"https://twitter.com/holtbt\">Brian Holt</a> because his talks have always been funny, mind-blowing, and approachable to me.</p>\n</li>\n</ol>\n<h3>Where can readers find more about you?</h3>\n<p>My next scheduled conference talk is at <a href=\"https://connect.tech/\">Connect.tech</a> this October! Also check out my websites and Twitter accounts:</p>\n<ul>\n<li><a href=\"https://jchiatt.com\">jchiatt.com</a></li>\n<li><a href=\"https://twitter.com/jchiatt\">@jchiatt</a></li>\n<li><a href=\"https://devlifts.io\">devlifts.io</a></li>\n</ul>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: JC Hiatt, Meetup and Conference Organizer Turned Speaker","path":"/blog/speaker-jc-hiatt/","category":"Speaker's Story","tags":null,"date":"2019/08/16","image":"https://i.imgur.com/9yzgNfr.jpg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>At 23 years old, most software developers are just happy landing their first job, but for Tae’lur, that wasn’t enough. A self-taught developer and technical writer, Tae’lur has used her gift for breaking down complex topics to inspire and teach other aspiring developers across the world. Just two years ago, she was working at a minimum wage fast-food job, and now she’s been accepted to speak at 8 tech conferences about topics ranging from her journey to VR development in React. Not many stories out there are as inspiring at Tae’lur’s, so read on and hear what she’s learned along the way.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/Y6wxxj3.jpg\" class=\"left\">\n<p>I am a Front-End Engineer and technical content creator. I’m currently a freelance technical writer and in my current contract position, I’m writing product documentation &#x26; user guides. I also write tutorials on topics such as Git &#x26; Gatsby.</p>\n<p>My mission is to make the learning curve of software development an easier process for everyone. I got into speaking after I was invited to share my story of how <a href=\"https://twitter.com/TaelurAlexis/status/1046663234978115585\">I transitioned into tech from fast food</a> at CascadiaJS in November 2018. A few months later, I decided to just follow accounts like <a href=\"https://twitter.com/cfp_land\">@cfpland</a> and submit talks!</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I like how I’m putting myself out there and slowly yet surely coming out of my introverted shell. I’ve always had a secret obsession with researching and curating resources so being able to travel and present my findings is my thing. The public speaking is a strategic move, my goal is to get into developer advocacy.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/7idBFx7erWA' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Tae’lur Alexis, “Creating 3D User Experiences with React” at React 360</em></p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first solo conference talk was just recently actually! It occurred June 6, 2019. It was RefactrTech, a conference based in Atlanta and the presentation was titled, “Building Accessible UI with React”. The talk consisted of me discussing ways you can improve the accessibility of your application and the different libraries and tools you can use.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve applied to at least 15, have been accepted to 8 and have spoken at one so far.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>My process has so far been to gather so many resources on the topic I’m presenting on and read through the documentation and possibly experiment with building demos. Building demos can really help you with learning the ins and outs on a topic and you never know what you may uncover.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>Advice I’d give to new speakers before they give a talk is to remember these are regular people who are rooting for you. And the biggest step is to just be there. And when it’s over, it’s over. Afterwards you’re free to roam, explore and breathe.</p>\n<p>You don’t need to be an expert, just be passionately curious. Follow @cfp_land, have an interesting talk title and abstract (summary of what your talk would be on) and just submit to every conference that’s relevant to your interests. You can submit multiple talks and I highly encourage you do so. People call this “conference-driven development”. The submissions are reviewed and approved MONTHS before the conference actually happens so you’ll have time.</p>\n<p>Another way to find conferences that’s worked for me is to literally search “tech cfp” on Twitter!</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p><a href=\"https://twitter.com/eveporcello\">Eve Porcello</a> and <a href=\"https://twitter.com/marcysutton\">Marcy Sutton</a> are my top inspirations.</p>\n<p>CascadiaJS was the first conference I’ve ever attended and as stated, it occurred in November 2018. Eve Porcello invited me to her GraphQL workshop at CascadiaJS in Seattle and seeing how comfortable she was presenting on such an advanced topic was so inspiring. And then to know she’s authored O’Reilly books and travels doing conference talks and workshops for a living BLEW. MY. MIND.</p>\n<p>Then I meet Marcy Sutton who embraced me after I spoke on stage about my story. Her passion around accessibility and learning more about her role in developer advocacy is literally why I do what I do today. They are both the reason why I’ve pursued accessibility and developer advocacy. I want to be able to use my interest in writing and community engagement to make an impact and have a nomadic career.</p>\n<h3>Where can readers find more about you?</h3>\n<p>You can <a href=\"https://www.twitter.com/TaelurAlexis\">follow me on Twitter</a> and I post weekend recaps on what I have going on in my life <a href=\"https://www.youtube.com/user/TaelurAlexis\">on YouTube here</a>.</p>\n<p>I’m building an online platform called <a href=\"https://codeeveryday.io/\">CodeEveryday</a> where I’m providing learning resources, mentorship and job postings so you can subscribe to the newsletter as we prep for the release! You can subscribe to the newsletter at <a href=\"https://codeeveryday.io/\">CodeEveryday.io</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Tae’lur Alexis, Frontend Engineer and Founder of CodeEveryday","path":"/blog/speaker-taelur-alexis/","category":"Speaker's Story","tags":null,"date":"2019/08/09","image":"https://i.imgur.com/Y6wxxj3.jpg"}}}]},"conferences":{"edges":[{"node":{"data":{"name":"SDD Conference","cfp_url":"https://sessionize.com/sdd-2020","cfp_due_date":"2019-09-13","icon":[{"url":"https://dl.airtable.com/.attachments/d52b1b831b0ff9177a14fa451dafa3d1/53f5e280/favicon.ico"}],"location":"London","category":[{"data":{"name":"General"}}],"is_new":0,"event_start_date":"2020-05-11","perks_checked":true,"travel_covered":true,"hotel_covered":true,"stipend_covered":null}}},{"node":{"data":{"name":"Kotlin/Everywhere Twin Cities","cfp_url":"https://papercall.io/cfps/2534/submissions/new","cfp_due_date":"2019-09-14","icon":[{"url":"https://dl.airtable.com/.attachments/d2a6456da77b6f90dc14e21891aa6b36/f8896d9e/mvimg-20181004-134410.jpg"}],"location":"Minneapolis, MN","category":[{"data":{"name":"General"}}],"is_new":1,"event_start_date":"2019-10-05","perks_checked":null,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"STAREAST","cfp_url":"https://stareast.techwell.com/speak-stareast","cfp_due_date":"2019-09-15","icon":[{"url":"https://dl.airtable.com/.attachments/655d7494bd728742401166b119b0b7b8/601c3273/favicon.ico"}],"location":"Orlando, FL","category":[{"data":{"name":"General"}}],"is_new":0,"event_start_date":"2020-05-03","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"DevCon","cfp_url":"https://papercall.io/cfps/2432/submissions/new","cfp_due_date":"2019-10-01","icon":null,"location":"Bucharest","category":[{"data":{"name":"General"}}],"is_new":0,"event_start_date":"2019-11-12","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"PyCascades 2020","cfp_url":"https://papercall.io/cfps/2526/submissions/new","cfp_due_date":"2019-10-01","icon":[{"url":"https://dl.airtable.com/.attachments/5cea2437e9f0be574b22c3892d49f79e/51c27bef/pycascades.com"}],"location":"Portland, OR","category":[{"data":{"name":"Python"}}],"is_new":0,"event_start_date":"2020-02-08","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":true}}},{"node":{"data":{"name":"JS Fest","cfp_url":"http://jsfest.com.ua/speakers_eng.html","cfp_due_date":"2019-10-01","icon":[{"url":"https://dl.airtable.com/.attachments/7ff2b09cdb0542b60507a69398cb5ec1/179139d5/js_fest_logo_50.png"}],"location":"Kyiv, Ukraine","category":[{"data":{"name":"Javascript"}}],"is_new":0,"event_start_date":"2019-11-08","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"GDG DevFest Karlsruhe","cfp_url":"https://docs.google.com/forms/d/e/1FAIpQLSf1C8A6NWySW__QfOfYOPz6ZDFuBvq5uHkbgSfREgmWiHcOSg/viewform","cfp_due_date":"2019-10-01","icon":[{"url":"https://dl.airtable.com/.attachments/f80a375772b0bef1fb935a8454203bf1/f9a16ded/devfest-banner-192.png"}],"location":"Karlsruhe, Germany","category":[{"data":{"name":"General"}}],"is_new":0,"event_start_date":"2019-11-09","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"PyData LA 2019","cfp_url":"https://pydata.org/la2019/cfp/","cfp_due_date":"2019-10-01","icon":[{"url":"https://dl.airtable.com/.attachments/9415f61132b2aa3d2ecfa5e8c1eb71e0/fa881090/favicon-194x194.99b817422e69.png"}],"location":"Los Angeles, CA","category":[{"data":{"name":"Python"}}],"is_new":0,"event_start_date":"2019-12-03","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"UX Healthcare","cfp_url":"https://docs.google.com/forms/d/e/1FAIpQLScaCNQf7_X9XG9v_Jw0BiL__s0IE3gOPLrA5vC8wYNq7fhcsg/viewform","cfp_due_date":"2019-09-30","icon":[{"url":"https://dl.airtable.com/.attachments/3bdd8fa5d1ec0311b310d5b38a7d0a81/69d11642/Favicon-300x300.png"}],"location":"London, U.K.","category":[{"data":{"name":"Design"}}],"is_new":0,"event_start_date":"2020-04-22","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"FlawCon 2019","cfp_url":"https://papercall.io/cfps/2556/submissions/new","cfp_due_date":"2019-09-30","icon":[{"url":"https://dl.airtable.com/.attachments/8ce0c5c279485b96733c7d371c5c0b68/441f1481/banner.png"}],"location":"Manchester, UK","category":[{"data":{"name":"Security"}}],"is_new":0,"event_start_date":"2019-10-20","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"JSConf Hawai'i","cfp_url":"https://sessionize.com/jsconf-hawaii-2020","cfp_due_date":"2019-09-30","icon":[{"url":"https://dl.airtable.com/.attachments/c91577aa8601b56903d0122bc3d71279/73cb6ae4/favicon-192x192.png"}],"location":"Honolulu, U.S.A.","category":[{"data":{"name":"Javascript"}}],"is_new":0,"event_start_date":"2020-02-05","perks_checked":true,"travel_covered":true,"hotel_covered":true,"stipend_covered":null}}},{"node":{"data":{"name":"DevRelCon London 2019","cfp_url":"https://papercall.io/cfps/1983/submissions/new","cfp_due_date":"2019-09-30","icon":[{"url":"https://dl.airtable.com/.attachments/9257b8d23e970a10f3c090dde1626401/4bbfd431/DevRelCon-London2019-Hoopy-x-MongoDB.png"}],"location":"London","category":[{"data":{"name":"General"}}],"is_new":0,"event_start_date":"2019-12-11","perks_checked":true,"travel_covered":true,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"Startup Istanbul","cfp_url":"https://startupistanbul.com/SpeakerApplications","cfp_due_date":"2019-09-30","icon":[{"url":"https://dl.airtable.com/.attachments/f90906c6cdc47a95ae9a52550d70cd83/bddb94da/favicon.png"}],"location":"Istanbul, Turkey","category":[{"data":{"name":"General"}}],"is_new":0,"event_start_date":"2019-10-18","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"JS Poland","cfp_url":"https://docs.google.com/forms/d/e/1FAIpQLSeVsK-OA9HudBjk7CpkKNCK8M_DD4_DF-AsFLAP8wdHeZ3O-g/viewform","cfp_due_date":"2019-09-30","icon":[{"url":"https://dl.airtable.com/.attachments/92d924b94ecbc4d5da754ba49afd5d1e/78895cee/android-icon-192x192.png"}],"location":"Warsaw, Poland","category":[{"data":{"name":"Javascript"}}],"is_new":0,"event_start_date":"2019-11-22","perks_checked":true,"travel_covered":true,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"ngPoland","cfp_url":"https://docs.google.com/forms/d/e/1FAIpQLSeVsK-OA9HudBjk7CpkKNCK8M_DD4_DF-AsFLAP8wdHeZ3O-g/viewform","cfp_due_date":"2019-09-30","icon":[{"url":"https://dl.airtable.com/.attachments/e3262bdcbb225258cf7803dd1756e220/ad032456/android-icon-192x192.png"}],"location":"Warsaw, Poland","category":[{"data":{"name":"Javascript"}}],"is_new":0,"event_start_date":"2019-11-21","perks_checked":true,"travel_covered":true,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"Redis Day London","cfp_url":"https://sessionize.com/redis-day-london-2019/","cfp_due_date":"2019-09-27","icon":[{"url":"https://dl.airtable.com/.attachments/1a3fa507567b827116bd491a2aca4f06/c965bdbe/android-chrome-192x192.png"}],"location":"London, UK","category":[{"data":{"name":"Data"}}],"is_new":0,"event_start_date":"2019-11-11","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"STHLM XPERIENCE CONFERENCE","cfp_url":"https://sthlm.xconf.co/call-for-speakers","cfp_due_date":"2019-09-25","icon":[{"url":"https://dl.airtable.com/.attachments/0273e7b6bc9dc29649ec81d982d879d0/03bfac47/sxc2019-fav.png.png"}],"location":"Stockholm , Sweden","category":[{"data":{"name":"Design"}}],"is_new":1,"event_start_date":"2019-11-14","perks_checked":null,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"DevFest Yamoussoukro 2019","cfp_url":"https://papercall.io/cfps/2358/submissions/new","cfp_due_date":"2019-09-25","icon":[{"url":"https://dl.airtable.com/.attachments/a03f519117453c14644d7fd2e920c80f/94866b99/m_swarm_196x196.b5c9ccb2.png"}],"location":"Yamoussoukro, Ivory Coast","category":[{"data":{"name":"General"}}],"is_new":0,"event_start_date":"2019-10-26","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"DevOpsDays Campinas 2019","cfp_url":"https://papercall.io/cfps/2027/submissions/new","cfp_due_date":"2019-09-25","icon":[{"url":"https://dl.airtable.com/.attachments/aaf2bd77397ee02b16247d55611f047b/26c09886/android-icon-192x192.png"}],"location":"Campinas, SP","category":[{"data":{"name":"DevOps"}}],"is_new":0,"event_start_date":"2019-10-25","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"building IoT","cfp_url":"https://www.buildingiot.de/call_for_proposals_en.php","cfp_due_date":"2019-09-25","icon":[{"url":"https://dl.airtable.com/.attachments/410420dfa3f813cf63c3ab64c48cb127/a6441285/nurlogo_150.png"}],"location":"Essen, Germany","category":[{"data":{"name":"General"}}],"is_new":0,"event_start_date":"2020-03-02","perks_checked":true,"travel_covered":true,"hotel_covered":true,"stipend_covered":null}}},{"node":{"data":{"name":"New England Drupal Camp","cfp_url":"https://nedcamp.org/submit-session","cfp_due_date":"2019-09-23","icon":[{"url":"https://dl.airtable.com/.attachments/0ca0d2a425a8a686e0739afd55a89a24/72fd09db/nedcamp_logo_word_only.png"}],"location":"Providence, RI, U.S.A.","category":[{"data":{"name":"PHP"}}],"is_new":1,"event_start_date":"2019-11-22","perks_checked":null,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"New England Drupal Camp","cfp_url":"https://nedcamp.org/submit-session","cfp_due_date":"2019-09-23","icon":[{"url":"https://dl.airtable.com/.attachments/d3b9776a8ccfb49e19036ede9cf86d20/55bbd0c0/nedcamp_roadshow_2019.jpg"}],"location":"Providence, RI USA","category":[{"data":{"name":"PHP"}}],"is_new":0,"event_start_date":"2019-11-22","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"DevOps Days Montreal 2019","cfp_url":"https://papercall.io/cfps/2551/submissions/new","cfp_due_date":"2019-09-22","icon":[{"url":"https://dl.airtable.com/.attachments/24f08cb9073e1bdcaa159f2f937c4610/91668a42/android-icon-192x192.png"}],"location":"Montreal Quebec","category":[{"data":{"name":"DevOps"}}],"is_new":0,"event_start_date":"2019-11-05","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"DevFest 2019 Montreal - Cloud and AI/ML","cfp_url":"https://papercall.io/cfps/2509/submissions/new","cfp_due_date":"2019-09-22","icon":[{"url":"https://dl.airtable.com/.attachments/e06a8ab30beebe931473f2a2e3b85314/4898c1eb/icon-192.png"}],"location":"Montreal, Canada","category":[{"data":{"name":"General"}}],"is_new":0,"event_start_date":"2019-09-27","perks_checked":true,"travel_covered":true,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"DevFest 2019 - GDG Montreal","cfp_url":"https://papercall.io/cfps/2500/submissions/new","cfp_due_date":"2019-09-22","icon":[{"url":"https://dl.airtable.com/.attachments/218f84b52a978192123565fb8f1d33c0/ba2d77d0/icon-192.png"}],"location":"Montreal","category":[{"data":{"name":"General"}}],"is_new":0,"event_start_date":"2019-09-28","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"Community Podium 2019 tijdens Techorama","cfp_url":"https://papercall.io/cfps/2474/submissions/new","cfp_due_date":"2019-09-21","icon":[{"url":"https://dl.airtable.com/.attachments/446f552802a73999c220505e075e4b76/be894889/apple-touch-icon.png"}],"location":"Ede","category":[{"data":{"name":"General"}}],"is_new":0,"event_start_date":"2019-10-01","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":".NET Fest","cfp_url":"http://dotnetfest.com/speakers_eng.html","cfp_due_date":"2019-09-21","icon":[{"url":"https://dl.airtable.com/.attachments/c9224566b0ad430251a58fc5632e68bc/998d4b9a/dotnet_fest_logo_250.png"}],"location":"Kyiv, Ukraine","category":[{"data":{"name":".NET"}}],"is_new":0,"event_start_date":"2019-10-25","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"PythonDay México 2019","cfp_url":"https://papercall.io/cfps/2561/submissions/new","cfp_due_date":"2019-09-20","icon":[{"url":"https://dl.airtable.com/.attachments/ccb13509326d3310ffde276d2bb56cd1/93599d3e/pythonday.mx"}],"location":"Ciudad de México","category":[{"data":{"name":"Python"}}],"is_new":1,"event_start_date":"2019-10-18","perks_checked":null,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"LiveWorx","cfp_url":"http://demand.ptc.com/liveworxFY20-become-a-presenter","cfp_due_date":"2019-09-19","icon":null,"location":"Boston, MA","category":[{"data":{"name":"General"}}],"is_new":0,"event_start_date":"2020-06-08","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"DevFest Bucharest 2019","cfp_url":"https://papercall.io/cfps/2429/submissions/new","cfp_due_date":"2019-09-16","icon":[{"url":"https://dl.airtable.com/.attachments/23c36a9d2b87949537e193c0254db1f1/1b1127c1/devfest-bucharest-favicon.png"}],"location":"Bucharest, Romania","category":[{"data":{"name":"DevOps"}}],"is_new":0,"event_start_date":"2019-11-15","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":true}}},{"node":{"data":{"name":"CocoaHeads POA Setembro 2019 - Porto Alegre RS","cfp_url":"https://papercall.io/cfps/2518/submissions/new","cfp_due_date":"2019-09-16","icon":[{"url":"https://dl.airtable.com/.attachments/d19c24b1cff7511519964197c9286d16/7163857b/favicon-2a91ce84e90154e085960901ab1bb910.png"}],"location":"Porto Alegre","category":[{"data":{"name":"General"}}],"is_new":0,"event_start_date":"2019-09-26","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"ConFoo","cfp_url":"https://confoo.ca/en/yul2020/call-for-papers","cfp_due_date":"2019-09-16","icon":[{"url":"https://dl.airtable.com/.attachments/36fe27f72f7b611f93474138fa21f0de/eefcc488/confoo.ca"}],"location":"Montreal","category":[{"data":{"name":"General"}}],"is_new":0,"event_start_date":"2020-02-26","perks_checked":true,"travel_covered":true,"hotel_covered":true,"stipend_covered":null}}},{"node":{"data":{"name":"Software Freedom Day - 2k19","cfp_url":"https://papercall.io/cfps/2538/submissions/new","cfp_due_date":"2019-09-15","icon":[{"url":"https://dl.airtable.com/.attachments/51995d1f89d88ae6cad6fda4782f43f3/e05c8b38/sfd.png"}],"location":"PL Anand Auditorium, Panjab University","category":[{"data":{"name":"General"}}],"is_new":0,"event_start_date":"2019-09-21","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"NSBrazil","cfp_url":"https://papercall.io/cfps/2445/submissions/new","cfp_due_date":"2019-09-15","icon":[{"url":"https://dl.airtable.com/.attachments/798f52882919ecd6cda630de272b3004/71b975ff/fbDez.png"}],"location":"CUBO São Paulo","category":[{"data":{"name":"General"}}],"is_new":0,"event_start_date":"2019-11-09","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"Women Who Code Python Summit","cfp_url":"https://docs.google.com/forms/d/e/1FAIpQLSfgSH98xsAB3c1wt3NiSIldxWKylryllGBzGv6AZox3mXHE-w/viewform","cfp_due_date":"2019-09-15","icon":[{"url":"https://dl.airtable.com/.attachments/ecb9e26d8a446a708da129cea5938df2/1c9e6490/cropped-WWCode-Logo_Square-for-social-192x192.png"}],"location":"Atlanta, U.S.A.","category":[{"data":{"name":"Python"}}],"is_new":0,"event_start_date":"2019-11-02","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"GDG DevFest Wrocław 2019","cfp_url":"https://bit.ly/df19-cfp","cfp_due_date":"2019-09-15","icon":[{"url":"https://dl.airtable.com/.attachments/06f5a8b969974240a4fdfa268ece37c4/a133279a/icon-192.png"}],"location":"Wrocław, Poland","category":[{"data":{"name":"General"}}],"is_new":0,"event_start_date":"2019-11-15","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"iOS Conf SG","cfp_url":"https://www.papercall.io/iosconfsg2020","cfp_due_date":"2019-09-15","icon":null,"location":"Singapore , Singapore","category":[{"data":{"name":"Mobile"}}],"is_new":0,"event_start_date":"2020-01-16","perks_checked":true,"travel_covered":null,"hotel_covered":true,"stipend_covered":null}}},{"node":{"data":{"name":"Webclerks Community Conference","cfp_url":"https://docs.google.com/forms/d/e/1FAIpQLSdMlydittpPpWLcd0tiDqadmAoaQv2nD8F8w4esqwdyKQt1aw/viewform","cfp_due_date":"2019-09-15","icon":[{"url":"https://dl.airtable.com/.attachments/ec8b9c92de85b1f4581b935437028adc/d5d28d13/apple-touch-icon.png"}],"location":"Vienna, Austria","category":[{"data":{"name":"Design"}}],"is_new":0,"event_start_date":"2019-11-25","perks_checked":true,"travel_covered":true,"hotel_covered":true,"stipend_covered":null}}},{"node":{"data":{"name":"HalfStack Phoenix","cfp_url":"https://halfstackconf.com/phoenix/","cfp_due_date":"2019-09-15","icon":[{"url":"https://dl.airtable.com/.attachments/96b6d40b4c9145c8abbb8867b0a9f001/7e3c189e/favicon.png"}],"location":"Phoenix","category":[{"data":{"name":"Javascript"}}],"is_new":0,"event_start_date":"2020-01-17","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"ApexVox 2.0 - Your free .NET conference in Romania","cfp_url":"https://papercall.io/cfps/2343/submissions/new","cfp_due_date":"2019-10-02","icon":[{"url":"https://dl.airtable.com/.attachments/d68d54d1cabc7b010745ffdfb84f97bd/a2adc4d6/favicon.ico.png"}],"location":"Cluj-Napoca, Romania","category":[{"data":{"name":"DevOps"}}],"is_new":0,"event_start_date":"2019-11-02","perks_checked":true,"travel_covered":true,"hotel_covered":true,"stipend_covered":null}}},{"node":{"data":{"name":"RubyConf Colombia 2019 Lightning Talks","cfp_url":"https://papercall.io/cfps/2502/submissions/new","cfp_due_date":"2019-09-17","icon":[{"url":"https://dl.airtable.com/.attachments/0f9183b3127345fb518c185b4205390d/b836aad4/apple-touch-icon.png"}],"location":"Medellin, Colombia","category":[{"data":{"name":"Ruby"}}],"is_new":1,"event_start_date":"2019-09-21","perks_checked":null,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}