{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"feff4add-9b69-5a96-846a-e140feec7422","html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/YjtivW4.jpg\" class=\"right\">\n<p>During the day I’m a senior software engineer at a company called MoreCommerce where we do small and medium-sized business e-commerce and market place offerings. Outside of that, I help maintain various API related OSS projects like Fractal, openapi.tools, standards.rest and a few others. I spend most of my free time doing photography or cycling. </p>\n<p>As for speaking, I got my start at my old PHP user group in Atlanta. I started with a lightning talk and moved up to a full-length talk before breaking into a conference. Im usually pretty shy and quiet, so it was weird at first but it been a lot of fun. </p>\n<h3>What do you like about speaking at conferences?</h3>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<h3>Do you have a pre-talk routine?</h3>\n<h3>What advice do you have for new speakers?</h3>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/YrtANPtnhyg' frameborder='0' allowfullscreen></iframe></div>\n<p><em>TEDIndia: The thrilling potential of SixthSense technology by Pranav Mistry</em></p>\n<h3>Where can readers find more about you?</h3>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Matthew Trask, Open Source Maintainer, Cyclist, and Speaker","path":"/blog/speakers-story-matthew-trask/","category":"Speaker's Story","tags":null,"date":"2019/06/26","image":"https://i.imgur.com/YjtivW4.jpg"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}