{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"90e6e8f9-cf1e-5bc1-bddb-24d9d45331d4","html":"<p>Last year, I heard about a new conference called <a href=\"https://www.developer-first.com/conference\">Developer First</a> specifically for technology\nleaders. There are not a ton of conferences that focus on the people and leadership side of technology, so I was really excited to\napply, and even more honored to be selected for their first year. I also wanted to get to know the conference’s organizer a little better,\nso I reached out to Kate Wardin about doing an interview for CFP Land.</p>\n<p>Kate strikes me as one of those people who is a natural leader, but like many speakers, she started off terrified of getting up in front\nof an audience. Read on to hear her speaker’s story and her tips for new speakers.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://drive.google.com/uc?id=1cuCV5BH66UNiamgKS4EyAPZgD8Vpiro-\" class=\"right\">\n<p>I am currently a Senior Engineering Manager at Target Corp in Minneapolis, MN. I lead a team of amazing Engineers who build tools for our global supply chain users. Outside of my day job, I founded a company called Developer First to help organizations around the world build strong Engineering teams which I believe starts with developing confident, purposeful and inspiring leaders.</p>\n<p>I was absolutely terrified of public speaking throughout college and into the first couple years of my professional career. I avoided it at all costs and was a terrible speaker in front of an audience of any size. I eventually realized that I couldn’t continue avoiding public speaking and joined my organization’s Toastmaster’s club. I was thrilled to discover a safe and comfortable environment to practice my new skills and overcome my fears. I spent a couple years as a practicing member before being elected President of my local chapter.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>Speaking at conferences is not a requirement of my role, but I enjoy the opportunity to connect with leaders outside of my organization and feel like I am inspiring and influencing others to reflect and potentially shift their mindsets on technical leadership.</p>\n<p><strong>My favorite experiences of speaking at conferences are the conversations I have with folks who approach me after my talk.</strong> It is very rewarding to hear how my ideas resonated with them and even more enjoyable when they share new ideas that I hadn’t thought of!</p>\n<h3>What topics do you typically speak about?</h3>\n<p>I speak about a variety of topics related to the unique challenges of being an engineering leader: people first leadership, time management, prioritization, effective communication, coaching developers, diversity &#x26; inclusion, effective on boarding programs, etc.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first conference talk was part of an executive track at an engineering conference in NYC. I talked so fast that I finished my 45 minute talk in 20 minutes. I remember arriving to the speaker staging room 90 minutes early because I was so nervous that I would be late or not find the location. My confidence and skills were definitely lacking. However, I don’t regret any of it! I was passionate about the topic and strongly believe that you have to start somewhere. No video footage exists (thank goodness).</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Applied: hundreds</p>\n<p>Spoken at: ~25</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/Ut7jEkIf1ac' frameborder='0' allowfullscreen></iframe></div>\n<p><em>”<a href=\"https://www.youtube.com/watch?v=Ut7jEkIf1ac\">Developer First Leadership</a>” by Kate Wardin at React Boston</em></p>\n<h3>What advice do you have for new speakers?</h3>\n<p>I usually run through the slides about an hour before my talk. <strong>The more familiar the ideas are, the more comfortable I am.</strong> After that, I try to relax and maybe go introduce myself to other attendees during the break before my talk.</p>\n<p>Another tip: make sure you check what type of projector or input is needed before you arrive to speak!</p>\n<h3>What advice do you have for new speakers?</h3>\n<ol>\n<li><strong>DON’T WAIT. START WITH ANYTHING.</strong> Submit topics that you feel even somewhat confident to present on, and then invest the time to fully research, compile content, and practice(!!). It is amazing how your idea will flourish and grow the longer you have to reflect on the topic, gather feedback, and learn through other experiences. You just need to start with something - anything that you are passionate about. If you have an idea swirling in your head for longer than a couple weeks, take some time to start drafting an abstract and outline.</li>\n<li>Make sure you propose a topic that you are passionate about. There is nothing worse than a dull speaker who isn’t personally energized by the topic.</li>\n<li>READING THE ROOM: <strong>Nothing kills confidence faster than making eye contact with members of the audience who seem skeptical or not engaged.</strong> I like to find the person (or people) that actively shows feedback (nods, smiles) and focus my attention on them throughout my talk. As for those skeptics, I have found that it is dangerous to interpret the non-verbals of humans that you don’t personally know. In fact, on several occasions, some of those “skeptics” (or so I thought) approached me after my talk and expressed gratitude and shared that they loved my topic.</li>\n<li>Join a frequent flyer/hotel chain rewards program. Admittedly, I also got into conference speaking because I wanted an excuse to travel more and rack up those airline/hotel points. Check and check.</li>\n</ol>\n<h3>Where can readers find more about you?</h3>\n<ul>\n<li><a href=\"https://www.developer-first.com/\">Website</a></li>\n<li><a href=\"https://www.linkedin.com/in/kate-wardin/\">LinkedIn</a></li>\n<li><a href=\"https://twitter.com/developer_first\">Twitter</a></li>\n</ul>\n<p>Upcoming talks: NoFluffJustStuff US tour, StretchCon Budapest, &#x26; Developer First Tech Leadership Conference</p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Kate Wardin, Helping Organizations Build Strong Engineering Teams","path":"/blog/speaker-kate-wardin/","category":"Speaker's Story","tags":null,"date":"2020/02/06","image":"https://drive.google.com/uc?id=1cuCV5BH66UNiamgKS4EyAPZgD8Vpiro-"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}