{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"3286db30-4842-59f7-a575-843b0a99256b","html":"<p>If you’re not happy and fulfilled in your work, you should try to change it, and that’s exactly how Nicolas Fränkel started his career as a Developer Advocate. While many tech conference speakers do it for their own personal development, some are specifically hired to speak, travel, and be a face for the community. That’s what Nicolas does now, but like all speakers, it’s taken a journey to get there. In today’s Speaker Story, we hear how Nicolas got started as well as some of his tips for new conference speakers.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/EOLCiAD.jpg\" class=\"center\">\n<p>I’m Nicolas Fränkel, a Developer Advocate at <a href=\"https://hazelcast.org/\">Hazelcast</a>. My main job is to speak at conferences, so that people know about Hazelcast the In-Memory-Data-Grid and <a href=\"https://jet.hazelcast.org/\">Jet</a>. I’m also the point of contact for the community.</p>\n<p>I’ve been a teacher for more than 20 years, given that the best way to learn is to teach. However, some subjects are not relevant in academia. I discovered the <a href=\"https://vaadin.com/\">Vaadin web framework</a>, and I was so enthralled by it that I wanted to show it to the members of my local Java User Group. That was 7 years ago.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>Public speaking is very energizing, probably similar to drugs, but with no bad side-effects! For example, last summer, I was feeling a bit down with so much travelling around. I arrived at my hotel just a couple of hours before a talk. I wasn’t happy to be there, but I went to give the talk. After that, I felt really better, all bad feelings had been washed away.</p>\n<p>As I mentioned above, I started public speaking at my Java user group one evening. Soon afterwards, when I travelled for work, I started to propose local user groups to host my talk. Then, I took vacations to speak at international conferences. I did more and more of them. <strong>But at one point, I realized that was pretty dumb to be paid to do a dull job (consulting on development/architecture) while taking vacations to do something that I really liked.</strong> One year ago, I steered my career toward Developer Advocacy, which includes a large part of public speaking.</p>\n<h3>What topics do you typically speak about?</h3>\n<p>I’m a tech guy, so in general I stick to technical subjects. They include Java - it has been my bread and butter for years, Kotlin, Spring and Spring Boot, DevOps, Kubernetes and of course, Hazelcast IMDG and Jet.</p>\n<p>I once did a motivational talk, but it was quite hard for me. I might do more organizational/management-related talks in the future, as I already wrote some related blog posts already. But it means going far out of my comfort zone.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I remember my first talk at my local user group very vividly. </p>\n<p>As I mentioned, I was used to teach, but to talk in front of your peers is very different. <strong>When teaching, you speak from a position of power; when speaking in front of your peers, they will judge you - in a good or a bad way, and it will have a lasting effect.</strong> For this reason, I had asked some good friends to come, and they did. The room was overflowing with people, with some sitting on the stairs. I was very nervous before the talk, and in the first few minutes. Then, just like when coding, I focused on the subject at hand and went “into the zone”. I don’t remember the specifics afterwards, it was just “business as usual”.</p>\n<p>I believe the talk went pretty well, as I remember people clapping, and thus it was a great experience that helped me apply to speak again.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I don’t keep the count of the number of conferences I’ve submitted to, but to give you a rough idea, this year, I’ll speak at a total of 68 conferences.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I don’t have routine per se, but I like to be at my place and prepared far in advance (at least 20 minutes). Being early was useful for a conference at the earlier this year, when I noticed very early that the projector didn’t work, and I had to run to find someone to help me.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>Wow, answering this question could easily fill a book!</p>\n<p>Regarding impostor syndrome, the main advice would be the following: I often hear great and skilled people not submitting talks because they’re afraid they have nothing new to say. Well, if that would be the case, not many people would do public speaking. I believe on the opposite that <strong>most people have a unique experience and bring a unique viewpoint, even to subjects that have been spoken about a lot.</strong></p>\n<p>For finding conferences, I use <a href=\"https://www.papercall.io/\">papercall.io</a> and <a href=\"https://sessionize.com/\">sessionize.com</a>. They also allow to write your bio and abstract once, find your conferences, and then submit them at a click of a button.</p>\n<p>For the rest, I already wrote a post named <a href=\"https://blog.frankel.ch/advices-junior-conference-speakers/\">Advices for junior conference speakers</a> that might be of interest. Expect more to come in the future.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I became exposed to the world of Developer Advocacy through <a href=\"https://twitter.com/jbaruch\">Baruch Sadogursky</a>. He was the one that made me understand by his behavior that public speaking could be a job - or at least a part thereof.</p>\n<p>For the sheer number of talks, I need to mention <a href=\"https://twitter.com/starbuxman\">Josh Long</a> and <a href=\"https://twitter.com/venkat_s\">Venkat Subramaniam</a>. As the latter told when he introduced himself during a panel is: “I’m Venkat, I live in a plane”. And then he passed the mic.</p>\n<h3>Where can readers find more about you?</h3>\n<p>I have a <a href=\"https://blog.frankel.ch/\">blog where I publish a weekly post</a>. This is also where you can find <a href=\"https://blog.frankel.ch/speaking/\">my list of talks</a>, present and future. For videos, I keep a <a href=\"https://www.youtube.com/playlist?list=PL0EuBuKK-s1EL-K3okpYwR0QZbAPRVmEG\">list on Youtube</a>. Finally, if you’re into Twitter, you’re welcome to follow me <a href=\"https://twitter.com/nicolas_frankel\">@nicolas_frankel</a>.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/sIuVbVbjZcw' frameborder='0' allowfullscreen></iframe></div>\n<p><em>“Securing the JVM” at Goto 2019 by Nicolas Fränkel</em></p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Nicolas Fränkel, Community Manager and Teacher","path":"/blog/speaker-nicolas-frankel/","category":"Speaker's Story","tags":null,"date":"2019/11/07","image":"https://i.imgur.com/EOLCiAD.jpg"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}