{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"remark":{"posts":[{"post":{"html":"<p>Hundreds of technology conferences take place around the world every year. We catalog <a href=\"/blog/data\">about 400 per year at CFP Land</a>, but there are even more that we don’t find. If you’re new to the field, you might be surprised that there could be that many events, but as this post elaborates, no two tech conferences are alike. These conferences range in size, topic focus, cost, and competitiveness for speakers.</p>\n<h2>How Do Conferences Differ?</h2>\n<p>Let’s take a look at a few of the dimensions you might use to compare technology conferences:</p>\n<h3>1. Breadth and Depth</h3>\n<p>If you’re in a narrow specialty, you may not have the opportunity to meet with many similar professionals in your city often. Some conferences cater to these narrow “niches”, and go really deep into a single area of focus.</p>\n<p>Conversely, there are some tech conferences that cover a huge range of technologies and disciplines. These usually last longer and have multiple “tracks” so attendees can choose the talks they are most interested in.</p>\n<h3>2. Tracks</h3>\n<p>“Tracks” are the way most conferences divide up talks by specialty or area of interest. Some tech conferences may have a track for design, another for development, and a third for product managers. Usually these individual tracks are capped off with one or two keynotes which have broad appeal to most attendees.  </p>\n<blockquote>\n<p>Single-track conferences can be nice because you’re guaranteed the maximum audience size. However, it also means that there may be people in the audience who don’t care about your talk. With a multi-track conference, the people who do attend your talk will be more interested in what you have to say. But this also brings anxiety or disappointment when not as many people choose your talk as you’d like, and you have to give your talk to an awkwardly small crowd.\n<em><a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">Nick Heiner</a></em></p>\n</blockquote>\n<h3>3. Attendees</h3>\n<p>Some niche, regional conferences may attract fewer than 100 attendees. I’ve been to a couple where you didn’t really even need a microphone to reach the whole audience. On the opposite end of the spectrum, there are some tech conferences with thousands of attendees who swarm on massive convention centers for days at a time.</p>\n<p>The smaller ones can be nice if you really want to form close relationships with a few people, but sometimes it’s nice to slip into anonymity at a huge conference and not have to see the same 5 people all the time.</p>\n<h3>4. Frequency</h3>\n<p>The majority of tech conferences happen annually, but there are some with bi-annual cadences. Usually these will hold one event in America and the other in Europe to allow attendees on both hemispheres the opportunity to attend.</p>\n<h3>5. Location</h3>\n<p>Conferences don’t necessarily happen in big cities, but it is more common. If people are traveling to attend, it’s usually easier to host the event in a large, central location. That said, there are some conferences that happen in unique venues: a <a href=\"https://www.codercruise.com/\">cruise ship</a>, an <a href=\"https://www.atechconference.com/\">island</a>, or <a href=\"https://nomadphp.com/\">online</a>.</p>\n<h3>6. Corporate vs. Community Run</h3>\n<p>A few large tech companies run their own conferences with the goal of promoting their technology and building a community of users. For example, <a href=\"https://www.microsoft.com/en-us/ignite\">Microsoft’s Ignite</a> and <a href=\"https://reinvent.awsevents.com/\">Amazon’s re:Invent</a>. Just because these conferences have a clear agenda doesn’t mean the content isn’t valuable though. Many of us rely on keeping up with the latest technology that these companies release.</p>\n<p>Community run conferences sit at the other end of the spectrum. These events are managed by fans or advocates for a particular language, technology, or project, and are often much lower-budget. Some rely on donations; some partner with sponsors; and others charge attendees.</p>\n<blockquote>\n<p>Some conferences are for-profit. Others make little to no money for the organizers, and are largely a labor of love for the community. Some for-profit conferences will masquerade as the latter. Make sure you know what the conference is and if you’re comfortable with it before you accept.\n<em><a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">Nick Heiner</a></em></p>\n</blockquote>\n<p>Running a conference is notoriously challenging and expensive. Organizers have to coordinate a lot of details; pay for food, event space, speakers, and staff; find sponsors; sell tickets…the list goes on! If you’re interested in how this all shakes out, <a href=\"https://2019.jsconf.eu/news/the-jsconf-cssconf-eu-finances/\">JS Conf Europe’s organizers wrote an interesting overview of their finances last year</a>.</p>\n<h2>Why Attend?</h2>\n<p>Plenty of experienced technology professionals never go to or speak at a conference. They can be expensive, take away time from focused work, and awkward - especially if you don’t know anyone there. That said, there are some great reasons to try attending a tech conference sometime:</p>\n<h3>1. Learn New Skills</h3>\n<p>The tools available to technology professionals is changing rapidly, and it can be hard to keep up. Newsletters, blogs, and local usergroups are all a great place to turn, but so are conferences.</p>\n<blockquote>\n<p>Conferences are prime place for learning about new or obscure libraries and packages that you haven’t used before. If it’s been done before, then someone somewhere will eventually give a talk about it.\n<em><a href=\"https://opensource.com/life/16/2/attending-technical-conferences-whats-big-deal\">Deb Nicholson</a></em></p>\n</blockquote>\n<h3>2. Meet New People</h3>\n<p>While attending talks is an obvious way to learn new things at a conference, you may also pick up some new ideas from your fellow attendees. Meeting people at conferences is also a great way to find a job or look for job candidates.</p>\n<blockquote>\n<p>I like meeting like-minded people with the profession in common…I like the positive energy conferences have and regardless of where you work or the number of years of experience one has all of the participants are there to learn and share the experience.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-geshan-manandhar/\">Geshan Manandhar</a></em></p>\n</blockquote>\n<h3>3. Be Inspired</h3>\n<p>Great speakers can motivate you; ignite your passions; inspire you to do something you woudn’t have. Not every tech conference has room for a ton of inspirational talks, but many conferences try to include some of these in their keynote slots.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/dYlT4lU5pb4' frameborder='0' allowfullscreen></iframe></div>\n<p><em>“A Tinker Story” by dina Amin</em></p>\n<h3>4. Have Fun</h3>\n<p>Finally, attending a tech conference can be really fun. Last time I went to <a href=\"https://www.codemash.org/\">Codemash</a>, I got to visit the NASA facilities in Sandusky, Ohio, see the indoor water park, and play virtual reality video games in the arcade for hours after the talks ended.</p>\n<p>If you think attending a tech conference is a great experience, keep reading! Next we’ll learn why you might want to move from the audience to the stage and start speaking at tech conferences too.</p>\n<p><a class=\"text-left d-block\" href=\"../\">Previous: Index</a>\n<a class=\"text-right d-block\" href=\"../why-speak/\">Next: Why Speak? The Reasons People Get on Stage</a></p>","frontmatter":{"layout":"post","title":"An Introduction to Technology Conferences","path":"/guides/speaking/introduction/","category":"Guides","tags":null,"date":null,"image":null}}},{"post":{"html":"<p>While running CFP Land I’ve had the opportunity to meet with and learn from dozens of speakers around the world. The community has been amazingly welcoming and helpful, so I wanted to give some of this knowledge back by releasing a comprehensive guide to speaking at technology conferences.</p>\n<h2>Table of Contents</h2>\n<ol>\n<li><a href=\"./introduction/\">An Introduction to Technology Conferences</a></li>\n<li><a href=\"./why-speak/\">Why Speak? 11 Reasons People Get on Stage</a></li>\n<li><a href=\"./how-conferences-choose/\">How Conferences Choose Speakers</a></li>\n<li><a href=\"./finding-cfps/\">Finding and Selecting CFPs (“Calls for Proposals”)</a></li>\n<li><a href=\"./submitting/\">Submitting Abstracts</a></li>\n<li><a href=\"./success-rejection/\">What Comes Next? Dealing with Success or Rejection</a></li>\n<li><a href=\"./presentation/\">Preparing a Presentation</a></li>\n<li><a href=\"./pre-conference/\">Preparing for a Conference</a></li>\n<li><a href=\"./tips/\">101 Technology Conference Speaking Tips</a></li>\n<li><a href=\"./community/\">Joining the Speaker Community</a></li>\n</ol>\n<p>Whether you’re preparing for your first speaking engagement, speaking at your 100th event, or not sure how to even get started, this guide will get you on the right track. I’ve compiled and organized hundreds of pieces of advice from over 30 interviews I’ve done with speakers as well as some of the blog posts recommended to me along the way.</p>\n<p>Because everyone reading this will start at a different level of experience speaking, you can either jump straight to the section you find most relevant using the Table of Contents above, or read all the sections sequentially by looking for the “Next” link at the bottom of each page.  </p>\n<p>As you read through these chapters, you may have your own ideas or resources to suggest. That’s great! I’d love to continue refining and building this guide with help from the community. Just <a href=\"mailto:info@cfpland.com\">shoot me an email</a> with the tips you’d like to add, and I’ll keep updating this resource.</p>\n<p><a class=\"text-right d-block\" href=\"./introduction/\">Next: An Introduction to Technology Conferences</a></p>","frontmatter":{"layout":"post","title":"The Comprehensive Guide to Speaking at Technology Conferences in 2020","path":"/guides/speaking/","category":"Guides","tags":null,"date":null,"image":null}}},{"post":{"html":"<blockquote>\n<p>Speaking is a numbers game. The great players in baseball only hit the ball 1/3 of the time at best. I find I only get accepted to every 1 out of 3 conferences I apply to. There’s a zillion reasons why your talk wasn’t accepted that has nothing to do with you.</p>\n<p>Too similar to another already accepted\nToo different to the other talks accepted\nTechnical, and they needed more non-technical content\nToo advanced\nToo geared towards beginners\nAll over the place\nToo specific\nNot the right fit for attendees\nYour talk isn’t unique (gave at other confs)\nYour talk is too immature (haven’t given at any other confs)\n<a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></p>\n</blockquote>\n<h2>Handling Rejection</h2>\n<ul>\n<li>Not usually a judgement on you</li>\n<li>Confs get lots of submissions - “Most of JSConfs receive an average of 500 proposals” - <a href=\"https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32\">https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32</a></li>\n<li>“It is usually difficult to get started as a conference speaker in terms of getting your CFP submissions accepted. This is totally okay and you don’t need to worry about it!” - <a href=\"https://www.cfpland.com/blog/speakers-story-jaime-lopez-jr/\">Jaime Lopez</a></li>\n<li>“Look at the talks that were accepted, what did they have in common with your proposal? What did they have that was different? Maybe you can ask some of the people who got talks accepted to share their details &#x26; pitch (things that are not put on the schedule).” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n<li>“It’s like for pull requests: just as you’re not your code, you’re not your submissions. Accept probabilities are not in your favor, and face rejection with the same maturity.” - <a href=\"https://blog.frankel.ch/advices-junior-conference-speakers/\">https://blog.frankel.ch/advices-junior-conference-speakers/</a></li>\n<li>“I really appreciate when conferences give you feedback so you can apply that to the next one you submit to. I’m learning from each rejection I get.” - <a href=\"https://www.cfpland.com/blog/speakers-story-kara-luton/\">https://www.cfpland.com/blog/speakers-story-kara-luton/</a></li>\n<li>“My CFP rejected-to-win ratio is probably around 0.00001 which is definitely an exercise in learning how to accept rejection and not take it personally.” - <a href=\"https://www.cfpland.com/blog/speakers-rizwan-javaid/\">https://www.cfpland.com/blog/speakers-rizwan-javaid/</a></li>\n<li>“you shouldn’t let the rejection emails get you down. I’ve spoken at conferences on three different continents, and I still regularly get rejected. Keep applying and refining your proposals.” - <a href=\"https://www.cfpland.com/blog/speaker-anjuan-simmons/\">https://www.cfpland.com/blog/speaker-anjuan-simmons/</a></li>\n<li>“Some conferences are happy to provide feedback when your session isn’t selected. Ask for it. It doesn’t hurt, and if they have time, they may respond. Some won’t though as they are often dealing with hundreds of sessions.” - <a href=\"https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/\">https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/</a></li>\n<li>“In 2015 I saw a comment on the internet like “it’s the worst thing I ever seen, how organizers allowed him to speak on stage.”. It demotivated me to do anything for half a year. It has taken a while to overcome this bias and give it another try.” - <a href=\"https://medium.com/@tryshchenko/why-am-i-doing-public-speaking-at-tech-events-the-honest-answer-a75d80f85cfd\">https://medium.com/@tryshchenko/why-am-i-doing-public-speaking-at-tech-events-the-honest-answer-a75d80f85cfd</a></li>\n</ul>\n<h2>Getting Accepted</h2>\n<ul>\n<li>Will coordinate details</li>\n<li>conf may not actually happen</li>\n<li>“Imposter syndrome is real and a totally normal feeling, so do not let that hold you back. Especially early on, I always had a feeling of “everyone in the audience will already know what I’m talking about.” That is not the case. If they did, they would not be there. Those that show up want to hear YOU and learn from your experiences. If it turns out there are a few people that decide to leave during the talk for whatever reason, there is nothing wrong with that.” - <a href=\"https://www.cfpland.com/blog/speakers-story-john-riviello/\">John Riviello</a></li>\n<li>While you may not feel like the expert on this topic, the people listening to you came to hear YOU! Remember you’ve got friends in the audience — some you may know, and some you may not know…yet. - <a href=\"https://www.cfpland.com/blog/speakers-story-rhia-dixon/\">https://www.cfpland.com/blog/speakers-story-rhia-dixon/</a></li>\n<li>“I’ve always been extremely uncomfortable with my content not being technical enough because I often feel like I lack technical skill, but I’ve always been confident with the delivery because it seems to come naturally to me for whatever reason.” - <a href=\"https://www.cfpland.com/blog/speakers-story-tejas-kumar/\">https://www.cfpland.com/blog/speakers-story-tejas-kumar/</a></li>\n<li>“Feeling the pre-conference jitters is totally normal. I tell people all the time that if you don’t feel nervous before your talk, including the day of, you might want to go to the doctor. Indeed there is something wrong with your nervous system.” - <a href=\"https://medium.com/@saltnburnem/speaker-tips-legit-feels-b17b30a464d\">https://medium.com/@saltnburnem/speaker-tips-legit-feels-b17b30a464d</a></li>\n</ul>\n<h2>Declining invitations</h2>","frontmatter":{"layout":"post","title":"What Comes Next? Dealing with Success or Rejection","path":"/guides/speaking/success-rejection/","category":"Guides","tags":null,"date":null,"image":null}}}]},"conferences":{"edges":[{"node":{"data":{"name":"Denver JUG Lightning Talks 2019","cfp_url":"https://papercall.io/cfps/2760/submissions/new","cfp_due_date":"2019-12-06","icon":[{"url":"https://dl.airtable.com/.attachments/c97095c99b0ee9e429bc1cd20da8f06d/85cc3cd8/m_swarm_196x196.b5c9ccb2.png"}],"location":"Denver, CO","category":[{"data":{"name":"Java"}}],"is_new":0,"event_start_date":"2019-12-11","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"Full Stack Day New Zealand","cfp_url":"https://cfp.digitalks.io","cfp_due_date":"2019-12-07","icon":[{"url":"https://dl.airtable.com/.attachments/78f7f8ec24bd266c1ea56329866b7a16/b82ae220/fullstackday.png"}],"location":"Auckland, New Zealand","category":[{"data":{"name":"Javascript"}}],"is_new":0,"event_start_date":"2020-03-18","perks_checked":true,"travel_covered":true,"hotel_covered":true,"stipend_covered":null}}},{"node":{"data":{"name":"Nerdzão #200 - Banco de dados","cfp_url":"http://bit.ly/nerdzao-200-c4p","cfp_due_date":"2019-12-07","icon":[{"url":"https://dl.airtable.com/.attachments/8c172cbcf795a9e5f75c4de9a76600c1/3a25ca7e/meetup.com"}],"location":"São Paulo, Brazil","category":[{"data":{"name":"Data"}}],"is_new":1,"event_start_date":"2019-12-09","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"RigaDevDays 2020","cfp_url":"https://papercall.io/cfps/2690/submissions/new","cfp_due_date":"2019-12-09","icon":[{"url":"https://dl.airtable.com/.attachments/8369f4711d28e7b4093b0fe03e2a59cd/4168cc8a/icon-192.png"}],"location":"Riga, Latvia","category":[{"data":{"name":"General"}}],"is_new":0,"event_start_date":"2020-05-20","perks_checked":true,"travel_covered":true,"hotel_covered":true,"stipend_covered":null}}},{"node":{"data":{"name":"O’Reilly Software Architecture Conference","cfp_url":"https://conferences.oreilly.com/software-architecture/sa-ca/public/cfp/773","cfp_due_date":"2019-12-10","icon":[{"url":"https://dl.airtable.com/.attachments/318c40c0e1df7b1ef04997070cc3a1fc/829ce4b7/odot-iphone-icon.png"}],"location":"Santa Clara, U.S.A.","category":[{"data":{"name":"General"}}],"is_new":0,"event_start_date":"2020-06-15","perks_checked":true,"travel_covered":true,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"PHP fwdays'20","cfp_url":"https://php.cfp.fwdays.com/","cfp_due_date":"2019-12-25","icon":[{"url":"https://dl.airtable.com/.attachments/9efd03921850bf5c800da2102cc01fae/1686966c/gallery_image_9.jpg"}],"location":"Mercure Congress Hall","category":[{"data":{"name":"PHP"}}],"is_new":0,"event_start_date":"2020-05-30","perks_checked":true,"travel_covered":true,"hotel_covered":true,"stipend_covered":null}}},{"node":{"data":{"name":"VOXXED DAYS BUCHAREST 2020","cfp_url":"https://papercall.io/cfps/2684/submissions/new","cfp_due_date":"2019-12-24","icon":[{"url":"https://dl.airtable.com/.attachments/df02def8ce7c7ff6dd3600d3403a49e8/65176e0f/icon.jpg"}],"location":"Sheraton Hotel Bucharest","category":[{"data":{"name":"General"}}],"is_new":0,"event_start_date":"2020-03-11","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"FrontCon 2020","cfp_url":"https://papercall.io/cfps/2764/submissions/new","cfp_due_date":"2019-12-20","icon":[{"url":"https://dl.airtable.com/.attachments/c04c7899a122e3828d82c56f87487796/cfefa220/frontcon-logo-white.png"}],"location":"Riga, Latvia","category":[{"data":{"name":"Javascript"}}],"is_new":0,"event_start_date":"2020-04-01","perks_checked":true,"travel_covered":true,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"Hack In Paris 2020","cfp_url":"https://papercall.io/cfps/2574/submissions/new","cfp_due_date":"2019-12-20","icon":[{"url":"https://dl.airtable.com/.attachments/1ca5f27f04cd40680e3d8954ab55cb21/91239b6e/logo_big.png"}],"location":"Maison de la Chimie (75007 Paris - FRANCE)","category":[{"data":{"name":"Security"}}],"is_new":0,"event_start_date":"2020-06-15","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":true}}},{"node":{"data":{"name":"PHP Serbia","cfp_url":"https://cfp.phpsrbija.rs","cfp_due_date":"2019-12-20","icon":[{"url":"https://dl.airtable.com/.attachments/2360b80ad9e72e2d50587361d0e5a961/4c77f88f/phpsrbija2020.jpg"}],"location":"Belgrade, Serbia","category":[{"data":{"name":"PHP"}}],"is_new":0,"event_start_date":"2020-05-21","perks_checked":true,"travel_covered":true,"hotel_covered":true,"stipend_covered":null}}},{"node":{"data":{"name":".NET fwdays'20","cfp_url":"https://docs.google.com/forms/d/e/1FAIpQLScDFCt3QwxTzERuMqirqXaKn8QY9aNh9FmN9oVQJOpxvIHESQ/viewform","cfp_due_date":"2019-12-20","icon":[{"url":"https://dl.airtable.com/.attachments/e39fdeb95d9e21232ff53b6174480b4f/b0a5f6e1/gallery_image_9.jpg"}],"location":"Kyiv, Ukraine","category":[{"data":{"name":".NET"}}],"is_new":0,"event_start_date":"2020-04-11","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"Birmingham On Rails 2020","cfp_url":"https://papercall.io/cfps/2763/submissions/new","cfp_due_date":"2019-12-19","icon":[{"url":"https://dl.airtable.com/.attachments/e96baeea3578a3f1488e52e0f4a6aefb/b30bf16e/Birmingham_on_Rails_Logo-a0241776cfe10e4d92b66b4a8c2a3ff4416e38100e5a6d9535ec76aecdcd54a8.svg"}],"location":"Birmingham, AL","category":[{"data":{"name":"Ruby"}}],"is_new":0,"event_start_date":"2020-01-31","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"Asturias Netconf 2020","cfp_url":"https://papercall.io/cfps/2758/submissions/new","cfp_due_date":"2019-12-16","icon":[{"url":"https://dl.airtable.com/.attachments/d535416ac8ac2a8f52860dfe503c211c/197b1365/007-world.svg"}],"location":"Gijón","category":[{"data":{"name":".NET"}}],"is_new":0,"event_start_date":"2020-02-22","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"QtDay 2020","cfp_url":"https://papercall.io/cfps/2747/submissions/new","cfp_due_date":"2019-12-16","icon":[{"url":"https://dl.airtable.com/.attachments/30baa972e8c525d003a975cf724e8489/cdee1f9e/nlmoijtszuygwloa8vmg.png"}],"location":"Firenze, IT","category":[{"data":{"name":"General"}}],"is_new":0,"event_start_date":"2020-03-13","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"PyBeach 2020","cfp_url":"https://papercall.io/cfps/2645/submissions/new","cfp_due_date":"2019-12-16","icon":[{"url":"https://dl.airtable.com/.attachments/15cfd11119217caa74308141923b153d/0d67e169/pybeach_144.png"}],"location":"Los Angeles, California","category":[{"data":{"name":"Python"}}],"is_new":0,"event_start_date":"2020-02-29","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"DevOpsCon Berlin","cfp_url":"https://callforpapers.sandsmedia.com","cfp_due_date":"2019-12-16","icon":[{"url":"https://dl.airtable.com/.attachments/9c805fb3ba48083de398a9dc8bc0ddef/eefb6f4c/DOC20_Website_Favicon.png"}],"location":"Berlin, Germany","category":[{"data":{"name":"DevOps"}}],"is_new":0,"event_start_date":"2020-06-15","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"T3chFest","cfp_url":"https://t3chfest.es/2020/call-for-talks","cfp_due_date":"2019-12-15","icon":[{"url":"https://dl.airtable.com/.attachments/26ddbdffb51ef736c0990aee1870fdd8/248a62f4/t3chfest.es"}],"location":"Madrid, Spain","category":[{"data":{"name":"General"}}],"is_new":1,"event_start_date":"2020-03-12","perks_checked":true,"travel_covered":true,"hotel_covered":true,"stipend_covered":null}}},{"node":{"data":{"name":"Hacker Camp","cfp_url":"https://hackercamp2019.typeform.com/to/BICv5S","cfp_due_date":"2019-12-15","icon":[{"url":"https://dl.airtable.com/.attachments/060b8a55035273560c6abe4826ca813b/d57118dc/hackercamp.in"}],"location":"Noida, India","category":[{"data":{"name":".NET"}}],"is_new":0,"event_start_date":"2019-12-14","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"Byteconf GraphQL 2020","cfp_url":"https://papercall.io/cfps/2735/submissions/new","cfp_due_date":"2019-12-15","icon":[{"url":"https://dl.airtable.com/.attachments/f622baed6304ff7b9f9651c0744ad199/77cf4ffa/icon-512x512.png"}],"location":"Online","category":[{"data":{"name":"Data"}}],"is_new":0,"event_start_date":"2020-01-31","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"Women in Data Science (WiDS) Miami","cfp_url":"https://papercall.io/cfps/2720/submissions/new","cfp_due_date":"2019-12-15","icon":[{"url":"https://dl.airtable.com/.attachments/bfd57744a0bdba41c49f705e813c79a1/c238097d/fiu.edu"}],"location":"Miami, FL","category":[{"data":{"name":"Data"}}],"is_new":0,"event_start_date":"2020-03-06","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"Kafka Summit London 2020","cfp_url":"https://kafka-summit.org/kafka-summit-london-2020/speakers/","cfp_due_date":"2019-12-15","icon":[{"url":"https://dl.airtable.com/.attachments/a7ed32d252911af2746c9c91d2b39259/f00adfd8/apple-touch-icon.png"}],"location":"London, UK","category":[{"data":{"name":"Data"}}],"is_new":0,"event_start_date":"2019-10-30","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"OWASP New Zealand Day - 2020","cfp_url":"https://papercall.io/cfps/2480/submissions/new","cfp_due_date":"2019-12-15","icon":[{"url":"https://dl.airtable.com/.attachments/f3f357861757440513e3da1462c9e823/ac122bc9/NZDay_2020_web_banner.jpg"}],"location":"Auckland, New Zealand","category":[{"data":{"name":"Security"}}],"is_new":0,"event_start_date":"2020-02-21","perks_checked":true,"travel_covered":true,"hotel_covered":true,"stipend_covered":null}}},{"node":{"data":{"name":"HalfStack Tel Aviv","cfp_url":"https://docs.google.com/forms/d/e/1FAIpQLSe3_boCyHHf4vm8OF49gTD39ZOLH44yg5e3Q_SfIaxDQW0Flw/viewform","cfp_due_date":"2019-12-15","icon":[{"url":"https://dl.airtable.com/.attachments/d55d51a1c2b63629d0a44866f7378c0e/2900e435/favicon.png"}],"location":"Tel Aviv, Israel","category":[{"data":{"name":"Javascript"}}],"is_new":0,"event_start_date":"2020-05-11","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"Frontstack - Media on the Web","cfp_url":"https://papercall.io/cfps/2785/submissions/new","cfp_due_date":"2019-12-13","icon":[{"url":"https://dl.airtable.com/.attachments/62401459c4e27939142679094de8f9ae/c1ea7b50/twitter.com"}],"location":"Lagos","category":[{"data":{"name":"Javascript"}}],"is_new":0,"event_start_date":"2020-01-25","perks_checked":true,"travel_covered":true,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"The Deep Learning Summit","cfp_url":"https://teamrework.wufoo.com/forms/deep-learning-san-francisco-suggest-a-speaker","cfp_due_date":"2019-12-13","icon":[{"url":"https://dl.airtable.com/.attachments/176128d06452ef893ba3dd080298cfc7/7c8bf96d/favIcon.png"}],"location":"San Francisco, U.S.A.","category":[{"data":{"name":"Data"}}],"is_new":0,"event_start_date":"2020-01-30","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"Devopsdays NYC 2020","cfp_url":"https://papercall.io/cfps/2733/submissions/new","cfp_due_date":"2019-12-12","icon":[{"url":"https://dl.airtable.com/.attachments/eaa578d35d91f104234d9938079b65e1/6f4d06bd/android-icon-192x192.png"}],"location":"NYC","category":[{"data":{"name":"DevOps"}}],"is_new":0,"event_start_date":"2020-03-03","perks_checked":true,"travel_covered":true,"hotel_covered":null,"stipend_covered":null}}},{"node":{"data":{"name":"ServerlessDays Cardiff 2020","cfp_url":"https://papercall.io/cfps/2693/submissions/new","cfp_due_date":"2019-12-11","icon":[{"url":"https://dl.airtable.com/.attachments/e375131061ff892e72d8c0224de92247/1be02127/ServerlessDaysCardiff-card_ljc93r.jpg"}],"location":"Cardiff, UK","category":[{"data":{"name":"DevOps"}}],"is_new":0,"event_start_date":"2020-02-13","perks_checked":true,"travel_covered":true,"hotel_covered":true,"stipend_covered":null}}},{"node":{"data":{"name":"RubyConf India 2020","cfp_url":"https://papercall.io/cfps/2575/submissions/new","cfp_due_date":"2019-12-10","icon":[{"url":"https://dl.airtable.com/.attachments/facd52ae19396a71a2c90b1f00fef3ff/b58aeffe/rubyconfindia.org"}],"location":"Goa, India","category":[{"data":{"name":"Ruby"}}],"is_new":0,"event_start_date":"2020-04-25","perks_checked":true,"travel_covered":null,"hotel_covered":null,"stipend_covered":null}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}