{"pageContext":{"isCreatedByStatefulCreatePages":false,"group":[{"post":{"html":"<h1>10 Presentation Tools for Technology Conference Speakers</h1>\n<p>You did it! Your proposal was accepted and you’re officially in the conference program. Now what?</p>\n<p>If you’re like me, you’ve been to hundreds of presentations (maybe even more) and you know exactly what makes a presentation memorable: it’s either REALLY good or REALLY bad. Content aside, it’s the presentation of your material that makes the most impact to a room full of eager, yet, potentially overwhelmed, conference-goers.</p>\n<p>I believe that everyone has the ability to develop an aesthetic and engaging presentation that will be remembered, so I’ve put together some of my favorite tools to help you do just that. But, if you’re not quite ready to begin your slide deck yet, first check out my <a href=\"https://www.cfpland.com/guides/speaking/presentation/\">Guide to Preparing a Conference Presentation</a>.</p>\n<h2>The Basics</h2>\n<p>Let’s start out by talking about some of the most widely-used presentation tools for all purposes and industries. Whichever one you choose, it’s important not to overload your physical presentation with text. If a viewer sees a slide packed with text, their instinct to read it all will kick in, and they will quickly tune the most important thing – you - out.</p>\n<p>Slides and visuals should be used to present key takeaways and help your listener paint the picture you’re trying to create, not manipulate all of their attention. There is nothing more boring than a conference session that features text-packed slides on plain white backgrounds.</p>\n<h3>Microsoft PowerPoint</h3>\n<p>An oldie-but-goodie, <a href=\"https://products.office.com/en-us/powerpoint\">PowerPoint</a>, remains the most widely used presentation tool across the board. You’re probably familiar with it from your school days, and maybe you’ve spent a lot of time playing around with all of the fun effects that you can add in to make your presentation look a lot cooler than it actually was, while procrastinating on developing the actual content for your history presentation (I know I’m guilty as charged). Nonetheless, PowerPoint is a great go-to for conference presentations. It’s easy to customize and allows you to add photos, videos, charts, and more right onto your slides, bringing your project or data to life.</p>\n<h3>Google Slides</h3>\n<p>If you’re unfamiliar with Google’s suite of productivity tools, I highly recommend that you visit Google Drive and play around with creating documents, spreadsheets, and slideshows. The way these tools work is very similar to that of your standard Microsoft Office Suite, but they make collaborating, sharing, and getting feedback a whole lot easier.</p>\n<p>Operating through your browser instead of existing locally on your computer, multiple people can be working on a <a href=\"https://www.google.com/slides/about/\">Google Slides</a> presentation simultaneously, making it the perfect tool for joint presentations. If you want to get feedback from a coworker or mentor, they can easily make suggestions and add comments to your work without actually altering it. Once you’re done, you can download the presentation to your desktop in many formats, including PowerPoint and PDF, or you can present directly from your browser, making Google Slides a versatile option.</p>\n<h3>Prezi</h3>\n<p><a href=\"https://prezi.com/\">Prezi</a> isn’t your typical slideshow creating platform, but it is just as easy to use as PowerPoint or Google Slides and has been widely adapted over the last several years. Prezi is a great tool to use for highly visual presentations, allowing the user to depict one slide’s relation to the others, while keeping an eye on larger picture. It’s made for non-designers (just like us) and the templates are super easy to adapt for any audience.</p>\n<p><img src=\"/img/posts/presentations-2.png\" alt=\"Prezi screenshot\"></p>\n<p>For example, start out with a timeline or overview, and use Prezi to literally zoom in on each specific component of your project. In the sample above, the creator would move into details of the new collection, photos or videos of it, their target demographic, and the inspiration behind it, before returning to this main overview to visually depict how the specifics of the new collection were directly considered in planning for launch events and predicting trends. Prezi’s website has a lot of great video tutorials that I’d highly recommend if you’re unfamiliar with the platform.</p>\n<h2>For Your Code</h2>\n<p>As developers, a lot of what we will be teaching and sharing with others is code-based. As such, a number of great technologies have been created by people like us to help people like us showcase our new coding developments to others.</p>\n<h3>GitPitch</h3>\n<p>As a developer, I’ve always joked that my native language is code. <a href=\"https://gitpitch.com/\">GitPitch</a> must have heard me, because they’ve created a slide deck building platform that operates entirely in my native language… and they have the tagline to prove it.</p>\n<p>With their desktop tool, you can use Markdown &#x26; Git to create your slide content or take it a step farther with their Markdown Widgets that will help you add special and unique features to your slides. You can even demonstrate the way your code works step by step right inside of your presentation. By natively operating in a language that you’ve become fluent in, GitPitch allows you to build your presentations without the fuss of learning PowerPoint, Google Slides, or Prezi. Your slide decks can be exported into traditional means or presented right through their platform, adding to its utility and versatility.</p>\n<h3>Spectacle Code Slide</h3>\n<p>Similar to GitPitch, Spectacle also allows you to create slides entirely out of code and demo your code right inside of your presentation. That’s about where the similarities end, however, as Spectacle can run right inside your existing terminal, while GitPitch is a software you would need to download to use. Spectacle is a React.js library that allows you to use JSX or MDX syntax and gives you all of the tools you need to create a sleek presentation for free. It’s open-source information and their <a href=\"https://formidable.com/open-source/spectacle/\">website</a>, as well as several GitHub users, like <a href=\"https://github.com/jamiebuilds/spectacle-code-slide\">JamieBuilds</a>, can help you get started in Spectacle quickly and easily.</p>\n<h3>Glorious</h3>\n<p>If you want to use a more traditional slide deck platform, like one outlined in The Basics section above, but you would still like to demonstrate your code, <a href=\"https://glorious.codes/demo\">Glorious</a> will be your new best friend. It’s the easiest way to create an animation of your code in action, giving your audience the evidence they need to prove that your genius idea actually works.</p>\n<p>Let’s face it: You can show a block of code and swear it works all day, but without seeing it in action, no one is going to believe you.</p>\n<h3>MarkDeck</h3>\n<p>If you don’t have code demonstrations that you need to present but you still want to create your slide deck in your native coding language, try <a href=\"https://arnehilmann.github.io/markdeck/\">MarkDeck</a>. MarkDeck will take your files in Markdown format and turn them into an html5 slide deck, while showing the two side by side so that you can easily make adjustments and alter your slide design as needed. Slides follow a simple, standard format, making MarkDeck easy and frill-free for the no-nonsense presenter. It’s possible to create your own layout if needed, but it’s more difficult than in GitPitch or Spectacle. If you’ve never coded a slide deck before, MarkDeck in an excellent place to start and get your bearings before moving to something more customizable.</p>\n<p><img src=\"/img/posts/presentations-1.png\" alt=\"MarkDeck screenshot\"></p>\n<h3>Bespoke</h3>\n<p>If your presentation’s content would be enhanced by using a variety of plugins like animated bullet points or backdrops, hash routing, or touch interaction, Bespoke is just what you need. Its minimal design and modular presentation library foster the ability to highly customize your work, offering over 75 different plugins. You can find a Bespoke.js generator <a href=\"https://github.com/bespokejs/bespoke#javascript\">here</a>, and can customize it to meet your needs.</p>\n<h2>To Add a Little Something Extra</h2>\n<p>So, you’ve finished your slide deck and your content is amazing, but it’s lacking some pizazz and you need to spice it up. Have no fear, the next two tools are here to rescue your presentation from drowning in the deep end.</p>\n<h3>Canva</h3>\n<p>I like to think of Canva as the graphic design mecca for non-graphic designers. Tools and templates within <a href=\"http://www.canva.com/\">Canva</a> allow you to create beautiful, professional-quality graphics, banners, and images without the complexity of Photoshop or InDesign. It’s a great tool to use to do something as basic as adding text over an image or as complex as using stickers to create an animated graphic that will help illustrate your point.</p>\n<p><img src=\"/img/posts/presentations-3.png\" alt=\"Canva screenshot\"></p>\n<h3>Unsplash, Pexels, Kaboompics, &#x26; more</h3>\n<p>While we may have grown up with corny, painfully obvious stock photos gracing our teachers’ presentations and textbooks, it’s 2020 and our own presentations don’t need to follow suit. There are tons of websites out there that allow you download photos taken by real photographers for free under a Creative Commons license. Some of my favorites are <a href=\"http://www.unsplash.com/\">Unsplash</a>, <a href=\"http://www.pexels.com/\">Pexels</a>, and <a href=\"https://kaboompics.com/\">Kaboompics</a> because the majority of photos on those sites don’t look very ‘stock photo-esq.’ Remember, just because you can find an image through a Google search, it doesn’t mean that you can use it freely without consequence. Take the guesswork out of it and avoid a potential problem by using one of these sites to gather your images.</p>\n<p>As you can see, there many tools out there to help you create beautiful slide decks that will keep your audience engaged and wanting more. While some of the tools outlined here are better for certain scenarios and presentation types than others, I recommend that you familiarize yourself with each of them and give them a try, as much of your decision on which tool to use will come from nothing other than your personal preference. Let me know which ones you like, which ones you don’t, and if you have other favorites over on my twitter <a href=\"https://www.twitter.com/cfp_land/\">@cfp_land</a>!</p>","frontmatter":{"layout":"post","title":"10 Presentation Tools for Technology Conference Speakers","path":"/blog/presentation-tools/","category":"Tips","tags":["New Speakers","Experienced Speakers","Tools"],"date":null,"image":"/img/posts/presentations-2.png"}}},{"post":{"html":"<p><a href=\"https://gotochgo.com/2020/\">GOTO Chicago</a> will be more accessible than ever now that it’s <a href=\"https://blog.gotocon.com/2020/03/16/better-than-the-real-thing:-goto-chicago-goes-virtual/\">all online</a>, so I’m excited to\nbring you a speaker story from one of the many great speakers scheduled for the event. Kirk Pepperdine sold the company he founded\nto Microsoft, and now helps build the Java experience for Azure.</p>\n<p>Kirk has spoken at countless conferences (as evidenced by his trove of event badges), and is currently talking about performance\ntuning for Java. In his interview below, he talks about his current work, how he has built up a workshop over years, and what he’s learned about what people expect out of conference speakers. Read on for more of Kirk’s story.</p>\n<!--more-->\n<h3>Tell me about yourself. What’s your job and how did you get into speaking?</h3>\n<img src=\"https://drive.google.com/uc?id=1PzxbxD-GRJu4Z3fp-tV5whC-y6POyS9D\" class=\"right\">\n<p>I’m a principle engineer at Microsoft. This all came about as a result of Microsoft acquiring jClarity, a small performance tooling company that I co-founded. Microsoft was looking to build a team of Java experts to help them create the best experience possible for Java in Azure. Plus, Microsoft owns a surprising number of Java assets so adding more Java expertise makes sense. I’m very humbled to be part of a groundbreaking team inside Microsoft. Right now we’re tuning a number of internal applications as well as continuing to build out performance diagnostic tooling that we were developing at jClarity.</p>\n<p>As for side projects, I’m picking at a few ideas in the performance tooling and diagnostic space at the moment. Difficult to say what will see the light of day at the moment but I expect at least one of them will be released sometime this year.</p>\n<p>And there is always <a href=\"https://www.jcrete.org/\">jCrete</a>, an unconference that I cofounded with <a href=\"https://twitter.com/heinzkabutz\">Dr. Heinz Kabutz</a>. I don’t know how, but we’ve managed to create an environment that has attracted a significant number of the most notable names in the Java space. It’s been very satisfying to watch people come to jCrete, be inspired by the incredible amount of talent and then take that energy and create things with it.</p>\n<p><a href=\"https://github.com/AdoptOpenJDK/jitwatch\">JITWatch</a> is an amazing tool that was inspired by Chris Newland’s understanding of some of the compiler people that he was speaking to. Even more satisfying was watching some of the kids who were tagging along with mum or dad to the conference gain interest in what was going on to the point where they’d start participating. At least one of the kids took the ideas from jCrete back to her high school and setup an unconference there for a completely un-IT subject.</p>\n<p>That brings me back to the point, when we invite a person to attend jCrete, we don’t only invite the person, we have invited his or her’s family or partner whom are perfectly accepted to attend sessions. In a few cases we’ve had spouses and partners propose and lead sessions on topics related to their profession that has relevance to our everyday lives. Having spouses, partners, kids all about creates an amazing atmosphere which is surprisingly beneficial for learning and sharing experiences.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I like sharing knowledge. To have the chance to share something that may help make a developers life easier or help them better understand how something works is very fulfilling. It’s also a great time to connect with people, attendees and other speakers to talk tech, toss around ideas, and see the progress others have made on their pet projects.</p>\n<h3>What makes Java performance tuning such an interesting topic for you?</h3>\n<p>To be honest, early on in my career I was not interested performance tuning. I just became the “goto” guy because I was perceived as having some knack of seeing the source of performance problems and so people kept coming to me when they had issues and I just kept solving them.</p>\n<p>This is how I came to work with Jack Shirazi. We were working together on a project in a bank and after a disastrous false start, management came to Jack and myself and assigned us the glorious task of tuning it. Jack took the experience and our notes to write Java Performance Tuning which was a perennial best seller for O’Reilly for the longest time. Jack then started <a href=\"http://www.javaperformancetuning.com/\">the companion site (www.javaperformancetuning.com)</a> where I helped him launch. Afterwards we worked together to get the first version of a performance tuning workshop together and before we were ready, people started asking for it. After launch I continued on with the workshop and it’s been a living work in progress ever since.</p>\n<p>A big part of maintaining and evolving the workshop has been, how can I better describe this point so that I can get a better success rate when people try it out on life like problems.</p>\n<p>From this and my consulting practice I eventually formed the seals of a performance diagnostic process. This immediately had an effect on attendees. I had a tuning exercise that took a couple of hours each day over the 4 days to work through. After I introduced the methodology I started seeing attendees complete the entire exercise in 2 to 3 hours.</p>\n<p>It was an amazing productivity boost. Even better were the emails I’d get after the workshop ended. People were telling me that they were able to solve long standing nagging problems in minutes. It’s funny but when people try to customize the workshop for their own companies “special” needs they almost always want do drop the methodology section. I never let them do that. It is my opinion that the methodology is the <em>most</em> important topic of the workshop and the final exercises are there just to deepen the understanding of that process.</p>\n<p>I’m not going to claim that my methodology is a silver bullet and there isn’t any other way to tune. Certainly there are others in the industry such as Branden Gregg that has a well thought out methodology. And of course there are others such as Heinz Kabutz, Peter Lawrey, Martin Thompson, Charlie Hunt, Monica Beckwith, Todd Montgomery, Cliff Click, Gil Tene and of course Jack Shirazi and others that I’ve taken inspiration from that have a lot to say on the subject.</p>\n<h3>Do you remember your first conference talk?</h3>\n<p>My first conference talk was at one of the first Devoxx. Jack and I had a two hour session. I remember the room was pretty big and pretty full. <strong>I remember being very nervous about the entire thing and I was very happy when it was over.</strong> I remember the immediate feedback was friendly but I’d have to say that the materials have matured considerably since then.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve no idea as I’ve completely lost track. I did keep all of the conference badges. Here’s a picture of some of them:</p>\n<p><img src=\"https://drive.google.com/uc?id=1slhdy-kQPgrV7SKJ3P8NdxjTc32eis5V\" alt=\"Conference Badges\"></p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>Good question, I guess I do. After getting wired up…If there is someone in the audience that I know I’ll sit with them and just talk about nothing in particular. Otherwise I generally just try to clear my mind and relax.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>We generally always have a a session at <a href=\"https://www.jcrete.org/\">jCrete</a> about becoming a better speaker.</p>\n<p>From the years of attending these the common conclusion is <strong>people like stories, they like to be entertained and most importantly they are there to learn something that is relevant to their day to day existence as a developer.</strong> If you can combine all of these elements into a talk then you’re generally going to be well received and the talk will be memorable.</p>\n<p>For effects, I use diagrams in favor of words, single words instead of walls of text, blank slides when the audience should be focusing on your voice and not be distracted reading a wall of text. When you believe your slide deck is finished, that is the time to start thinking about presentation and how the material fits onto the slides and what can be done to improve the visual aspects of the talk. In my experience, Audiences tend to respond well to desks that say, I cared enough to take the extra time to make this visual appealing.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>There is a long list of speakers that I look up to for many different reasons. <a href=\"https://twitter.com/heinzkabutz\">Dr. Heinz Kabutz</a> for his mastery of his subject matter, <a href=\"https://twitter.com/venkat_s\">Dr. Venkat Subramaniam</a> for his ability to take an audience on amazing journeys, Adam Bien one of the original live coders, Josh Long, amazing energy and his ability to project it onto the audience, Ted Neward, Cameron Prudy, and the list goes on and on.</p>\n<p>Learn more about <a href=\"https://gotochgo.com/2020/speakers/1323/kirk-pepperdine\">Kirk Pepperdine and his upcoming talk at GOTO Chicago here</a>.</p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Kirk Pepperdine, Founder and Principal Engineer","path":"/blog/speaker-kirk-pepperdine/","category":"Speaker's Story","tags":null,"date":"2020/03/18","image":"https://drive.google.com/uc?id=1PzxbxD-GRJu4Z3fp-tV5whC-y6POyS9D"}}},{"post":{"html":"<p>With the global Covid 19 pandemic forcing the <a href=\"https://www.usatoday.com/story/news/nation/2020/03/05/coronavirus-update-list-canceled-events/4950641002/\">cancellation of thousands of conferences, meetups, and tradeshows across the world</a>,\nyou have probably already changed your plans because of the virus. I wanted to offer a little update on how I’m handling things\nwith CFP Land, and what the current recommendations are for people like us who speak at conferences.</p>\n<!--more-->\n<h2>The CFP Land Newsletter Will Continue Weekly Publication</h2>\n<p>First, I am fortunate to have a job that can be done remotely, so my day-to-day schedule won’t change too much. I’ll continue\npreparing and publishing the CFP Land newsletter every week unless I (or someone in my family) gets seriously sick.</p>\n<p>Second, I will update any conferences I hear of that cancel their events, but I could use your help with this. I’m not on every\nevent’s mailing list, so if you see a conference on CFP Land that you know is no longer going to happen, please let me know\nusing the “Report an Issue” link on the CFP:</p>\n<p><img src=\"/img/posts/report.gif\" alt=\"Report issues on CFP Land\"></p>\n<p>As always, I’m also available by email at <code class=\"language-text\">info@cfpland.com</code>.</p>\n<h2>Consider Preemptively Canceling Any In-Person Events You’re Planning on Attending</h2>\n<p>Seriously, <a href=\"https://trackcorona.herokuapp.com/map\">this thing is global</a>, and probably going to get worse before it gets better.\n<a href=\"https://nationalpost.com/news/world/covid-19-what-is-social-distancing-and-how-to-do-it-properly\">Social distancing is the best way to slow its spread</a>, so I can’t imagine many tech conferences are important enough to go to at the risk of thousands of peoples’ lives.</p>\n<p><img src=\"/img/posts/covid-map.png\" alt=\"Global Covid 19 Map\"></p>\n<p>Alternatively, you could offer to give any scheduled talks virtually, or as <a href=\"https://twitter.com/philnash/status/1238235174829060096\">Phil Nash</a> is doing, you could switch to live-streaming\nsome coding sessions instead.</p>\n<h2>This Won’t Last Forever</h2>\n<p>It’s easy to get caught up in the rush of fear, but I’m an optimist, so I don’t believe this is the end of society as we know it.\nIn a few weeks or months, we’ll all start returning to normal life, and those of us who attend and speak at conferences will likely\nbe back at it. Many conferences scheduled for the Fall are opening their CFPs now, so you might want to continue applying, even if this summer’s events end up changed.</p>\n<p>We also might see a rise in virtual events, which will be pretty cool. While I believe there’s no substitute for actual human contact, virtual events are cheaper, more carbon-friendly, and more accessible to people in developing countries. They provide\na lot of benefits, and those of us lucky enough to be in major tech hubs would do well to remember that.</p>\n<p>Stay healthy, and thanks for reading!</p>","frontmatter":{"layout":"post","title":"A CFP Land Covid 19 Update","path":"/blog/covid-19/","category":"Updates","tags":["Covid 19","Service Interruptions"],"date":"2020/03/14","image":"/img/posts/covid-map.png"}}},{"post":{"html":"<p>I recently mentioned on a podcast <a href=\"https://soundcloud.com/technicallytrue/career-advancement-through-public-speaking-karl-hughes\">that Twilio was my favorite Developer Relations team</a>, so when Phil Nash of Twilio <a href=\"https://philna.sh/blog/2020/01/29/how-to-find-cfps-for-developer-conferences/\">mentioned CFP Land</a> in a blog post he wrote, I knew I wanted to get his story up here.</p>\n<p>As many conference speakers do, Phil has a passion for teaching people and sharing his knowledge. You see that in his talks as well as his contributions to open source and helpful blog posts. Read on for his perspective on speaking, technology, and the benefits that getting on stage has given his career.</p>\n<!--more-->\n<h3>Tell me about yourself. What’s your job and how did you get into speaking?</h3>\n<img src=\"https://drive.google.com/uc?id=1G9YoZUE9RJzUMGKuzwOhqW82nek6qNsj\" class=\"right\">\n<p>My name is Phil Nash and I am a Developer Evangelist for <a href=\"https://www.twilio.com\">Twilio</a>. I like working with Ruby, JavaScript and anything on the web platform. As an evangelist I spend my days working on example applications, building tools to help developers, and on writing blog posts, documentation and talks.</p>\n<p>Before evangelism I worked as a developer in London in an agency and product studio called <a href=\"https://mintdigital.com/\">Mint Digital</a>, which gave me the chance to work across a number of different styles of project. That was also where I was encouraged to get into public speaking, the company had a great policy that let us attend 2 conferences a year and would support us for more if we got accepted to speak. I seized that opportunity and it led to a few speaking engagements in European conferences, and eventually to this role in evangelism.</p>\n<p>On the side I like <a href=\"https://philna.sh/blog/\">blogging on my own site</a> and maintaining <a href=\"https://github.com/philnash?tab=repositories\">a bunch of open source applications, rubygems and node modules</a>. I’m also a Google Developer Expert, a <a href=\"https://untappd.com/user/philnash\">lover of beer</a> and now living in Melbourne, Australia.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>Speaking at conferences has absolutely had a direct benefit to my career, it is part of my career now, but that doesn’t stop it being fun too. Something I realised as I started my evangelism career was that <strong>I enjoy speaking because I enjoy teaching people, showing them new things or new ways to achieve something</strong>. Breaking down topics, giving them my spin and hopefully making it entertaining along the way has become a passion.</p>\n<p>That’s what I love about the speaking side of things, but attending conferences in general has led to meeting so many kind, intelligent, community minded people that the best part of speaking is being able to do this more. Anyone can go to a conference and meet people, but if you speak it becomes a lot easier. Most people get a lot out of conferences because they get to listen to and learn from the experiences of those on stage. The real benefits lie in making connections with and learning from the experiences of as many people in the audience too.</p>\n<h3>What topics do you typically speak about?</h3>\n<p>I love talking about advancing the web platform. When I got into development professionally the number of features we had available to us to build experiences on the web were very few. The power of things like WebRTC, service workers, speech recognition and push notifications expand the amazing things we can build on the web. I like to experiment with these features and hopefully inspire others to use them in new and interesting ways.</p>\n<p>I also like picking up things that aren’t well understood and going in a bit deeper on them. I did this for two factor authentication, initially wanting to find out exactly how a website and a mobile app could agree on a 6 digit code, and building that into an experience.</p>\n<p>Finally, <strong>I just like talking about things I’ve worked on. They tend to be things I’m passionate about and while the audience may learn about that particular project</strong>, I hope they also take away things they can use in their own projects too.</p>\n<h3>Do you remember your first conference talk?</h3>\n<p>It seems that my first conference talk is now confined to <a href=\"https://web.archive.org/web/20160809165416/http://devslovebacon.com/conferences/bacon-2012/talks/html5-takes-over-the-world\">the Wayback Machine</a>. It was a talk called “HTML5 takes over the world” and was about all the fancy new features of the web back in 2012, including an experimental build of the Opera browser that had the first implementation of <code class=\"language-text\">getUserMedia</code> for getting access to a user’s camera and microphone.</p>\n<p>I remember being very nervous and drinking 3 cups of coffee before getting on stage. <strong>I had a half hour slot for the talk and I stormed through the talk, I think I finished in around 17 minutes and out of breath.</strong> I remember being happy with what I said, but a bit taken aback by the performance itself. At least we had plenty of time for questions.</p>\n<p>To this day I won’t have more than one cup of coffee before getting on stage in case I set myself speaking at double speed again.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>After a quick count through my <a href=\"https://philna.sh/speaking/history\">speaking history</a>, it looks as though I’ve spoken at between 70 and 80 conferences since 2012. I’ve applied to so many more though, it’s not even funny. <strong>I must have sent in hundreds of proposals and been rejected hundreds of times too.</strong></p>\n<p>I’ve learned not to take that to heart as each conference organiser or CFP committee member has a different view on the talks they want to see at their event. <strong>A talk may be wrong for once conference and right for another</strong>, which is why it is worth finding the open CFPs and finding the right conference for your talk.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I think my pre-talk routine mostly consists of pacing around and going through the talk in my head. And not drinking too much coffee.</p>\n<p>I still get nervous before crowds, particularly if it’s the first outing of a talk. I don’t think that will ever go away fully, so I embrace it. I don’t have rituals or anything that makes it better so I just try to use the nervous energy to my advantage.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>Every person that gets on a stage to give a talk to an audience is up there telling their story and if you want to give a talk on something you need to find your angle on it. When you include your experiences it makes your talk unique. <strong>I could happily watch presentations on the same piece of code by 10 different people because I bet I would learn something new from each of them.</strong> You are the world’s foremost expert on your own experiences, and I believe that needs to come across in your presentation. That way you can’t be an imposter because no-one else has had your experience.</p>\n<p>When it comes to finding conferences to apply to, I recently wrote up a <a href=\"https://philna.sh/blog/2020/01/29/how-to-find-cfps-for-developer-conferences/\">list of different sites and mailing lists you can use to keep up to date with open CFPs</a> (including <a href=\"https://www.cfpland.com/\">CFP Land</a> of course).</p>\n<p><strong>The most important thing for giving talks is to practice, out loud.</strong> You don’t need to have an audience to practice to, but running through the slides and saying the words you want to say out loud will stick them in your head much better for when you come to say them in front of other people. Nothing can substitute rehearsal for ensuring you are prepared when it comes time to speak.</p>\n<p>If you are speaking at a conference, I’d recommend giving your talk to a local meet-up first too. That way you can get a good gauge on what the audience thinks of it, anything useful you might have missed and what the questions might be. It also forces you to practice at least once before you get to the conference.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>Oh so many people. I’ve been fortunate to have been at so many conferences and seen so many speakers that I have inspiration all around. I already know I’m forgetting so many people as I write this following list, but here’s some fantastic people off the top of my head:</p>\n<ul>\n<li>All my fellow (and former) developer evangelist colleagues at Twilio, they both inspire me and also challenge me to improve all the time</li>\n<li><a href=\"https://twitter.com/devdevcharlie\">Charlie Gerard</a> for her amazing side projects leading to AI and web powered live demos</li>\n<li><a href=\"https://twitter.com/LeaVerou\">Lea Verou</a> for her ability to break down the most complicated parts of CSS and make anyone understand</li>\n<li><a href=\"https://twitter.com/tenderlove\">Aaron Patterson</a> for taking the deepest of dives into how Ruby works but doing so in a flurry of puns</li>\n<li><a href=\"https://twitter.com/erinjzimmer\">Erin Zimmer</a> for digging into browsers, Angular and web components and making them accessible to all</li>\n</ul>\n<p>And many, many more.</p>\n<h3>Where can readers</h3>\n<p>You can find me almost anywhere on the internet as <em>philnash</em>, from <a href=\"https://twitter.com/philnash\">Twitter</a>, <a href=\"https://github.com/philnash\">GitHub</a> and <a href=\"https://www.linkedin.com/in/philnash/\">LinkedIn</a> to my own site, <a href=\"https://philna.sh\">philna.sh</a>.</p>\n<p>I’m also streaming <a href=\"https://twitch.tv/phil_nash/\">live coding on Twitch frequently</a>, so come say “Hi! 👋” sometime!</p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Phil Nash, Developer Evangelist and Open Source Maintainer","path":"/blog/speaker-phil-nash/","category":"Speaker's Story","tags":null,"date":"2020/03/11","image":"https://drive.google.com/uc?id=1G9YoZUE9RJzUMGKuzwOhqW82nek6qNsj"}}},{"post":{"html":"<p>With <a href=\"https://gotochgo.com/2020/\">GOTO Chicago</a> coming up in a few weeks, I wanted to highlight some of the many great speakers who\nwill be on stage this year. I’m very excited to bring you Dean Wampler’s speaker story today.</p>\n<p>Dean works in Developer Relations at Anyscale, and he’s been speaking at conferences for over 15 years. Hopefully some of his experience\nand advice can help you on your speaker’s journey, and don’t forget to check out his talk at <a href=\"https://gotochgo.com/2020/speakers/1247/dean-wampler\">GOTO Chicago in April</a>.</p>\n<!--more-->\n<h3>Tell me about yourself. What’s your job and how did you get into speaking?</h3>\n<img src=\"https://drive.google.com/uc?id=1yyA2nhTlljFPRekzmVd_zjywJuhKRUYo\" class=\"right\">\n<p>I run developer relations at a startup spun out of U.C. Berkeley, called <a href=\"https://anyscale.io/\">Anyscale</a>. We’re developing the open-source <a href=\"https://ray.io/\">Ray</a> system for distribution of Python tasks from single machines to clusters, specifically to optimize compute scenarios in reinforcement learning, hyper parameter tuning, model serving, and other compute-intensive Python applications.</p>\n<p>I started speaking at conferences over a decade ago when I first did consulting. I’ve worked in a range of roles, from engineer to VP-level management, to evangelism, and in different industries, from embedded systems and medical electronics to Internet and Big Data startups.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I enjoy public speaking, defining and delivering the arc of a story about a particular software development. I also show off my personal photography in my slides. ;)</p>\n<p><strong>It has been a huge boost to my career, both for establishing name recognition and expertise in the areas I’ve worked, as well the useful things you learn meeting a diverse range of people facing a broad list of challenges.</strong> It has been an important part of my job for most of the last 15 years or so.</p>\n<h3>What makes scaling distributed systems (and Ray in particular) such an interesting topic for you?</h3>\n<p>What attracted me to Ray is the thought that went into its design to provide a very accessible API for developers, which is easy to use, yet frees the developer from having to understand a lot of details about distributed systems. Behind that API is a very performant implementation that scales extremely well for a variety of workloads. I’m also very interested in ML approaches like reinforcement learning, so I’m learning a lot about them, as well.</p>\n<h3>Do you remember your first conference talk?</h3>\n<p>It was “Panel on the future of Aspect Oriented Programming” (with a few other speakers) at JBossTwo Conference, June 2003, San Francisco. I think it was recorded, but I believe it’s long since disappeared. I was nervous at the time, but really enjoyed the opportunity.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Easily over 30 or so.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/oCW5y4_8uGU' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Fast Data Architectures for Streaming Applications by Dean Wampler</em></p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I’ve done it so much that I don’t get nervous very often anymore. I mostly just make sure I’m well rested, well hydrated, and I’ve reviewed the slides beforehand so the sequence of them is familiar and I’m comfortable with the phrasing I want to use for each slide.</p>\n<h3>What advice do you have for new speakers?</h3>\n<ul>\n<li>Pick a topic you are really interested in, so you’re motivated to work hard to make your talk the best it can be.</li>\n<li>Recognize that we’re all learning to one degree or another; be honest about what you know and don’t know.</li>\n<li>People enjoy hearing war stories and your quest to learn the subject, etc.</li>\n<li>When writing proposals, the most important thing is to put yourself in the mind set of an audience member. What will attract them to your talk? What’s there for them to learn? I’ve <a href=\"https://medium.com/@deanwampler/tips-for-effective-conference-proposals-5997c9d40005\">written a whole blog post</a> about this subject.</li>\n<li>Finally, practice your talk and remove stuff so you have plenty of time and don’t overwhelm your audience with wordy, busy slides that you rush through!</li>\n</ul>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>Recently <a href=\"https://twitter.com/randyshoup\">Randy Shoup</a> has given clear, inspiring talks about “peopleware”, inspiring people from tech history, etc. When I hear a <a href=\"https://twitter.com/CatSwetel\">Cat Swetel</a> talk, I learn a lot of new ideas about project management and team processes. Those are two of many.</p>\n<p>Learn more about <a href=\"https://gotochgo.com/2020/speakers/1247/dean-wampler\">Dean Wampler and his upcoming talk at GOTO Chicago here</a>.</p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Dean Wampler, Head of Developer Relations at Anyscale","path":"/blog/speaker-dean-wampler/","category":"Speaker's Story","tags":null,"date":"2020/03/05","image":"https://drive.google.com/uc?id=1yyA2nhTlljFPRekzmVd_zjywJuhKRUYo"}}},{"post":{"html":"<p>Leading up to <a href=\"https://gotochgo.com/2020/\">GOTO Chicago</a>, I decided to reach out to some of the speakers who I\nwas most excited to see this year. I’m really glad Danielle Pollard - a fellow Chicagoan - got back to me to share\nher story.</p>\n<p>In addition to her professional work as an Agile Lead, Danielle has a passion for lifting up those in the community\nwho most need help. While she’s relatively new at speaking at conferences, Danielle has been winning speaking competitions\nsince grade school, so read on to hear some of her candid and helpful advice.</p>\n<!--more-->\n<h3>Tell me about yourself.</h3>\n<img alt=\"Danielle Pollard photo\" src=\"https://drive.google.com/uc?id=1fPEc4sWvfbW3_Gu2gkuu5nhfr9ki_4l0\" class=\"right\">\n<p>I’m currently an Agile Coach for Spot Hero in Chicago. SpotHero is a digital parking reservation service that connects drivers looking to reserve and pay for parking spaces with parking lots, parking garages and valet services.</p>\n<p>I believe that trust is hands down the #1 force multiplier for high performance, and I’ve used that belief to create results as a project management consultant and Lean/Agile transformation coach for best in class companies like UPS, Kohler, Blue Cross Blue Shield, Yellow-Roadway, RR Donnelley, Allstate, Apartments.com, US Foods.</p>\n<p>I’m also working closely with <a href=\"http://fchnwecare.com/\">FCHN</a>, a Soup Kitchen on the south side of Chicago focused on feeding, clothing and helping the needy. FCHN has been serving the community with hot meals 6 days a week for over 32 years. They are struggling to keep the lights on and I’m determined to turn things around for them.</p>\n<p>I’ve been able to impact the lives of hundreds of inner city youth and aspiring women entrepreneurs through nonprofits I work with, and in my non-existent “spare time” you can find me reading, eating some juicy carnivorous meal (scotch included) or being a personal barber for my two boys.</p>\n<h3>How did you get into public speaking?</h3>\n<p>In 4th grade my teacher was fed-up with my antics and inability to remain quiet and stay in my seat during class so she encouraged me to participate in the upcoming Speech Contest. I did. I won. And won and won and won until I became the 2nd Place winner in the Chicago-Wide Oratory competition.</p>\n<p>Never looked back.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I love speaking at conferences because I get a chance to meet some pretty awesome like-minded professionals, learn from them and share my ideas. Mostly for the love of helping and inspiring others and that has definitely enhanced my work as an Agile Coach without a doubt!</p>\n<h3>What makes Agile team leadership such an interesting topic to you?</h3>\n<p>It’s exciting for me because I love building resilient and learning teams that are able to handle anything that comes their way with top notch skill, professionalism and an unwavering focus on delivering value to both the business and the customer. Change is the only constant and I help teams and companies embrace and leverage it as a competitive advantage.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>It was for the Agile Professional Learning Network’s annual conference. It went a whole lot better than I thought. I didn’t know what to expect but I showed up and did my best and people seemed to like that.</p>\n<p>What I remember most is that my mom came and sat right in the front. She was supposed to record it for me but ended up getting so caught up in the presentation she completely forgot.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>My pre-talk routine includes prayer and for some reason I always get one more brilliant idea that I try to add in at the last minute…I don’t know what that’s about.</p>\n<p><strong>I also use lots of positive self-talk because I get extremely nervous.</strong> I remind myself to focus on the message and not me.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>The best advice I can give is just sharing four things that I always try to remember for myself:</p>\n<ol>\n<li>A seasoned speaker once told me, “the audience is actually rooting for you, because they’re thinking about if it were them and how unnerved they would be. They want you to do well.”</li>\n<li>If you didn’t belong here, you wouldn’t be here. So relax.</li>\n<li>Proper Preparation Prevents Piss Poor Performance…being prepared and practiced helps eliminate fear and build confidence.</li>\n<li>Be yourself. Authenticity goes a long way.</li>\n</ol>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>Locally, I love to hear <a href=\"https://twitter.com/zacharylbeer\">Zachary Beer</a> speak. He is smart, funny, and authentic as f*ck!</p>\n<p>Learn more about <a href=\"https://gotochgo.com/2020/speakers/1281/danielle-pollard\">Danielle’s talk at GOTO Chicago 2020 and how you can contact her here</a>.</p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Danielle Pollard, Agile Coach and Community Supporter","path":"/blog/speaker-danielle-pollard/","category":"Speaker's Story","tags":null,"date":"2020/03/02","image":"https://drive.google.com/uc?id=1fPEc4sWvfbW3_Gu2gkuu5nhfr9ki_4l0"}}},{"post":{"html":"<p><a href=\"https://gotochgo.com/2020/\">GOTO Chicago 2020</a> is coming up in just a few weeks, so I’m featuring some of the wonderful\nlineup of speakers that I’ll hopefully get to meet in person. Today, I’m happy to bring you Avdi Grimm,\na Ruby developer and professional paired programmer who will be giving a talk on programming and philosophy (I love these kind\nof talks).</p>\n<p>In this interview, Avdi shares some of his thoughts on how code is used as a model for life and the benefits he’s seen\nfrom 10 years of public speaking.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://drive.google.com/uc?id=1Yke3jpFDhT96A8qM5vGn1zAHS2bUBDSW\" class=\"right\">\n<p>I’m a developer who spends most of his time coaching and educating other developers these days. My primary source of income is <a href=\"https://www.rubytapas.com/\">RubyTapas.com</a>, a subscription screencast site I created for developers nine years ago. I specialize in making frequent, short, tightly-edited videos that introduce developers to one new and useful idea at a time.</p>\n<p>I got started speaking around 2010. <strong>I think my biggest reason was that back then I was under the misapprehension that I was an introvert, and speaking seemed like a handy socialization hack.</strong> The idea was, if I give a talk, people will introduce themselves to me!</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I love public speaking for its own sake, and I also very much enjoy traveling and meeting people. Speaking is interesting because on the one hand, it has been instrumental to my career. But on the other hand, it’s hard to trace the individual strands of causality. <strong>Many of my most delightful opportunities have stemmed from friends I made at a conference years earlier.</strong></p>\n<h3>What makes the intersection of philosophy and software such an interesting topic to you?</h3>\n<p>I honestly believe that <strong>programming is fundamentally the practice applied philosophy.</strong> We use code to model ways of thinking about the world we live in. And when our code is used by large numbers of people, it impacts how they see the world.</p>\n<p>That’s a lot of power, and a lot of responsibility. It’s also an opportunity: learning to think critically and intentionally about the philosophical nature of our work can reveal new ways to bring our values and our work into alignment.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I think my first-ever talk was at an open-source conference in Harrisburg, Pennsylvania. It was about tools for remote work, and it was not well-attended 😅</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I used to meditate a bit to calm myself down, with limited success. These days my favorite way to get ready is to be distracted by a conversation with an attendee until the moment comes to go on stage.</p>\n<h3>What advice do you have for new speakers?</h3>\n<ul>\n<li>Submit early, submit often.</li>\n<li>It’s OK to submit an abstract on a topic you want to understand better: getting accepted will give you a great excuse to learn about it!</li>\n<li>In both proposals and the talks themselves, lead with a problem, not with information. What is your ideal audience-member worried about or frustrated with?</li>\n<li>Don’t agonize over long articles about all the things you need to remember in order to give a good talk. Give yourself permission to suck at every aspect of doing your talk except one. E.g. maybe you’ll suck at slides, pacing, narrative arc, delivery… BUT you’ll have some really funny stories! Then, in later talks, pick ONE new aspect to do be better at each time.</li>\n</ul>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/k-Q_dXVQM1c' frameborder='0' allowfullscreen></iframe></div>\n<p><em>”[No Return: Moving beyond transactions in software and in life](<a href=\"https://www.youtube.com/watch?v=k-Q\">https://www.youtube.com/watch?v=k-Q</a></em>dXVQM1c)” by Avdi Grimm_</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>Too many to list. These days I’m most inspired by slam poets: the way someone like <a href=\"https://www.youtube.com/watch?v=yfJG4Etbt4Y\">Buddy Wakefield</a> can hold a room spellbound with words is amazing.</p>\n<p>Learn more about <a href=\"https://gotochgo.com/2020/speakers/1288/avdi-grimm\">Avdi’s talk at GOTO Chicago 2020 and how you can contact him here</a>.</p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Avdi Grimm, Software Developer and Screencaster","path":"/blog/speaker-avdi-grimm/","category":"Speaker's Story","tags":null,"date":"2020/02/28","image":"https://drive.google.com/uc?id=1Yke3jpFDhT96A8qM5vGn1zAHS2bUBDSW"}}},{"post":{"html":"<p>In preparation for <a href=\"https://gotochgo.com/2020/\">GOTO Chicago 2020</a>, I am talking to some of the conference’s speakers about\nhow they got into speaking and what their advice is for new speakers. This week, I’m featuring my interview with Denise Yu, a\nSenior Software Engineer at GitHub who has found speaking to be a great springboard for her career in tech.</p>\n<p>Like many speakers I’ve talked to over the past year, Denise comes from a nontraditional background, and is deeply passionate about helping\nother speakers get their starts. She also included some great recommendations for other speakers to watch, so be sure\nto look for that section towards the end.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p>I’m about to start a job as a Senior Software Engineer at GitHub, working on the Community &#x26; Safety team. I previously worked at Pivotal in their Cloud R&#x26;D business, where I wrote lots of YAML and pair-programmed everyday.</p>\n<p>I make tech art — mostly, doodling things quickly when I’m watching people speak at conferences, but also cat-related doodles of technical concepts, at <a href=\"https://deniseyu.io/art/\">deniseyu.io/art</a>. I started public speaking when I was about 12 years old, because at that time I thought I wanted to grow up and become a lawyer. I joined my school’s debate club, and spent about the next 12 years participating, judging, teaching, and facilitating competitive debate, Model UN, Mock Trial, and lots of other speaking-related extracurricular activities.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>For me, technical speaking has been a pretty significant career accelerator. I’ve met gracious and talented engineers who I consider to be mentors and sponsors, and <strong>I’ve been able to network my way into every single job I’ve taken, after my first job in tech, either as a direct or indirect result of my participation in public speaking at meetups and conferences. There’s no such thing as being too junior when you’re brave enough to get up in front of an audience and share what you know.</strong></p>\n<p>Speaking has never officially been part of my job, but I’ve been lucky to have had employers who supported my speaking endeavors by granting me paid time off to travel to conferences.</p>\n<h3>What makes distributed systems such an interesting topic for you?</h3>\n<p>I career-switched and didn’t study computer science in undergrad, so I have a persistent sense of imposter syndrome around missing out on foundational knowledge.</p>\n<p>I started becoming interested in the mechanics of distributed computing while debugging RabbitMQ issues in production a few years ago. I can’t remember the specifics now, but a customer experienced a network partition, and the RabbitMQ cluster nodes came back to life in an unexpected order, which caused a host of unexpected side effects.</p>\n<p>I had such poor understanding of the design decisions for partition recovery strategies, that I decided to start doing my own research, and uncovered a world of deep, deep academic research into resilience engineering for distributed systems. For someone with no computer science background, I found the reading material out there to be targeted at advanced practitioners, and it was so difficult to me to get started on learning about distsys, so I did the reasonable thing, which was to submit a talk proposal to DevOpsDays London promising to compare partition recovery strategies between a few popular open-source databases. (Side note: This was not a reasonable thing to do.)</p>\n<p>While I was writing this talk, I was also reading Martin Kleppmann’s book “Designing Data-Intensive Applications”, and I realized that before I could even talk about network partition recovery strategies, I had to spend a significant amount of time laying groundwork around why these strategies even needed to exist in the first place. The talk evolved from “RabbitMQ vs. Kafka vs. Cassandra” into a more general discussion of why distributed systems are so hard to understand, operate, and maintain. I think that as this talk has further iterated and evolved, the constant thread has been that distributed systems are difficult to learn about, and there is always space to revisit the fundamentals.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>The first conference I spoke at was SwanseaCon in 2017. I delivered a talk titled “Building Empowered Teams at Scale”. I am not sure if it was recorded, but <a href=\"https://deniseyu.io/talks\">the slides are available on my website</a>.</p>\n<p>I pitched the talk because in my first few months at Pivotal, I saw that the product teams were so much more empowered to make their own decisions, than previous teams I’d worked on, and I thought that some pieces of our philosophy around building and managing teams would be interesting to share with the world.</p>\n<p><strong>I was terrified - not about presenting in public, but specifically about speaking to a room full of engineers who knew a lot more about software and organizations than I did.</strong> I remember being so nervous about the talk that I started writing it seven months in advance. My manager helped me connect with people in leadership within the org to interview about their perspectives — which actually ended up being a really cool way to build rapport with very senior-level folks that I didn’t have day-to-day contact with.</p>\n<p>I think the talk went well - to be honest, my brain completely blurs out the exact memories of being on stage usually - but I was proud that I had pushed myself to pitch, create, and deliver a full-length conference talk, about 2.5 years into my career in tech so far.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I think I’ve spoken at upwards of 20 conferences. I’ve applied to more - I think I applied to 10 conferences last year and got accepted to 7. This year I’ve been recycling talks and being less ambitious about submitting, because I’m switching jobs and want to invest my energy in getting ramped up.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>When I develop a new talk, I spend a lot of time doing research. I actually <a href=\"https://deniseyu.io/2018/09/24/writing-tech-talks.html\">blogged about my process here</a>!</p>\n<p>As a former debate kid, <strong>the key thing that’s always worked for me is practicing in front of diverse test audiences before the big day.</strong> When I lived in London and was developing new talks regularly, I had a crew of tech friends who didn’t work with me at Pivotal, and I’d invite them over, cook them dinner, feed them wine and beer, and run my talk for them and ask for feedback. This always caught “Pivotal-isms” that I subconsciously put in, and it’d be a good way to level-set about whether my talk made sense to people who didn’t work on the same types of software that I did.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>I also have decks on this! I sometimes help local meetups with training new speaker and drumming up talk submissions for CFPs. <a href=\"https://deniseyu.io/techtalks\">Here’s the 15-minute deck that I usually run</a>.</p>\n<p>For new speakers, particularly folks with non-linear trajectories into the tech industry like myself, I always tell them this: <strong>Your story is interesting. You have a unique voice and set of experiences, and someone out there wants to hear your story.</strong></p>\n<p>It’s great to get started with smaller and lower-pressure speaking environments like meetups and possibly even presenting to bootcamp students or university student groups.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/RQrNOMO7UDk' frameborder='0' allowfullscreen></iframe></div>\n<p><em>”<a href=\"https://www.youtube.com/watch?v=RQrNOMO7UDk\">How to Tech Talk</a>” by Denise Yu</em></p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>Loads! I aspire to give talks as badass as the ones by <a href=\"https://www.youtube.com/watch?v=1xQeXOz0Ncs\">Nick Means</a> one day. <a href=\"https://www.youtube.com/watch?v=r2BFTXBundQ\">Elisabeth Hendrickson</a> is such an open and warm storyteller, the fearlessness of <a href=\"https://www.lizrice.com/talks-archive\">Liz Rice’s live demos</a> make my FitBit think I’m doing cardio, I don’t know how <a href=\"https://www.youtube.com/watch?v=8bZh5LMaSmE\">Sandi Metz</a> holds and communicates so many parallel threads of thought so clearly.</p>\n<p>Also can’t not mention <a href=\"https://www.youtube.com/watch?v=KClAPipnKqw\">Tanya Reilly</a>, Laura Nolan, <a href=\"https://www.youtube.com/watch?v=-X0hfrnbULs\">Liz Fong-Jones</a>, and <a href=\"https://www.youtube.com/watch?v=vpsrow58s0E\">Liz Keogh</a>. There are so, so many people I look up to, that I’m trying to learn from, while developing my own style.</p>\n<p>Learn more about <a href=\"https://gotochgo.com/2020/speakers/1312/denise-yu\">Denise’s talk at GOTO Chicago 2020 and how you can contact her here</a>.</p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Denise Yu, Tech Artist and Software Engineer","path":"/blog/speaker-denise-yu/","category":"Speaker's Story","tags":null,"date":"2020/02/25","image":"https://drive.google.com/uc?id=1FGh0fH-Cn9lABXYu1PvqIDkUjp5gh7v-"}}},{"post":{"html":"<p>This year, I’ll be attending <a href=\"https://gotochgo.com/2020/\">GOTO Chicago</a>, so leading up to the event, I wanted to highlight some of the\nspeakers who will be presenting. I was really excited to hear from Bruce Lawson because HTML is such a core piece of technology for\nthe web, but so many of us take it for granted. As a member of the W3C’s HTML5.3 specification team and writer on the topic, I knew\nBruce would make for an interesting speaker to feature here.</p>\n<p>Read on to hear about Bruce’s wide-ranging experience from music to acting to accessibility, and some of his tips for new speakers.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p>I’m an accessibility and web standards consultant (<a href=\"https://www.brucelawson.co.uk/\">you can hire me!</a>). Side projects are music: <a href=\"https://www.brucelawson.co.uk/category/my-music/\">writing and recording</a> and developing a new product called <a href=\"https://twitter.com/swordcello\">SwordCello</a>, which isn’t released yet. I got into public speaking as a kid, when I was an actor.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>It used to be an integral part of my job in Developer Relations for Opera, now it’s for fun - it’s a good way of seeing old friends or visiting a new city. It’s definitely benefited my career, and hopefully helped my audience’s careers, too.</p>\n<h3>What makes HTML such an interesting topic for you?</h3>\n<p>HTML is the foundational language of the web: the greatest store of knowledge (and bullshit) ever. It’s forwards and backwards compatible. It’s developed to be accessible, work with any human language or script and to be secure. What’s not to love?</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/f6As5HEkG5E' frameborder='0' allowfullscreen></iframe></div>\n<p><em>”<a href=\"https://www.youtube.com/watch?v=f6As5HEkG5E\">Ensuring a High Performing Web for the Next Billion People</a>” by Bruce Lawson at Velocity Amsterdam</em></p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>It was a 15 minute talk about accessibility in the Netherlands. It went OK, as I remember. But it was very dry.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Ooh, about 150 I think. I probably only applied to about 10; the rest were invitations from the conference organiser.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>Safety pee; check zip is up; make sure you have water (not sparkling, else you might burp down the mic). Go through your slides one last time.</p>\n<h3>What advice do you have for new speakers?</h3>\n<ul>\n<li>Even if you think your subject has been spoken about before, you’re bringing your own unique slant to it.</li>\n<li>Make sure you tell a story - you have a beginning, middle and end.</li>\n<li>Don’t spend ages introducing yourself.</li>\n<li>Never claim something is easy or obvious, just because it is to you.</li>\n<li>Put in a few jokes.</li>\n<li>Relax. If you dry up and can’t remember the next bit, take a sip of water so you don’t feel like a deer in the headlights.</li>\n<li>Don’t take questions; tell the audience that you’ll be around the venue and they are more than welcome to approach you and ask you questions.</li>\n</ul>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p><a href=\"https://twitter.com/SaraSoueidan\">Sara Soueidan</a> for her energy and passion; <a href=\"https://twitter.com/mathias\">Mathias Bynens</a> for his geekery and humour; <a href=\"https://twitter.com/jaffathecake\">Jake Archibald</a> for his knowledge and wit; <a href=\"https://twitter.com/sarah_edo\">Sarah Drasner</a> for her enthusiasm and knowledge. However, I learn from almost every talk I attend.</p>\n<p>Learn more about <a href=\"https://gotochgo.com/2020/speakers/1263/bruce-lawson\">Bruce’s talk at GOTO Chicago 2020 and how you can contact him here</a>.</p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Bruce Lawson, HTML5 Spec Editor and Musician","path":"/blog/speaker-bruce-lawson/","category":"Speaker's Story","tags":null,"date":"2020/02/20","image":"https://drive.google.com/uc?id=1F2ECoS80xRLABMFLcBOgPZhZWAgX6D65"}}},{"post":{"html":"<p>I launched <a href=\"/members/\">CFP Land Pro</a> back in 2019. After gathering feedback from hundreds of technology conference speakers, I realized that like me, many of them struggled to find and keep up with which CFPs were available and which ones they had applied to. Additionally, I wanted to find a way to make sure CFP Land was self-sustaining, so CFP Land Pro was born.</p>\n<p>If you’re considering a <a href=\"/members/\">Pro Membership</a>, read on to learn more about everything that’s included. Don’t hesitate to <a href=\"mailto:info@cfpland.com\">email me</a> if you have questions about how CFP Land can help you be a more successful speaker.</p>\n<!--more-->\n<h2><span id=\"early-access\">1. Early Access to CFPs</span></h2>\n<p>The weekly CFP Land newsletter and <a href=\"/conferences/\">our free conference listings</a> show all CFPs that close in the next 21 days. Usually this is plenty of time to apply, but many conferences review applicants on a rolling basis. In those cases, <strong>applying as early as possible is advantageous</strong>.</p>\n<p>One of the most popular features among Pro Members is the early access to CFPs. If you’re not a Pro Member already, you won’t see any conferences tagged <code class=\"language-text\">⬆️ Pro</code> in your feed, but if you sign up for a Pro Membership, here’s what it looks like:</p>\n<p><a href=\"/members/\"><img src=\"/img/posts/pro-early-access.png\" alt=\"Pro Members get access to CFPs 21 days before free members\"></a></p>\n<p>As a Pro Member, you can see all the CFPs in our database that are closing in the next <strong>42 days</strong>, meaning you’ll be able to apply much earlier than free users.</p>\n<h2><span id=\"save-cfps\">2. Save CFPs</span></h2>\n<p><a href=\"/members/\"><img src=\"/img/posts/save-cfps-1.gif\" class=\"right\" alt=\"Save conferences to be reminded before they close\"></a></p>\n<p>It’s easy to lose track of which CFPs you want to submit when there are hundreds each month on CFP Land alone. <strong>Saving CFPs is a great way to keep up with the conferences that you care about most.</strong></p>\n<p>Once you save a CFP to your Pro account, you’ll get email reminders 21, 7, and 3 days before it closes. This is great if you’re browsing CFPs on mobile, but you don’t want to forget to submit to them when you’re back at your computer.</p>\n<p>Another useful reason to save CFPs is to personalize your feed of upcoming Calls for Proposals. By default, there may be 50 to 100 open CFPs on the “All” page, so saving CFPs will ensure you don’t have to wade through quite as many irrelevant conferences.</p>\n<h2><span id=\"export-cfps\">3. Export CFPs to Your Personal Calendar</span></h2>\n<p><a href=\"/members/\"><img src=\"/img/posts/export-cfps-2.gif\" alt=\"Using CFP Land Pro to export conferences to your calendar\"></a></p>\n<p>You don’t have to track your CFPs in CFP Land. Pro Members also get a calendar export tool that allows you to save CFPs to Google Calendar, Apple Calendar, or Outlook.</p>\n<p>This is helpful if you want to create custom reminders or use your own calendar notifications rather than the CFP Land emails.</p>\n<h2><span id=\"search-alerts\">4. Custom Search Alerts</span></h2>\n<p><a href=\"/members/\"><img src=\"/img/posts/saved-search-2.gif\" alt=\"Saving searches with your CFP Land Pro Membership\"></a></p>\n<p>All CFP Land users can use filters to search for conferences that match their preferences, but if you’re a free user, you will need to check the site periodically to make sure you don’t miss any new opportunities. In order to make your life a little easier, <strong>CFP Land Pro Members can save their searches to get an email alert when new CFPs are found that match their filters.</strong></p>\n<p><a href=\"/members/\"><img src=\"/img/posts/saved-search-3.png\" class=\"right\" alt=\"Email alert when results from a saved search are found\" /></a></p>\n<p>When a new conference CFP is found that matches one of your saved searches, you’ll get an email about it, letting you know that you can either <a href=\"/blog/pro-saving-cfps/\">Save the CFP</a> or apply right away.</p>\n<p>Hopefully you’ll never miss another great CFP once you set up your searches on <a href=\"/members/\">CFP Land Pro</a>.</p>\n<h2><span id=\"abstracts\">5. Save Your Abstracts</span></h2>\n<p><a href=\"/members/\"><img src=\"/img/posts/abstracts.png\" alt=\"Abstracts on CFP Land Pro\"></a></p>\n<p>Most experienced speakers have a pool of abstracts that they could submit depending on the audience and conference focus. CFP Land Pro Members can save those Abstracts to their CFP Land account so that they can tie them to each CFP they submit.</p>\n<p>This is a great way to see which of your abstracts is the most successful and to remember which Abstract you submitted to which conference.</p>\n<h2><span id=\"track\">6. Track Your Submissions</span></h2>\n<p><a href=\"/members/\"><img src=\"/img/posts/track.gif\" alt=\"Track submissions on CFP Land Pro\"></a></p>\n<p>Finally, if you submit dozens of Abstracts per year, it can be hard to keep up with all of them. In my first year of speaking, I used a giant spreadsheet to track over 50 submissions, and it got to be a huge mess.</p>\n<p>CFP Land Pro Members can track the conferences they’ve applied to, been accepted at, and been rejected from in addition to attaching their Abstracts to each submission.</p>\n<hr>\n<p>Much more will be coming soon, so if you’re interested, <a href=\"/members/\">your CFP Land Pro Membership is just a few clicks away</a>!</p>","frontmatter":{"layout":"post","title":"Pro Members Only: A Complete List of All the Features CFP Land Pro Members Get","path":"/blog/pro-features/","category":"Updates","tags":["Pro Features"],"date":"2020/02/07","image":"/img/posts/pro-early-access.png"}}}],"pathPrefix":"blog","first":true,"last":false,"index":1,"pageCount":5,"additionalContext":{}}}