{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"c0e29e45-874b-5fa7-b5d4-81e524256bde","html":"<p>Last week, I added a couple new sources that more than tripled the number of <a href=\"https://www.cfpland.com/conferences\">conference CFPs listed on our site</a>.\nUnfortunately, I made an assumption that any publicly available API would be okay to integrate with, and one of the new sources\ngot a little bothered about my cross-posting their listings. In order to increase transparency, I’m going to show you where\nI get all the data for this site, and outline my policy on sharing this data.</p>\n<!--more-->\n<h3>CFP Source Data</h3>\n<p>First of all, <strong>my immediate goal for CFP Land is to provide a free feed of all the upcoming CFPs for tech conferences that I can find</strong>.</p>\n<p>With that in mind, I want to give credit to the sources I use to find out about CFPs:</p>\n<ul>\n<li><strong><a href=\"https://confs.tech/\">Confs.tech</a></strong> - An open source list of conferences that I and many others have contributed to.</li>\n<li><strong><a href=\"https://callingallpapers.com/\">Calling All Papers</a></strong> - An open source list and API that aggregates CFPs from joind.in, papercall.io, and lanyrd (which I believe is now defunct).</li>\n<li><strong>Twitter searches and retweets</strong> - People often mention <a href=\"https://twitter.com/cfp_land\">@cfp_land</a> with new conferences, but I also have a few Twitter searches set up to help me find new CFPs.</li>\n<li><strong>Conference Speaker Slack channel</strong> - I am a part of a Slack channel for conference speakers where we often pass CFPs around. I add many of these to my list as well.</li>\n<li><strong>User submissions</strong> - Finally, I’m getting an increasing number of <a href=\"https://www.cfpland.com/submit\">submissions from subscribers</a>. This is really helpful, and I plan on making it even easier to do in the future.</li>\n</ul>\n<h3>Enhancing Source Data</h3>\n<p>Getting the upcoming CFPs is the first part of the process. Next, I manually review each one, make sure it’s categorized, that the location\nis accurate, and I add data about whether they cover travel and hotel costs for speakers. This takes me an increasing amount of time\neach week, but I’m working to automate it. 🤖</p>\n<p>I also have scripts that add logos, Twitter accounts, descriptions, and other metadata.</p>\n<h3>Acceptable Data Use</h3>\n<p>All the data I have is available to the public for any purpose (including building tools that directly compete with CFP Land!) <a href=\"https://www.cfpland.com/conferences\">here on the website</a>, <a href=\"https://feeds.cfpland.com/v2/rss/cfps\">in this RSS feed</a>, or <a href=\"https://cfpland.github.io/api-docs/\">through the API</a>. Seriously, if you want to build something cool with it, go for it. I’d love to hear about it! One guy sent me a message about a <a href=\"https://github.com/jonatasbaldin/cfpland-telegram-bot\">CFP Land Telegram Bot</a> that he built. 👍</p>\n<p>I don’t currently show CFPs that have closed or CFPs that are closing in more than 3 weeks, but I am working on making them available too.</p>\n<h3>Monetization</h3>\n<p><strong>My long-term goal for this project is to make it self-sustaining.</strong></p>\n<p>I do occasionally find sponsors for the newsletter, and I’m exploring building a CFP submission management tool for speakers. If it makes enough to pay for my hosting and email client bills someday, that would be pretty cool. If not, I’ll probably try to do as much as can be fully automated and stop doing as much cleanup.</p>\n<p>If you have questions or problems with any of this, I am a real person. My name is Karl. I live in Chicago, USA and have <a href=\"https://www.instagram.com/urbanmutt_chilidog/\">a dog named Chili</a>. Just <a href=\"mailto:karl@cfpland.com\">email me</a> and I’d love to talk. 💌</p>","frontmatter":{"layout":"post","title":"CFP Land Data Sources & Sharing","path":"/blog/data/","category":"Updates","tags":["Data","Website"],"date":"2019/04/29","image":"https://i.imgur.com/TU40Hf6.jpg"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}