{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"7c763616-8ce8-5a43-a3e5-218f9365f5ac","html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>This week, I’m thrilled to bring you the story of <a href=\"https://geshan.com.np/\">Geshan\nManandhar</a>, a native of Nepal who now lives in\nAustralia. One of the things I love about speaking at conferences is the\nopportunity to meet people from all over the world, so reading Geshan’s\nexperience as a speaker on multiple continents was inspiring.</p>\n<!--more-->\n<img src=\"https://cdn-images-1.medium.com/max/1200/1*mQ216JZETiJBtVpHdGLBkA.jpeg\" class=\"left\">\n<h3>Tell me about yourself? How did you get into public speaking?</h3>\n<p>I have been a software engineer for more than a decade now. I have worked as a\nsoftware engineer in 3 countries in the past 10 years. I am primarily a backend\nsoftware engineer who dabbles in the frontend side of things once in a while.</p>\n<p>I used to do public speaking even in 2010 but I restarted doing it in 2014 when\nI spoke at a meetup in Kathmandu, Nepal. Then I started sending out abstract to\nCFPs in 2015, and in 2016 I spoke at my first conference: Code Motion Dubai.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I like meeting like-minded people with the profession in common. All of us are\nsolution providers at the end of the day at times with code and sometimes\nwithout code too. I like the positive energy conferences have and regardless of\nwhere you work or the number of years of experience one has all of the\nparticipants are there to learn and share the experience. I admire the time,\neffort and resources put in by speakers for their talk.</p>\n<p>Public speaking, to be honest, has benefited my career both directly and\nindirectly. It has surely given me recognition and many people have approached\nme after doing some public speaking for various reasons. To be honest, adding a\nsection in your CV where you have spoken in a couple of good conferences does\nadd more value.</p>\n<h3>Do you remember your first conference talk?</h3>\n<p>My first big conference talk was in August, 2016 in Amsterdam for Laracon EU.\nProbably that was the biggest audience I had spoken in front of and included all\nthe who’s who of that community. It was a talk on ChatOps and I think for that\ncommunity of people it was a relatively new thing then.</p>\n<p><span class=\"figcaption_hack\">Geshan’s first big conference talk at Laracon EU, 2016</span></p>\n<p>I think it went pretty well, I was shaky and nervous when I started of course\nand then after the first 10 minutes I think I was in the flow and telling most\nof the things I had to talk about.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>To be honest, I have lost count on how many CFPs I have submitted my abstracts,\nfrom 2015 it surely should be in the 100s. I generally submit to conferences\nthat cover both travel and accommodations or at least travel. Like an e-commerce\nwebsite, I believe (at least for me) the conversion (success) rate is like 1% or\nless :). In total from 2016 to now I have spoken at 4 conferences in 4\ncontinents, not sure if it qualifies me to be called an international speaker\nfrom Nepal though :).</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I narrate the talk to myself the night before. Then right before the talk, I\nmake sure I have things I need with me like water, screen connections, and that\nthe screen size is fine. After I get on stage, I focus on delivering the message\nwith the right impact.</p>\n<p>I try to keep preparation pretty simple: don’t over-prepare, keep things\nspontaneous, but have some direction and keep an eye on the time.</p>\n<p>I usually don’t have speaker notes so I look at the slides and then improvise on\nthem. That’s why even if I do the same talk a second time, the details I include\neach time will be different.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>For new speakers, there are two main pieces of advice:</p>\n<p><strong>First, give your talk on local meetups.</strong> Local user group meetups are always\nlooking for speakers so if you approach them you will rarely hear a no you can’t\npresent. Depending on your city, the frequency of meetups in your area of tech\nmight be many, little, or none. When you practice your talk in a smaller group\nyou get feedback and also get over imposter syndrome.</p>\n<p>Speaking is not a thing for everyone, so try it in a smaller group. If you like\nit do it more, but bare in mind public speaking is a very important skill for\nyour career.</p>\n<p><strong>The second one is to work on your title and abstract.</strong> When conferences have\nCFPs the main thing in my opinion that stands out is your title and abstract.\nThe relevance of the talk in that conference is vital too, for instance, a Ruby\nconference will never accept a PHP 7 features talk. As some conferences have\nblind speaker selection, always work an extra bit on your title and abstracts.</p>\n<p>Then, it’s all about submitting your talk to all the CFPs you can find. The best\nway to find CFPs is <a href=\"https://www.cfpland.com/\">CFP Land</a>,\n<a href=\"https://www.papercall.io/\">papercall.io</a>, <a href=\"https://confs.tech/\">confs.tech</a>,\nlanyrd.com (it’s usually down though),\n<a href=\"https://callingallpapers.com/\">callingallpapers.com</a>. I wrote some <a href=\"https://geshan.com.np/blog/2016/09/some-useful-resources-for-conference-speakers-and-wanna-be-speakers/\">more advice\nfor finding speaking opportunities on my blog\ntoo</a>.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>One tech speaker who is great to listen to is <a href=\"https://twitter.com/kelseyhightower\">Kelsey\nHightower</a> from Google. His talks are\nspontaneous, fun, and filled with information.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/_1-5YFfJCqM' frameborder='0' allowfullscreen></iframe></div>\n<p>Someone that I witnessed in-person who is very good on stage is <a href=\"https://twitter.com/adamwathan\">Adam\nWathan</a>. He was able to explain a complex topic\nin a very easy way and had the courage to do live coding on a stage with like\n500+ people watching.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/dfgtKb-VpRk' frameborder='0' allowfullscreen></iframe></div>\n<h3>Where can readers find more about you?</h3>\n<p>I blog at Geshan.com.np, I don’t have my next talks up yet, but the talks I have\ndone in the past are in the <a href=\"https://geshan.com.np/blog/categories/talks/\">“talks” section of my\nblog</a>.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed//QitdhwHYAVE' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Geshan’s more recent talk from DevOps Days Newcastle on Microservices</em></p>\n<hr>\n<p>If you’re a tech conference speaker, email karl@cfpland.com to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Geshan Manandhar, Intercontinental Speaker and Senior Software Engineer","path":"/blog/speakers-story-geshan-manandhar/","category":"Speaker's Story","tags":null,"date":"2019/03/24","image":"https://cdn-images-1.medium.com/max/1200/1*mQ216JZETiJBtVpHdGLBkA.jpeg"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}