{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"remark":{"posts":[{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>It’s no surprise that many tech conference speakers are also involved or helping organize local meetup groups. My\nguest this week - JC Hiatt - actually runs three of them, and this year he organized <a href=\"https://magnoliajs.com/\">his first conference</a>.\nIn addition, JC works as a software engineer and is on track to speak at several conferences in the upcoming year. JC has some\ngreat tips for speakers - from both an organizer’s and speaker’s perspective. </p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/9yzgNfr.jpg\" class=\"right\">\n<p>I work as Software Engineer at Growth Manager at <a href=\"https://echobind.com/\">Echobind</a>, a remote web and mobile consultancy for healthcare, life science, and technology companies (we’re hiring!) . On the side, I am also working on growing DevLifts, a company I started to help developers get fit.</p>\n<p>I got into public speaking through starting to speak at local meetups a few years ago, and then subsequently running 3 meetups and having a hard time finding speakers sometimes.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I love speaking at conferences because I get to share my ideas with a lot of people in a conversational (and more human) manner (as opposed to Twitter) and have those ideas put to the test. I also love getting to meet lots of new developers! Attending conferences is obviously a way to do that, but speaking can make it easier since people will want to come talk to you after your talk.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I actually just gave my first conference talk earlier this month! Going into it, I was a little nervous just because I was covering a fairly sensitive topic (fitness &#x26; health), but it went great. I got to meet a bunch of developers and hear about what they do to stay fit and healthy.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Until recently, I had applied to maybe 5-6 conferences and been rejected by all by 1. But in the past 2 months I got more aggressive with it and have applied to 30ish conferences. I’ve been accepted by 3 so far.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>About 15 minutes before, I’ll make sure to find the MC (or whoever is in charge of getting me to the right place for my talk) and checking in with them so they know where I am. I’ll have a glass of water and go to the bathroom. Then I’ll grab another glass of water to sip throughout the talk if necessary. I’ll also turn my phone off and put it in my backpack or somewhere not on my person. Most importantly, I always make sure my notifications are muted!!!</p>\n<h3>What advice do you have for new speakers?</h3>\n<p><a href=\"https://twitter.com/GantLaborde\">Gant Laborde</a> gave me some fantastic advice before my first conference talk. I was a bit nervous and he said, “You’re not nervous. You’re excited.”</p>\n<p>Nervousness is inward focused — I’m afraid I’ll screw up, I’m afraid something will go wrong, I’m afraid they’ll hate my talk, I’m afraid I’ll start Twitter war.</p>\n<p>Being excited is outward focused — I’m excited to give this talk to help others with this area of their lives. I’m doing this because I want to help other developers. If at least one person walks away feeling good/empowered/excited/etc., I’ll be happy.</p>\n<p>As a conference organizer, I’ll also say to new speakers:</p>\n<ol>\n<li>\n<p>Show up early (at least an hour before your talk). This makes the organizers much less stressed if they know you are in the building because they’ve seen you.</p>\n</li>\n<li>\n<p>Make sure the MC can find you 15-20 minutes before your talk.</p>\n</li>\n<li>\n<p>Practice your talk. If you didn’t, it’s obvious.</p>\n</li>\n<li>\n<p>Be flexible. Organizing conferences is hard and usually being done for free as a labor of love. Being a diva because you can’t get a certain type of water will definitely get you on the <em>do-not-invite-back</em> list.</p>\n</li>\n</ol>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>So many, but here are a few:</p>\n<ol>\n<li>\n<p><a href=\"https://twitter.com/GantLaborde\">Gant Laborde</a> is hands down the best speaker I know. I love being part of his audience.</p>\n</li>\n<li>\n<p><a href=\"https://twitter.com/ken_wheeler\">Ken Wheeler</a> has the best combination of jokes and crazy good demos.</p>\n</li>\n<li>\n<p><a href=\"https://twitter.com/dabit3\">Nader Dabit</a> got me into speaking because he’s one of the first people I saw give a tech talk at our local meetup years ago.</p>\n</li>\n<li>\n<p><a href=\"https://twitter.com/dan_abramov\">Dan Abramov</a> because daaaaaang does that dude know how to keep a crowd engaged.</p>\n</li>\n<li>\n<p><a href=\"https://twitter.com/holtbt\">Brian Holt</a> because his talks have always been funny, mind-blowing, and approachable to me.</p>\n</li>\n</ol>\n<h3>Where can readers find more about you?</h3>\n<p>My next scheduled conference talk is at <a href=\"https://connect.tech/\">Connect.tech</a> this October! Also check out my websites and Twitter accounts:</p>\n<ul>\n<li><a href=\"https://jchiatt.com\">jchiatt.com</a></li>\n<li><a href=\"https://twitter.com/jchiatt\">@jchiatt</a></li>\n<li><a href=\"https://devlifts.io\">devlifts.io</a></li>\n</ul>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: JC Hiatt, Meetup and Conference Organizer Turned Speaker","path":"/blog/speaker-jc-hiatt/","category":"Speaker's Story","tags":null,"date":"2019/08/16","image":"https://i.imgur.com/9yzgNfr.jpg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>At 23 years old, most software developers are just happy landing their first job, but for Tae’lur, that wasn’t enough. A self-taught developer and technical writer, Tae’lur has used her gift for breaking down complex topics to inspire and teach other aspiring developers across the world. Just two years ago, she was working at a minimum wage fast-food job, and now she’s been accepted to speak at 8 tech conferences about topics ranging from her journey to VR development in React. Not many stories out there are as inspiring at Tae’lur’s, so read on and hear what she’s learned along the way.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/Y6wxxj3.jpg\" class=\"left\">\n<p>I am a Front-End Engineer and technical content creator. I’m currently a freelance technical writer and in my current contract position, I’m writing product documentation &#x26; user guides. I also write tutorials on topics such as Git &#x26; Gatsby.</p>\n<p>My mission is to make the learning curve of software development an easier process for everyone. I got into speaking after I was invited to share my story of how <a href=\"https://twitter.com/TaelurAlexis/status/1046663234978115585\">I transitioned into tech from fast food</a> at CascadiaJS in November 2018. A few months later, I decided to just follow accounts like <a href=\"https://twitter.com/cfp_land\">@cfpland</a> and submit talks!</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I like how I’m putting myself out there and slowly yet surely coming out of my introverted shell. I’ve always had a secret obsession with researching and curating resources so being able to travel and present my findings is my thing. The public speaking is a strategic move, my goal is to get into developer advocacy.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/7idBFx7erWA' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Tae’lur Alexis, “Creating 3D User Experiences with React” at React 360</em></p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first solo conference talk was just recently actually! It occurred June 6, 2019. It was RefactrTech, a conference based in Atlanta and the presentation was titled, “Building Accessible UI with React”. The talk consisted of me discussing ways you can improve the accessibility of your application and the different libraries and tools you can use.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve applied to at least 15, have been accepted to 8 and have spoken at one so far.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>My process has so far been to gather so many resources on the topic I’m presenting on and read through the documentation and possibly experiment with building demos. Building demos can really help you with learning the ins and outs on a topic and you never know what you may uncover.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>Advice I’d give to new speakers before they give a talk is to remember these are regular people who are rooting for you. And the biggest step is to just be there. And when it’s over, it’s over. Afterwards you’re free to roam, explore and breathe.</p>\n<p>You don’t need to be an expert, just be passionately curious. Follow @cfp_land, have an interesting talk title and abstract (summary of what your talk would be on) and just submit to every conference that’s relevant to your interests. You can submit multiple talks and I highly encourage you do so. People call this “conference-driven development”. The submissions are reviewed and approved MONTHS before the conference actually happens so you’ll have time.</p>\n<p>Another way to find conferences that’s worked for me is to literally search “tech cfp” on Twitter!</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p><a href=\"https://twitter.com/eveporcello\">Eve Porcello</a> and <a href=\"https://twitter.com/marcysutton\">Marcy Sutton</a> are my top inspirations.</p>\n<p>CascadiaJS was the first conference I’ve ever attended and as stated, it occurred in November 2018. Eve Porcello invited me to her GraphQL workshop at CascadiaJS in Seattle and seeing how comfortable she was presenting on such an advanced topic was so inspiring. And then to know she’s authored O’Reilly books and travels doing conference talks and workshops for a living BLEW. MY. MIND.</p>\n<p>Then I meet Marcy Sutton who embraced me after I spoke on stage about my story. Her passion around accessibility and learning more about her role in developer advocacy is literally why I do what I do today. They are both the reason why I’ve pursued accessibility and developer advocacy. I want to be able to use my interest in writing and community engagement to make an impact and have a nomadic career.</p>\n<h3>Where can readers find more about you?</h3>\n<p>You can <a href=\"https://www.twitter.com/TaelurAlexis\">follow me on Twitter</a> and I post weekend recaps on what I have going on in my life <a href=\"https://www.youtube.com/user/TaelurAlexis\">on YouTube here</a>.</p>\n<p>I’m building an online platform called <a href=\"https://codeeveryday.io/\">CodeEveryday</a> where I’m providing learning resources, mentorship and job postings so you can subscribe to the newsletter as we prep for the release! You can subscribe to the newsletter at <a href=\"https://codeeveryday.io/\">CodeEveryday.io</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Tae’lur Alexis, Frontend Engineer and Founder of CodeEveryday","path":"/blog/speaker-taelur-alexis/","category":"Speaker's Story","tags":null,"date":"2019/08/09","image":"https://i.imgur.com/Y6wxxj3.jpg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Many technical leads that I’ve spoken to don’t realize how much knowledge they have that others do not. It’s easy when you\nspend every day working with caching in Ruby, for example, to forget that most devs never get the chance to do what you do.\nLike Molly, many speakers realize that their unique knowledge is worth sharing, and start getting on stage. In this interview,\nwe talked about Molly’s journey and some of her advice for new speakers.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/sU57xj3.jpg\" class=\"right\">\n<p>I am currently the Lead Site Reliability Engineer at Kenna Security. I have been working at Kenna for almost 4 years now and I got into public speaking last year thanks to the support at Kenna.</p>\n<p>My lead at the time suggested that I find ways I could share my knowledge with others. I had become extremely proficient and knowledge about making performance improvements in our Ruby application so I started with sharing that knowledge internally and then decided to try submitting a talk on it to a conference. I submitted a proposal to RubyConf not thinking anything would come of it. Because my expectations were low I also submitted a talk to a local meetup about another technical passion of mine, Elasticsearch.</p>\n<p>Needless to say, BOTH talks were accepted and my Fall quickly became very busy. I had done debate and was good at speaking in high school, but I was not sure what to expect from technical speaking. After giving my first talk and seeing the response it got and how thankful the people were, I was hooked! It has been less than a year since that first talk and I have given 2 conference talks since, plus a few Meetup talks.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I enjoy being able to share my advice with a lot of people at once. It is like mentoring or giving advice on steroids. I also really enjoy getting out of the office and getting to meet other devs. Everyone has such difference experiences and being able to chat with everyone is a great way to bring back new ideas and learn new things.</p>\n<p>It has definitely benefited my career because I have made so many amazing professional connections via speaking. All of my talks were inspired by my work, but are not required for me to do my job. The speaking and additional connections I have made have also benefited Kenna as well in the form of bringing in job candidates. Kenna has been very supportive of all the speaking and covers all of my expenses whenever I speak.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>You bet I do since it was last November! It went fabulous! For a few days after I was on a high from it.</p>\n<p>I have looked up to many speakers and the idea of me being up on the stage was almost something I couldn’t comprehend. Once I did it, I was amazed with myself and also immediately ready to do it again! My only regret was that I left my necklace on and that interfered with the mic near the end. I was worried that it might have been horrible for those listening, but no one said anything. I don’t think many people even noticed. Being a perfectionist, I definitely did. But live and learn!</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/vEi-vYcyTT8' frameborder='0' allowfullscreen></iframe></div>\n<p><em><a href=\"http://confreaks.tv/videos/rubyconf2018-cache-is-king-get-the-most-bang-for-your-buck-from-ruby\">Cache is King: Get the Most Bang for Your Buck From Ruby by Molly Struve</a></em></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I have spoken at 3 conferences and applied to probably 9, some of which are this fall so I am waiting to hear back about those. The 3 conferences I have spoken at have all been Ruby conferences which have been incredible! A couple I applied to in the Fall are Site Reliability and DevOps conferences. I am interested, if accepted, to see how they differ.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I am a big proponent of practicing my talk!</p>\n<p>I know some people who prefer not to practice and they do better when they wing it, but I am not one of those people. I like to know exactly what I am going to say when I get up there. Because of that I practice my talk a lot and I memorize my intro and ending so those are guaranteed to go smoothly. Right before I talk I like to <a href=\"https://www.ted.com/talks/amy_cuddy_your_body_language_shapes_who_you_are?language=en\">Power Pose</a>. But when I Power Pose, I do it with a twist. I recite <a href=\"https://www.youtube.com/watch?v=7zFHkBQBg-4\">these lines from Jr in Cool Runnings</a> All of that helps me feel really confident and bad ass before I go on.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>The best advice I have for new speakers, especially those who feel intimidated by speaking at a conference, is to start small. <strong>Begin by giving talks internally at your company first.</strong> It could be as simple as giving a demo of a feature you built. From there, consider lightening talks at a conference or even a talk at a Meetup. Once you are comfortable, then apply to a conference.</p>\n<p>If you are a new speaker that has already been accepted to give a conference talk then my best advice would be to <strong>give your talk in a smaller setting about a month before</strong>. This forces you to get the talk done early which will save you from last minute, frantic cramming. It will also allow you to get some feedback on the talk. I gave my first conference talk 3 times before RubyConf. I gave it at 2 small meetups and once for my coworkers. Every time I got great feedback that I was able to use to tweak the talk and make it more clear and approachable.</p>\n<p>Picking a topic can also be a struggle for people who want to get started, but sometimes feel they have nothing “new” to talk about. First and foremost, <strong>ANY topic is fair game even if people have talked about it before</strong>. You can always bring a new perspective to a topic. Even presenting new examples for a topic could help someone who has heard the topic a thousand times finally understand it. My first conference talk I wrote, Cache is King, I thought for sure it was too “simple” and not “innovative” enough to ever be considered. But I quickly learned, most conference talks aren’t about discovering something new, they are about taking a topic and presenting it in a way that is approachable and helps your audience learn something.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p><a href=\"https://twitter.com/saronyitbarek\">Saron Yitbarek</a> has been HUGELY inspirational as well as <a href=\"https://twitter.com/r00k\">Ben Ornstein</a>.</p>\n<p>Right after I got accepted to speak at my first conference I watched Saron’s talk on building a community which gave me all the good feels I needed to believe I could take on this daunting task. I then watched Ben Ornstein’s talk on <a href=\"https://www.youtube.com/watch?v=l9JXH7JPjR4\">How to Give a Technical Talk</a> and that really inspired me to make my speech relatable and entertaining. My favorite quote is, “You can’t teach them anything if you don’t have their attention”</p>\n<h3>Where can readers find more about you?</h3>\n<p>I have been pretty good about keeping my personal website up to date and that is <a href=\"https://www.mollystruve.com/\">www.mollystruve.com</a>. There I have links to my Twitter, blog, Instagram, Facebook, etc. I am also very passionate about blogging so I would be remiss if I didn’t include a link directly to my blog, <a href=\"https://dev.to/molly_struve\">dev.to/mollystruve</a>.</p>\n<p>I am a big fan of taking a talk and breaking it down into blog posts so it can reach more people. The opposite works as well, I have used some of my blogs to drive some talk ideas.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Molly Struve, Site Reliability Engineer and Technical Speaker","path":"/blog/speaker-molly-struve/","category":"Speaker's Story","tags":null,"date":"2019/08/02","image":"https://i.imgur.com/sU57xj3.jpg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>I find that a lot of speakers are passionate about the topics they espouse, but not many have as important a topic as\nEva PenzeyMoog. I had never thought about the role technology plays in domestic violence until hearing about Eva’s work,\nand Eva has made it her mission to make sure everyone knows about this problem. Her journey into public speaking grew out\nof her desire to improve the world around her and promote “designing for inclusive safety,” so I hope you’ll be inspired\nby her story and get involved in something you’re passionate about as well.</p>\n<p><em>Note: If you want to support Eva’s work, <a href=\"https://www.patreon.com/epenzeymoog\">she has a Patreon page</a> which will help her\nspeak at more conferences and events.</em></p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p>I’m a Lead Designer at 8th Light, a custom software consultancy. I do UX and front-end development and work with various clients on designing and building their software.</p>\n<p>I was never interested in public speaking, but before I became a designer about 3 years ago I worked at an education-focused non-profit, and have a background in teaching, so I’ve always been pretty comfortable in the very small scale stage of a classroom. Before I started at 8th Light I volunteered doing a workshop about domestic violence, and part of my apprenticeship involved doing a talk for a small group of people, and I did that workshop.</p>\n<p>I got a lot of positive feedback, and eventually did a version of it at our internal company conference. A while later, a co-worker who was organizing a Ruby conference asked me to do a short talk about how developers could do quick usability testing, so that they could have good UX of features they were building when there wasn’t a designer in the room. That talk went pretty well despite the fact that I felt like I was going to pass out the entire time.</p>\n<p>I did that talk at another conference, but quickly felt a strong urge to go back to speaking about something I really cared about. I had been thinking for a long time about the ways that technology enables domestic violence, and had been collecting examples, but never felt like I was an “expert” enough to do a talk about it. It really seemed like something that other, smarter people were working on. But eventually I realized that wasn’t true, that if someone out there was already talking about this stuff, I couldn’t for the life of me find them.</p>\n<p>Right around that time, Russ Unger, who leads UX Camp in Chicago, responded to a proposal I’d submitted saying my topic wasn’t quite right, and he asked “is there anything else you’ve though about doing a talk about?” I told him about my idea for a talk about how tech enables domestic violence, and he said that would be perfect for the conference. I owe him a lot for taking the time to figure out that this talk was on my mind and giving me what I needed to finally do it. It took dozens of hours of research and stitching together stories from news articles and people who had disclosed their experiences to me to make my talk, but I finally did it, and ever since UX Camp I’ve had a lot of success with it.</p>\n<h3>What do you focus on speaking about?</h3>\n<p>My speaking is all about how technology enables domestic violence; how abusers can utilize technology to further their power and control over their victims, and how products that don’t enable abuse but are clearly spaces where survivors are taking certain actions that disclose the abuse and meaningful intervention could be provided (“Survivor” is the preferred term instead over “victim”, since it speaks to the person’s ability to endure and survive a dangerous situation.)</p>\n<p>I tell a story about someone experiencing domestic violence in 5 different areas, give stats that correlate to those areas, and describe ways that more thoughtful design or building of the product could prevent the abuse. The 5 areas are financial abuse through online banking tools, harassment and monitoring through “smart” home devices/Internet of Things devices, stalking through GPS-enabled devices, personal security through software such as building management software, and how fitness, wellness, and pregnancy products could be a place of meaningful intervention.</p>\n<p>I think it goes without saying that domestic violence is a worthwhile thing to do a talk about, but just in case you need convincing, here are some stats:</p>\n<ul>\n<li>1 in 3 American women will experience severe physical abuse at the hands of an intimate partner.</li>\n<li>For men, that number is 1 in 4. Domestic violence is not an edge case.</li>\n<li>The number one cause of death among pregnant women in America is murder by her current or ex intimate partner.</li>\n<li>3 women are murdered by their current or ex intimate partners in America each week.</li>\n</ul>\n<p>These are real people who are being controlled, beaten, and murdered - and we in tech have a role to play in preventing it from happening.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I don’t see myself as a “public speaker” - I really just want to spread the content of my talk because I think it’s really important.</p>\n<p>But I’ve learned a few things: <strong>first, as someone who gets a lot of stage fright, the only thing that helps is just doing it a bunch.</strong> After 4 or 5 times talking a stage, it started to get a lot easier. After doing it a bunch and not dying, you start to realize it’s going to be ok. That’s the advice I give people who ask about speaking even though they’re not a natural public speaker - you have to just do it, but then it quickly gets a lot easier.</p>\n<p><strong>The second thing I like about speaking at conferences is that I also get to attend them!</strong> I think I’ve grown in my career more rapidly than average in part because of attending half a dozen conferences in the past few months and learning a ton. My advice is to focus on applying to conferences you’d actually want to attend, so that they’re also a learning experience for you. I can only do so many conferences in a year, so I figure I might as well prioritize speaking at ones I also want to attend.</p>\n<p><strong>The third thing I like is that speaking at conferences unexpectedly helped with my social anxiety a lot.</strong> I’m introverted and socially anxious, but so many days of having strangers come up and talk to me about my talk, and share their experiences with violence, was the intense exposure I needed to start to get past my social anxiety. Within 6 months, I’ve become so much more confident talking to strangers and being in new situations that would have induced a lot of anxiety in the past - all thanks to conference speaking. I really want people to know that you can be introverted, awkward, and socially anxious, and still be a great conference speaker and get a ton of benefit from doing it.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>7 so far, with a few more confirmed for the fall - include StrangeLoop, which I almost didn’t apply to because it seemed like such a long shot! I’ve applied to about 40, and gotten 10 rejections, with the other 23 still up in the air.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/WhWPnKg4oK4' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Eva PenzeyMoog: Designing Against Domestic Violence</em></p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>Deep breathing! And lots of practice, to the point that you don’t need to rely on speaker notes. It makes such a difference.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>Two things:</p>\n<p><strong>You do NOT need to have the talk written before you write a proposal for that talk to apply to conferences with, and you do NOT need to already be an expert in the field that you’re proposing a talk about.</strong></p>\n<p>Feeling like you need to know and do so many things before even applying to something you might get rejected from is a surefire way to get overwhelmed and never start. Choose something you’re legitimately interested in and would want to become an expert in, write the proposal and apply to as many conferences as possible. Once you get accepted to one, then create the talk and learn all about it. You don’t need to present the answers in your proposal. I wish someone had spelled this out for me earlier on - I would have started applying with this talk a lot sooner!</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p><a href=\"https://twitter.com/sara_ann_marie\">Sara Wachter-Boettcher</a> is a huge inspiration. She keeps it real - she’ll call out the chatbot you’re using at your conference for defaulting to a woman’s name, and point out all the ways Facebook is terrible when a table full of Facebook designers is right in front of her. I really value that, and before her, had seen plenty of men behave that way, but no women. She’s not afraid to hold people accountable, but doesn’t make it personal. She strikes a perfect balance, and getting to see her speak and attend one of her workshops was incredibly valuable to see as I’m working on developing my own speaking style. I was lucky enough to randomly be seated with her at a shared table at a restaurant we were both at after I saw her talk at a conference, and got to ask her all my questions and get amazing advice. I think that was the moment I started to feel like the universe really wants me to do this work. Serendipitous things like that keep happening. And I’m trying to pay it forward - I’m all about getting more women and other underrepresented voices into the conference speaking circuit.</p>\n<h3>Where can readers find more about you?</h3>\n<p>My website is <a href=\"https://evapenzeymoog.com/\">evapenzeymoog.com</a> and my Twitter handle is <a href=\"https://twitter.com/epenzeymoog\">@epenzeymoog</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Eva PenzeyMoog, Designer Helping Stamp Out Domestic Abuse","path":"/blog/speakers-eva-penzeymoog/","category":"Speaker's Story","tags":null,"date":"2019/07/26","image":null}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>I love reading stories about speakers who went from sweaty, nervous messes to confident, capable speakers, and Rizwan’s is one such story. Of course,\ntransformations like this don’t happen overnight, so don’t worry if speaking takes time and doesn’t come naturally to you. As Rizwan shows,\nsticking with it, and improving over time can help anyone get on stage.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/PZhgAIc.jpg\" class=\"right\">\n<p>I started my career as a UX designer at a design agency. <strong>Being an introvert, I was very uncomfortable speaking in meetings and used to literally run away from having the spotlight on me.</strong> I even had a hard time speaking in front of my own team. Each time I stood up to talk I would get the classic symptoms such as dry mouth, profuse sweating, and forgetting what I wanted to say. It was frustrating because I noticed others who would get up and speak effortlessly and I wanted that for myself. I wanted to be able to get up and speak without hesitation and share my ideas.</p>\n<p>It was time to act.</p>\n<p>So I decided to turn things around and searched for ways to improve my public speaking skills. My search led me to a 30-day online speaking challenge which focused on specific areas in public speaking such as speed, filler words, pacing, etc. The last exercise of the challenge was to create a presentation of my own and record myself presenting it. At that time I was also diving into the world of sketching so I created a 5-minute talk about sketching journey. To test out my presentation I needed real people to present it to so I searched for meetups and found a developer meetup which was looking for presenters for their next meetup. Their CFP page was very inviting towards new speakers which gave me the confidence to apply. I jumped on the chance and submitted my talk proposal and that’s when my public speaking journey began.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p><strong>For me, it’s all about the people. Whether it’s someone who connects with my message or another speaker who is just starting out, I love meeting new people and making friends at conferences.</strong></p>\n<p>Speaking at conferences has definitely helped to improve my presentation skills. I am more confident in speaking in front of groups of people who I don’t know whereas before I would get nervous and my anxiety levels would go through the roof.</p>\n<p>Another benefit of speaking at conferences is that each conference brings its own challenges such as room layouts, the acoustics of rooms, the size of the audience, the distance to the audience, lighting, etc. these all present challenges that help us grow.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I remember my first conference talk very clearly because it was started out a bit rough. I was really nervous before the event because I didn’t know anyone in the sea of people. The layout of the room I was presenting it was a bit challenging. There was a big column right in the middle of the room which divided the audience into two sides. The windows were from floor to ceiling which sounds nice but made it extremely difficult to see my slides. We had to turn off the lights to be able to see them so I presented my talk in the dark, talk about throwing you off your game. As I began my presentation I noticed the people in the audience with their expressionless stares which made me think I was boring them. This started the negative self-talk in my head while I was presenting which never turns out well and it caused me to read my slides instead of looking at the audience. Towards the end, I felt much better and more in control of my talk. After the event, I felt a bit disheartened but I was determined to learn from the events of the day and improve for the next time.</p>\n<p>Each new talk presents challenges and opportunities to learn from and to help us grow. I am still learning from my “mis-takes” and addressing the areas I need to improve in. It’s important to keep in mind that public speaking is a continuous learning process. Never stop learning.</p>\n<img src=\"https://i.imgur.com/REn0gvq.jpg\" class=\"center\">\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Honestly, I haven’t kept count but I know I have applied to many conferences. My CFP rejected-to-win ratio is probably around 0.00001 which is definitely an exercise in learning how to accept rejection and not take it personally.</p>\n<p>I have presented at 6 conferences in the US and in Europe. My talk recently was accepted at a conference in Oslo which improves the ratio just a little bit.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>A week before my talk, my routine consists of getting a fresh haircut and picking out the outfit I will wear. I also make sure I have all the dongles, adapters, cables, remotes I need.</p>\n<p>On the day of the talk, I make sure I have a good breakfast and pack a few snacks just in case I get hungry before the talk.</p>\n<p>If I am speaking at a conference, I make sure to scope out the room I will be presenting in beforehand to check out the stage and seating arrangements. This way I can visualize myself up on the stage presenting beforehand, which help me feel prepared.</p>\n<p>Right before giving my talk I will do some breathing exercises, and if I really need to get pumped up then I will find stairs nearby and go up and down them quickly to warm up and get my blood flowing.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p><strong>I recommend new speakers look for opportunities to present at work, meetups, schools, basically anywhere they can.</strong> At work, you can present at a Lunch and Learn session. Don’t have a Lunch and Learn session at work? Why not start one? This will give you the opportunity to present regularly and get more practice. Meetup organizers are always looking for new people to present and share their ideas. You can also start off with Lightning Talks which are short 5-minute presentations on any topic you want and are a great entry point to start your public speaking journey.</p>\n<p>Another tip I like to share is to make your talk interactive. <strong>Find ways to get your audience engaged with your message through exercises, questions, or discussions.</strong> Getting the audience involved will help them connect with your message on a deeper level and when the audience is engaged I notice that I relax more and become less anxious since.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>Inspiration is everywhere. Whether it’s a team member presenting at work, a speaker at a conference, or kids presenting at an elementary school, I find inspiration by observing people and how they communicate. I have presented my talks at elementary schools and I’m especially inspired by the confidence kids have in standing up and sharing their ideas without hesitation which is something I am working towards.</p>\n<h3>Where can readers find more about you?</h3>\n<p>A good thing about having a somewhat unique name is that if you Google Rizwan Javaid, I will show up. Not personally, that would be creepy but the search results will be mostly about me. You can also follow my updates on my website, <a href=\"https://rizwanjavaid.com/\">rizwanjavaid.com</a>, <a href=\"https://www.linkedin.com/in/rizwanjavaid/\">LinkedIn</a>, <a href=\"https://www.instagram.com/rizwanjavaid/\">Instagram</a>, <a href=\"https://twitter.com/rizwanjavaid\">Twitter</a>, and <a href=\"https://medium.com/@rizwanjavaid\">Medium</a>.</p>\n<p>My next conference workshop is at <a href=\"https://2019.javazone.no/\">JavaZone</a> in Oslo in September. I also present at meetups around the San Francisco Bay Area. Reach out if you are ever want to chat about sketching, design, life over some coffee.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Rizwan Javaid, From Introvert to International Conference Speaker","path":"/blog/speakers-rizwan-javaid/","category":"Speaker's Story","tags":null,"date":"2019/07/20","image":"https://i.imgur.com/REn0gvq.jpg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Like many speakers I’ve interviewed, Mike Miles understands that working in technology is about much more than just writing\ncode. While he has done plenty of that, Mike started speaking to raise his confidence and force himself to learn something new.\nNow, in addition to speaking at dozens of conferences, Mike hosts a podcast called Developing Up, which covers a wide range of\nnon-technical topics for software developers. We spoke about some of the <a href=\"https://www.developingup.com/episodes/43\">advantages of public speaking</a>\nfor your career on the show, but in this interview, Mike goes into some of his tips and the opportunities that speaking\nhas afforded him as well.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p>Since 2009 I have worked at <a href=\"https://www.wearegenuine.com/\">Genuine, a full service digital agency headquartered in Boston MA, USA</a>. My current role is V.P. of Development, which entails leading the development department and the individuals in it. My day ranges anywhere from meeting with clients, building project estimates to fixing bugs, building features or leading technical architecture for a client project.</p>\n<p>I first got into public speaking by presenting lightning talks at local technology meetups. I started by asking development questions, presenting about projects I was working on and demoing solutions I had built. <strong>As an introverted person I was nervous about getting in front of and speaking to a large group of people.</strong> I knew for myself and for progression in my career, public speaking was something I wanted to improve on.</p>\n<p>In 2013 I started submitting talks to conferences and forced myself into the deep-end.</p>\n<img src=\"https://i.imgur.com/LLmOZiu.jpg\" class=\"center\">\n<h3>What do you like about speaking at conferences?</h3>\n<p><strong>Submitting talks is a great excuse to learn something new.</strong> When I submit a talk proposal it’s usually on a topic that I am not an expert on, but one that I am interested in learning more about. I then have a motivator to deep dive into the topic to learn about it. This has the challenge of learning enough about a topic to be able to present it in a way that others can understand.</p>\n<p>For technical talks in particular, this means being able to break down the subject into basic terms and concepts. This practice has come in very helpful for my career and day job interacting with clients. Being able to explain technical issues or aspects of your project in simple ways is very helpful for improving communication abilities.</p>\n<p>More self-serving is the added benefit of being able to travel to different locations around the world to present talks. Most technical conferences will cover the ticket cost (and sometimes airfare and lodging) for speakers. This affords me the opportunity to visit places I may not be able to on my own and get introduced to new communities of people. The benefit to my career from this is that I’m able to grow my professional network. As well as, I have opportunities to listen to a large range of talks by other great speakers.</p>\n<p>Finally there is the benefit of building up my self confidence. <strong>The more I present the more confident I become in my abilities to do so.</strong> This has helped with my social anxiety and with my ability to interact with clients or potential clients. Thanks to my years of public speaking I am now not afraid to join in on conversations with little or no preparations and be confident in what I am going to say.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first conference talk was in June 2013 at the conference Design 4 Drupal, hosted at MIT in Cambridge MA. I co-presented with a co-worker on responsive design in a talk titled “Bumps in the Road to Responsive”.</p>\n<p>As it was my first time speaking in front of a large group, I remember being very nervous about it. To prepare for the talk my co-presenter and I printed out scripts of exactly what we were going to say. Then we practiced many, many times, all the way up until the hour before our scheduled time slot. I do not remember much about presenting (it was all a blur), but we made it through it. People stayed through the whole thing and we had many follow up hallway conversations - which means attendees took away something helpful.</p>\n<p>My second time presenting and first time presenting solo, was in <a href=\"https://www.youtube.com/watch?v=O-RQxA4JH6w\">April 2014 at a conference hosted at the UN building in New York City</a>. Again, I was very nervous about presenting and spent weeks rehearsing my talk. I had moved away from printing out a script and relied on having practiced my talk. That did not help my nerves and I remember hyperventilating, and my hands shaking. Yet I managed to get through it and covered all the points I wanted to talk about. I even managed to throw in a few (bad) jokes in my talk. At the end, I was very proud of what I accomplished and how I managed to present on my topic.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/O-RQxA4JH6w' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Mike Miles, “To Patch Contrib or Write a Custom Module”</em></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Since 2013, I have applied to 40 different conferences a majority of which have been tech focused. Of those 40 I have spoken at 34 conferences, presenting 38 talks on 9 different subjects. This has given me a chance to present at conference in 4 different countries (US, Canada, Iceland &#x26; Germany). On average I build about 1 - 2 new technical topics a year, and present each at 5 - 6 different conferences.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>After every presentation I take time reflect on how well I did and think of ways I can improve my process. This has lead to an evolution of a pre-talk routine that works for me.</p>\n<p>My current routine starts with preparing my mind, about a week before I am due to give my talk. <strong>I start by booking a conference room in my office for an hour each workday morning. I use this time to practice my session out loud.</strong></p>\n<p>Yes, I present my talk to a brick wall and yes it looks and feels awkward, but that is the point.</p>\n<p>I practice the way I’ll present the talk to work out the quirks and get the flow correct. By the time I’ve spent a week doing this, presenting my talk becomes muscle memory. I then do not have to worry about what I’m going to say and can instead focus on how I’m saying it. This allows me to react to any audience questions and manage my allotted time. This is the most important part of my pre-talk of my routine. After this time I DO NOT edit my presentation, doing so would only throw everything off.</p>\n<p>The day before and day of my talk I prepare my body. <strong>I start by making sure to get to bed at a respectable time and get a full night’s rest.</strong></p>\n<p>The morning of I have a good breakfast and if possible practice one last time. The hardest part of this phase is that I do not drink any coffee or caffeine leading up to my talk. <strong>I have found that since I still get nervous any caffeine over activates my nerves and leads to me speaking quickly and being shaky during my talk.</strong> I also use the day before / morning of to prepare backups of my presentation. I create a PDF version (that I can then share with the audience), back up to a cloud service, create a short link and if possible place it on a USB device. This way if anything catastrophic happens to my laptop or the internet goes down, I can still give my talk.</p>\n<p>The hour before my talk I spend clearing my mind. I’ll take a break from the conference I’m at, take a small walk and focus my mind on nothing. This time gives me a chance to calm down and relax. Fifteen minutes before my talk I find the room I’ll be presenting in (if I have not already done so) and sit in on the talk currently being given (if there is one).</p>\n<p>Then it’s time for me to get on stage, hook up my laptop and start talking!</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>First, <strong>you do not have to be an expert to present on a technical topic.</strong> Build a presentation around an interest. You do not have to be a subject matter expert and building a talk is a great motivator to learn something new.</p>\n<p>Second, <strong>practice, practice, practice and practice out loud!</strong> You will not get a feel for your talk by practicing it “in your head”. Practice the way you present your talk. Standing up, hooked up to a monitor and not facing your slides. This allows you to build a muscle memory around what and how you are going to present.</p>\n<p>Third, when possible <strong>practice your talk in front of a trusted friend or family.</strong> Ideally someone who is not knowledgeable of the material. They will catch things about your presentation that you are not aware of and give you helpful feedback on the story you are telling. I cannot tell you the number of spelling and grammar mistakes my wife has found in my presentations.</p>\n<p>Fourth, <strong>do not be the person that edits your presentation hours/minutes leading up to your talk.</strong> Doing so means you are going to have to figure out what you want say while presenting. Losing the message / lesson you want to convey to your audience.</p>\n<p>Number five is <strong>do not be afraid to submit your talk to many conferences.</strong> You do not need to build a new talk for every CFP and the information you’ve built will be beneficial for many audiences. Plus the more times you give your talk the better you will become at it.</p>\n<p>Finally, number six, <strong>mistakes will happen and when they do move on.</strong> I’ve seen some technical talks derailed because the presenter spent too long trying to get a code example to work, or wait for a file to load due to a bad internet connection. If something is not going correct, move on to the next part of your talk, your audience will thank you.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>There are two speakers who I have looked up to and have inspired my career as a technical speaker. The first is <a href=\"https://twitter.com/Crell\">Larry Garfield</a>. Larry outlined the methods he’s used to build technical talks and his guidelines. These have helped me numerous times to build session proposals that have been accepted by conferences. <a href=\"https://www.garfieldtech.com/blog/3-paragraph-pitch\">You can read Larry’s guidelines here</a>.</p>\n<p>The second speaker is <a href=\"https://twitter.com/eaton\">Jeff Eaton</a>. Every time I have seen Jeff present, it is with enthusiasm and passion for what he is presenting on. As an attendee at one of his talks you feel this in the way he presents and you walk away feeling empowered (at least this has been my experience). The way Jeff Eaton presents is something I have striven to replicate in my own presentation style.</p>\n<h3>Where can readers find more about you?</h3>\n<p>Interested readers can find out more about me in a number of different ways:</p>\n<ul>\n<li>They can hear my voice monthly as the <a href=\"https://www.developingup.com\">host of the Developing Up podcast</a> - a podcast that is focused on the non-technical side of being a developer and growing a career in development.</li>\n<li>I can be found on Twitter at <a href=\"https://twitter.com/devuppodcast\">@devuppodcast</a> and <a href=\"https://twitter.com/mikemiles86\">@mikemiles86</a>.</li>\n<li>All of my previous technical talks and upcoming speaking engagements can be found on my website at <a href=\"http://www.mike-miles.com\">www.mike-miles.com</a>.</li>\n<li>And I’m always happy to connect on LinkedIn at <a href=\"https://www.linkedin.com/in/mikemiles86/\">linkedin.com/in/mikemiles86/</a>.</li>\n</ul>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Mike Miles, Podcaster Focused on the Nontechnical Side of Technology","path":"/blog/speakers-mike-miles/","category":"Speaker's Story","tags":null,"date":"2019/07/16","image":"https://i.imgur.com/LLmOZiu.jpg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>While Bailey has been practicing public speaking her whole life, she was drawn to speak at tech conferences after seeing so many design and development teams struggle to put their message online. One thing I love about speaking is getting to attend conferences and hear other talks - especially from subject-matter experts who are truly passionate about their craft. Bailey is one of those passionate people, and I’m excited to bring you her story here today.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p>I’m director of content strategy at usability consulting firm <a href=\"https://truematter.com/\">truematter</a> out of Columbia, South Carolina. I’m a user experience content strategist which means I plan, organize, and write the words people use to interact with websites, applications, and software products. I’ve been involved in public speaking throughout my life, especially when I was younger.</p>\n<p>Recently, I felt a call to pick it up again for many reasons but one in particular: design and development teams must change their approach to words online. Many, many organizations (including those that should know better) still write their online content the same way they would for traditional media. That approach drags down their product’s user experience, makes it harder for customers to engage with them online, and has a large negative impact on the success of their digital products. I set out to speak out about this widespread problem and how we should fix it.</p>\n<img src=\"https://i.imgur.com/l6UnYFz.jpg\" class=\"center\">\n<h3>What do you like about speaking at conferences?</h3>\n<p>I’m still pretty new on the conference scene but even so, <strong>I’ve already made a lot of connections with both people in my field and those outside of it.</strong> I think it’s a lot easier to meet people when you’re the one giving the presentation because 1) people already know a topic they can discuss with you which cuts out a lot of networking small talk and 2) people come up to you instead of you having to approach them every time – a real plus for an introvert like me.</p>\n<p>Also, I’ve found so far speaking is a great way to visit new places – I often take a couple of days before or after to explore the area outside of the conference hotel.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>It went well! I think I was surprised when I found out that people do actually care a great deal about their digital content and want to know how to make it better and more usable. The audience had a ton of questions, which was great. The whole thing is kind of addicting. You experience it once and think, “I want to do that again.”</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve spoken at about ten events so far with another four or five already scheduled for later this year.</p>\n<p>I’ve applied to a lot more than that for sure. I probably send out three applications a month and that number has been growing lately. But <strong>the more I apply and the more I speak, the more conferences are approaching me instead of the other way around and that’s a really nice feeling.</strong></p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/ATVKZdl_pEw?start=130' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Bailey Lewis at OKC Design Tech</em></p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I always try to see the space before I speak in it. That could mean swinging by the room before my presentation or trying to find a video of a presentation someone else gave in that room online. Seeing the space before my presentation lets me decide where to stand and helps me understand how the audience will be looking at my slides (one big screen? multiple screens around the room? etc).</p>\n<p>Other than that, <strong>I take a deep breath and remind myself: The audience came to see me present on this topic.</strong> They want it to go well as much as I do. And that’s a lot more helpful than imagining them in their underwear.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>If you’re brand new, it might be hard to find speaking gigs that will cover your travel and accommodations. The conference might even ask you to pay to attend even though you’re speaking (not my favorite practice but there you have it).</p>\n<p>Take a few of these gigs if you need to so you can get started and get your name out there, but as soon as someone offers to cover your travel/accommodations, demand it every time you speak afterward. Even better if you can throw a speaker stipend into the mix. That will probably mean saying no to conferences you’d really like to speak at, which can be painful. But once you reach certain level in your speaking career, you shouldn’t be digging in your own pockets when you’re the one providing the presentation content that will sell conference tickets and make the event successful.</p>\n<p>By the way, <strong>I love that CFP Land lists which “perks” each conference offers (travel/hotel/stipend), if any. It means I don’t have to get all the way to have my paper accepted just to realize that I’m expected to fork over a couple of grand for the privilege of presenting.</strong></p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I’m not sure about specific conference speakers (although there are presentations I’ve really enjoyed), but my father is a trial attorney and, among other speaking-related lessons, he taught me the art of giving a presentation without swaying or fidgeting. He would record me giving a presentation and then have me watch it back – it was extremely effective for getting rid of the fidgets.</p>\n<h3>Where can readers find more about you?</h3>\n<p>Find me at <a href=\"https://truematter.com/baileylewis\">truematter.com/baileylewis</a>. You can see my speaking schedule, bio, and articles I’ve written about usability and content strategy.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Bailey Lewis, User Experience Strategist","path":"/blog/speakers-bailey-lewis/","category":"Speaker's Story","tags":null,"date":"2019/07/10","image":"https://i.imgur.com/l6UnYFz.jpg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Like many technology professionals, Gant Laborde didn’t instantly take to speaking. It took time, hard work, and lots of practice for Gant to get comfortable in front of a crowd, but fortunately he stuck with it. He’s now spoken at over 50 conferences, and made himself an integral part of the tech conference community. Keep reading to learn more about how Gant got started, what he recommends for new speakers, and some of the influencers that inspired him to continue his journey.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/fXaa5bp.png\" class=\"right\">\n<p>When I was in college, I was paralyzed by the fear of public speaking. Just the thought of talking in front of a small class would cause cold-sweats. Fortunately, I was studying for a career in Comp Sci. which usually doesn’t require much public speaking.</p>\n<p>Once my career began, I was reaffirmed, no one wants to hear a developer speak. That was fine for a few years, and then new nagging energy began. People can’t listen if you don’t speak. Quietly interjecting important points without ever taking the lead of a conversation is less effective than not speaking at all. It was time to start breaking out of my shell.</p>\n<p><strong>Though I was uncomfortable, I started speaking up more and more.</strong> I attended conferences, and I marveled at speakers. I was amazed, but sure I would never be on the other side of the 4th wall.</p>\n<p>Fortunately, I joined Toastmasters, met cooler people, and with a lot of time and energy, now people can’t shut me up. It’s always a pleasure to help my fellow speakers and aspiring speakers. The journey wasn’t comfortable, but it’s doable. Now <a href=\"http://gantlaborde.com/\">you can see I’ve been speaking actively for years</a>.</p>\n<p>I’m very fortunate that I work for the great people at <a href=\"https://infinite.red/\">Infinite Red</a> who have supported me from lightning talk to keynote speaker.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p><strong>The best thing about speaking at conferences is the networking and connection. I’ve made friends around the world.</strong> This has, directly AND indirectly, benefited my career and employer. It’s not required in my job description, but it’s valuable to everyone involved.</p>\n<p>There’s something impressive about going to a city for the first time, and have people walk up and introduce themselves to me, mentioning past talks or blog posts. I’m still an introvert, but it doesn’t matter who you are, something like that feels great. The community and positivity of it all is superb!</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>After a lot of Toastmasters, and speaking at a local meetup, my first “conference” talk was a lightning slot at RubyConf 2013.</p>\n<p>How’d it go? Well, my heart was beating through my chest. But I gave a 30-minute presentation in 5 minutes after getting over my fear of public speaking, so there was no way to fail :)</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/gJOkpP__dY4?start=4829' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Gant Laborde at RubyConf, 2013</em></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>50+ and no stopping in sight!</p>\n<img src=\"https://i.imgur.com/XfgC3IW.png\" class=\"center\">\n<h3>Do you have a pre-talk routine?</h3>\n<p>Some <a href=\"https://twitter.com/GantLaborde/status/1107007420763639808\">general rules for sure</a>:</p>\n<ol>\n<li>No dairy</li>\n<li><a href=\"https://www.ted.com/talks/amy_cuddy_your_body_language_shapes_who_you_are\">Power Pose</a></li>\n<li>Think more about your audience than yourself</li>\n<li>Realize the audience wants you to succeed, and they can’t see that you’re nervous unless you tell them.</li>\n<li>They will feel what you feel. So 😃 (smile)</li>\n</ol>\n<h3>What advice do you have for new speakers?</h3>\n<p>You’re not done and you’re not stuck. <strong>For a lot of people, level 1 was just speaking. Then it’s to speak well. Then it’s to fill a room, then get invited to speak, then keynote.</strong> The best speakers are people who have been leveling up for 20+ years, and they support and promote speakers who are just getting started. It’s not a zero-sum game, ask for help, get feedback, and improve. Then repeat. The best speakers aren’t born speakers.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I LOVE TED TALKS! <a href=\"https://medium.com/@gantlaborde/5-ted-talks-that-changed-me-4aa0cec43d79\">Here’s 5 that have made me recontextualize life</a>.</p>\n<p>As for Tech, I’d say <a href=\"https://twitter.com/jevakallio\">Jani Evakallio</a> has been amazing every talk I see. His experience (not talk, but experience) <a href=\"https://www.youtube.com/watch?v=mVcMAtaAwsA\">at RNEU was terrific for everyone in the audience</a>.</p>\n<p>Also, if you haven’t seen Charlie Chaplin’s speech in <em>The Great Dictator</em>, <a href=\"https://www.youtube.com/watch?v=w8HdOHrc3OQ\">prepare to have your mind blown</a>.</p>\n<h3>Where can readers find more about you?</h3>\n<p>All my upcoming talks are available <a href=\"http://gantlaborde.com/\">on my site</a>.</p>\n<p><a href=\"https://twitter.com/GantLaborde\">Follow me on Twitter</a> where semi-smart memes happen.</p>\n<p>And <a href=\"https://medium.com/@gantlaborde\">here’s my Medium</a>, where I can’t seem to shut up.</p>\n<p>Most importantly, say “hi” if I’m ever at a conference and you’re there.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Gant Laborde, Technology Team Leader, Speaker and Author","path":"/blog/speakers-story-gant-laborde/","category":"Speaker's Story","tags":null,"date":"2019/07/06","image":"https://i.imgur.com/fXaa5bp.jpg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Tejas Kumar has dealt with haemophilia his whole life, but despite his disease preventing him from completing a traditional computer science education, he’s used his self-taught knowledge and communication skills to achieve success as a developer. Now, as a tech conference speaker, he’s giving back to other developers by passing on what he knows. Looking through Tejas’ social profiles, you’ll see that he doesn’t take himself too seriously, but his informal, casual tone is part of what makes him a unique and interesting speaker.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p>I’m Tejas. I love people and code and the conversations we have together. I’ve been a public speaker since a young age. I grew up with a fatal sickness (that I still have) where I couldn’t do much and I often felt like I’d never amount to much, so in some ways, I guess I’ve been drawn to public speaking to overcompensate. ¯\\_(ツ)_/¯</p>\n<img src=\"https://i.imgur.com/MdV43uT.png\" class=\"center\">\n<h3>What do you like about speaking at conferences?</h3>\n<p>I like encouraging the community. I often learn things and I enjoy disseminating the information from stages and then having conversations about it later. <strong>Truth be told, I enjoy the private conversations that happen after a good talk <em>a lot</em>.</strong></p>\n<p>While it has directly benefited my career with a number of job offers, visibility, Twitter followers, all kinds of glitz and glam, the real value I see from this type of engagement is the love. I get to share hope with people, combat impostor syndrome, and see careers flourish; life change from a stage. It’s all very encouraging.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I remember doing a TEDx talk like 7 years ago. It was really well received. I think there was even a standing ovation. It was fun. 🙂</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/TUIcTl9Hto4' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Tejas presenting “Papercuts Can Kill” at TEDx</em></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I think I’ve applied to like 20 and spoken at like 9? It’s a gut feeling though. I have no real idea.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p><strong>I often put myself into the mindset of “I’ve won” already before I even play.</strong> This gives me hope and like prepares me to do an amazing job. Eventually, it somehow becomes a self-fulfilling prophecy. Odd, maybe, but it works for me every time.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>You’d be surprised by how much value you can add with a talk. Our tech industry today is so full of <a href=\"https://twitter.com/TejasKumar_/status/1126096390281732097\">faux confidence and pretend knowledge</a> that one would often feel like they don’t know enough – I know I feel this way most of the time. The truth is, I actually know quite a bit <em>in my own, very specific area</em> that I can use to educate and help others who aren’t as familiar with it.</p>\n<p><strong>I’m often insecure about kubernetes, data structures and algorithms, and CS fundamentals because I personally was always too sick to get a Computer Science degree. I don’t have one. I am a prime example of impostor syndrome.</strong></p>\n<p>That said, I feel there are just as many people insecure about React, TypeScript, CSS and other areas. I rejoice at the idea of combating their impostor syndrome with my experience in these subjects. For me, this is part of the joy of public speaking along these themes.</p>\n<p>I’ve always been extremely uncomfortable with my <em>content</em> not being technical enough because I often feel like I lack technical skill, but I’ve always been confident with the delivery because it seems to come naturally to me for whatever reason. As a result, I am trying to better my technical abilities to “close the loop”.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I’ve been inspired by a lot of speakers, inside and outside of tech circles. I especially appreciate <a href=\"https://twitter.com/mweststrate\">Michel Weststrate</a> and <a href=\"https://twitter.com/LeaVerou\">Lea Verou</a>’s speaking styles as well as <a href=\"https://twitter.com/sarah_edo\">Sarah Drasner</a> and <a href=\"https://twitter.com/darcar31\">Daria Caraway</a>.</p>\n<h3>Where can readers find more about you?</h3>\n<p>I’m most active on twitter under <a href=\"https://twitter.com/tejaskumar_\">@tejaskumar_</a>. I also have a website where people can learn to code and/or troll me depending on their mood at <a href=\"https://tejaskumar.com/\">tejaskumar.com</a>.</p>\n<p>My next talk is not yet announced, but one talk coming up is at JSConf Budapest about the performance of various UI frameworks in serverless architectures.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Tejas Kumar, Lifelong Speaker and Frontend Development Lead","path":"/blog/speakers-story-tejas-kumar/","category":"Speaker's Story","tags":null,"date":"2019/06/29","image":"https://i.imgur.com/MdV43uT.png"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>I was fortunate enough to meet Matt in real life at Midwest PHP, 2019 as he was giving one of the keynotes there. I think our first conversation was awkward nods in the hotel gym way too early before the conference, but once that was over, we got to talk throughout the conference.</p>\n<p>In addition to speaking, Matt is an active open source maintainer, and has been giving back to the PHP community in various ways for the past several years. He also speaks on behalf of <a href=\"https://osmihelp.org/\">OSMI</a> - a great organization that helps raise awareness of mental health issues in the tech community - so I’m excited to present his journey into speaking and tips for those who are new to it.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/YjtivW4.jpg\" class=\"right\">\n<p>During the day I’m a senior software engineer at a company called MoreCommerce where we do small and medium-sized business e-commerce and market place offerings. Outside of that, I help maintain various API related OSS projects like Fractal, openapi.tools, standards.rest and a few others. I spend most of my free time doing photography or cycling.</p>\n<p>As for speaking, I got my start at my old PHP user group in Atlanta. I started with a lightning talk and moved up to a full-length talk before breaking into a conference. Im usually pretty shy and quiet, so it was weird at first but it been a lot of fun.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>One of my favorite things about speaking is <strong>it’s an excuse to learn and play with new technology</strong>. I wouldn’t have become passionate about the OpenAPI spec if a conference hadn’t given me a chance to speak on it for example. And because my day job tends to focus more on boring tech that works, <strong>giving conference talks lets me experiment with stuff I know we wouldn’t touch at work.</strong></p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>It feels so long ago, but my first talk was at a now-defunct conference called “Great Wide Open”. I submitted a talk essentially about why community is awesome and how it can help someone learn. Since it was my first talk I was incredibly nervous but somehow I pulled it off. I got good feedback for it, and felt like I could have massaged it a bit into a more full talk.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>This year I will have spoken at 5, including 2 (maybe 3) keynotes. That’s the most I’ve ever done. Last year I spoke at one conference.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p><strong>I usually put on some music, like Run The Jewels and just zone out.</strong> I tend not to sit in a talk before my slot so I can keep my thoughts going. Everyone is different, what works for me doesn’t mean it’ll work for someone else. I know some speakers will hide in their hotel room up until their talk, others just talk and socialize like its nothing. I’m also bad in that I will still be doing slides up until my talk. I should fix that.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>For your first talk, <strong>pick a topic you are passionate about but also already knowledgable about.</strong> Don’t experiment on new topics until you start getting accepted to speak. No need to add pressure on top of everything else.</p>\n<p>When you submit your CFP, check your spelling and grammar. It’s amazing how many people overlook it.</p>\n<p>Another thing is <strong>don’t immediately submit your abstract. Write it, and then talk a walk, get away from it, and come back after an hour and see how you feel about it. You may see things you can do better.</strong></p>\n<p>Finally, submit multiple submissions, it gives you better odds. When we organized <a href=\"https://twitter.com/southeastphp\">Southeast PHP</a>, people with multiple submissions had a better shot getting into our post-apocalyptic Thunderdome over someone who only gave us one thing to choose.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I’m pretty short so I look up to pretty much everyone.</p>\n<ul>\n<li>Jenna Quindica</li>\n<li>Josh Holmes</li>\n<li>Kat Zień</li>\n<li>Phil Sturgeon</li>\n<li>Ben Edmunds</li>\n<li>Cal Evans</li>\n<li>Ed Finkler</li>\n<li>Alena Holigan</li>\n<li>Sammy Kaye Powers</li>\n<li>Ian Coldwater</li>\n<li>Olivia Liddell</li>\n<li>Nic Steenhout</li>\n</ul>\n<p>And so many more I can’t remember because I cycled 24 miles tonight so I’m tired.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/QRYimzIWS84' frameborder='0' allowfullscreen></iframe></div>\n<p><em>API Pain Points by Phil Sturgeon</em></p>\n<h3>Where can readers find more about you?</h3>\n<p>I blog occasionally at <a href=\"https://matthewtrask.net/\">matthewtrask.net</a> and post silly things like pictures of my dog at <a href=\"https://twitter.com/matthewtrask\">@matthewtrask</a> on twitter.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Matthew Trask, Open Source Maintainer, Cyclist, and Speaker","path":"/blog/speakers-story-matthew-trask/","category":"Speaker's Story","tags":null,"date":"2019/06/26","image":"https://i.imgur.com/YjtivW4.jpg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>I find the most interesting people are those who are passionate and devoted to a cause. Drishti is both of those things. Besides being a computer engineer and speaker, Drishti runs a non-profit in India that has already impacted 10 cities, and gotten Drishti attention in her state.</p>\n<p>While this would be impressive enough, Drishti also uses her talent for public speaking to inspire and help others learn more about technology - something that many speakers can likely identify with. I’m thrilled to bring you Drishti’s story today, and hope it inspires you to get out and do some good in the world!</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/w36pjbN.jpg?1\" class=\"left\">\n<p>Hi, I am Drishti Jain a Computer Engineer at heart and a technology enthusiast. I love to use technology to help the less fortunate. I am a social entrepreneur. I am the Co-founder and President of the non-profit organisation <a href=\"https://www.facebook.com/samyakdrishtifoundation\">Samyak Drishti Foundation</a> which works in environment, education and healthcare sectors in 10 cities across India. I have been titled <a href=\"https://www.instagram.com/theoptimistcitizen/p/BdT0mVJnMhU/\">Eco-Warrior thrice by the Government of Maharashtra, India</a>.</p>\n<p>I have been a good orator since a young age. I got into public speaking at school in grade 4; when I had to give a speech on Mahatma Gandhi Jayanti (for his birth anniversary). Ever since, I’ve loved the stage and sharing knowledge with all. Fun Fact: I also host music concerts sometimes :)</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I love speaking at conferences about things that I am passionate about. While I continue to learn new things and develop myself, I like to share my learning with others. Speaking at conferences, I am sharing with everyone about how cool a technology is or how I make the most of a feature. It gives me immense satisfaction to share my knowledge with all.</p>\n<p>I have learnt a lot speaking at conferences. I would like to share my secret weapon to effectively speaking in front large audiences.</p>\n<p><strong>My secret weapon – the 3 P paradigm: Pace, Pitch, Pause.</strong> These are three key parts of speaking effectively at conferences. Using this paradigm, I am able to more effectively deliver my knowledge.</p>\n<p>Moreover, speaking at conferences I am able to share my learning with all and give them a head start in the technology. I am believer of “Learning by sharing Knowledge” and speaking at conferences just fuels that!</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first conference talk was an exciting experience. Post deciding my topic (after a lot of brainstorming) I realized that I had just entered the long hiking trail of preparing my talk, yet to embark. There was a mountain of information I had gathered through research on the topic. And I had to create my talk in a way that I would cover maximum information and make it interesting. <strong>It all seemed overwhelming at first; but I decide to sit and create a summary of the information, that made it easy to prepare my talk.</strong></p>\n<p>On the day of the conference, I reached the venue early and checked if my laptop was compatible with the system; it was all ok and I was set to present my talk. Having reached early, I got comfortable with the environment and eagerly waited for my talk slot.</p>\n<p>I gave my talk and had a good Q and A for my talk; which gave me the assurance and satisfaction that I presented well and attendees were listening keenly.</p>\n<p>It was an amazing experience!</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Considering events, workshops, tech talks, conferences I have spoken at about 30-40; including a few virtual speaking engagements.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I attend the talk before my talk to set into the energy of the conference hall. <strong>I also do a demo practice with a friend to gain feedback.</strong></p>\n<p>I feel enthusiastic over nervous before my talk. I believe I have learned to convert my nervous energy into enthusiasm by practicing before my talk. I know it can be difficult due to packed schedules of the conference and work; but I do make sure to make time to practice. Sometimes I skim through my talk contents or rehearse the complete talk depending on the time I can make in my schedule.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>I will encourage new speakers to speak about what they are truly passionate about. <strong>When you speak about something that you are passionate about; you will actually be pretty excited to speak instead of being nervous. And your energy will be reflected when you present.</strong> It will boost your confidence and you will enjoy speaking!</p>\n<p>If you feel crunching everything you love about the topic into the 30/45 min talk is getting on to you, <strong>go outside and have fresh air. It will help you have a clear head and invoke creativity in your talk.</strong> It is very trivial to know the audience you will be presenting for. Most importantly remember to be yourself and be excited to share with the world what you like about the technology.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I got inspired by the talk by <a href=\"https://twitter.com/pranavmistry\">Pranav Mistry</a> on the Sixth-Sense technology. I liked how he presented the technology and included components in the talk that could be understood by someone new in the technology space. It has inspired me to include an overview of concepts related to my topic in the beginning of my talk for a couple of minutes, so that a participant novice to the topic understands the overall picture and doesn’t feel left out.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/YrtANPtnhyg' frameborder='0' allowfullscreen></iframe></div>\n<p><em>TEDIndia: The thrilling potential of SixthSense technology by Pranav Mistry</em></p>\n<h3>Where can readers find more about you?</h3>\n<p>I am active on Twitter at <a href=\"https://twitter.com/drishtijjain\">@drishtijjain</a>. I post about my speaking engagements, and new technology I’m learning there.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Drishti Jain, Social Entrepreneur and Technology Enthusiast","path":"/blog/speakers-story-drishti-jain/","category":"Speaker's Story","tags":null,"date":"2019/06/22","image":"https://i.imgur.com/w36pjbN.jpg?1"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Kara Luton’s path from ballerina to public relations to software engineer may be unusual, but with more software developers coming from non-traditional backgrounds, it’s not as surprising as it used to be. What’s impressive to me is how quickly Kara has embraced her new career and been able to help others by giving talks at conferences and meetups. As Kara points out in this week’s Speaker’s Story, speaking is a great way to bolster your career and encourage others in the field.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into tech and eventually public speaking?</h3>\n<img src=\"https://i.imgur.com/zFT1aBg.jpg\" class=\"right\">\n<p>I had a weird path to tech. I pursued a career as a professional ballerina for a long time. I even moved to New York City by myself at 17 to train full-time with the Joffrey Ballet School. I really loved ballet but I realized that I’d be lucky if I could make my career last until I was 30 due to all of the strain it puts on your body.</p>\n<p>That’s when I decided to take a break from ballet, move back to my hometown of Nashville, TN, and go to college. I majored in public relations with a music business minor and was one of the lucky few to land a job in the music industry after I graduated.</p>\n<p>I absolutely loved working as a music publicist. It was a very glamorous job but also a highly stressful one and I was getting burnt out pretty quickly. I knew I needed a change and started looking into other career paths when I stumbled upon <a href=\"https://www.codecademy.com/\">CodeCademy</a>. I really enjoyed the feeling of solving an error and decided that I wanted to make the leap to tech so I enrolled in The Iron Yard’s front end engineering bootcamp. Fast forward almost three years later and I’m still loving life in the tech world. I’m currently working as an engineer on the UX team at <a href=\"https://www.crowdstrike.com/\">CrowdStrike</a>.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>Speaking at conferences has definitely benefited my career. It’s allowed me to expand my network in ways that I’ve never imagined before!</p>\n<p>I got into conference speaking first by writing blog posts which eventually led to speaking at local meetups and then conferences. I like that by speaking at conferences I can help others learn. <strong>It’s really cool that the way I present something or specifically explain something can help make whatever I’m talking about click with someone in a way that it hasn’t before.</strong></p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I gave my first conference talk not too long ago! Big shout out to CodeStock for allowing me the opportunity. I’m really happy with the way my talk turned out. I talk fast naturally and talk even faster when I’m nervous so I was worried that my 60-minute time slot would end up being closer to 20 minutes. I took my time and a couple deep breaths and managed to use up most of my allotted time though!</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’m still pretty new to the speaker circuit so I’ve only applied to around eight conferences. I’ve spoken at one so far and am currently on the waitlist for another. <strong>I really appreciate when conferences give you feedback so you can apply that to the next one you submit to. I’m learning from each rejection I get.</strong></p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I don’t like to attend a session before my talk as I like to take that time to be by myself and compose my thoughts. I’ll typically run through my slides one last time but I’ll only do a visual run through - I won’t actually practice. I also like to take a minute or two to go somewhere on my own and give myself a little pep talk!</p>\n<h3>What advice do you have for new speakers?</h3>\n<p><strong>Go for it! You can never succeed if you don’t try.</strong> Submit to conferences that seems interesting to you and don’t give up on trying again if one tells you no. Even the most experienced speakers get rejections.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I really love watching Chloe Condon’s talks. I love how she injects humor into them.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/2n3GHyWTaM8' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Chloe Condon at DevXcon, 2018</em></p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>Feel free to follow me on Twitter! My handle is <a href=\"https://twitter.com/karaluton\">@karaluton</a>. I tweet a lot about the tech world and, if I’m being completely honest, about dogs too.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Kara Luton’s Journey from Ballerina to Software Engineer to Conference Speaker","path":"/blog/speakers-story-kara-luton/","category":"Speaker's Story","tags":null,"date":"2019/06/16","image":"https://i.imgur.com/zFT1aBg.jpg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>As a freelance developer, it can be hard to justify the time and energy required to speak at conferences, but for George Mandis, the experience is well worth it. Like many speakers, George is an experienced software developer who’s passionate about mentoring and teaching newcomers to the field. In this week’s interview, hear more about how speaking at over 20 conferences so far has helped take George’s career to the next level.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://georgemandis.s3.amazonaws.com/holyjs-piter-2017/me-holy-js.jpg\" class=\"right\">\n<p>My name is <a href=\"https://george.mand.is/\">George Mandis</a>. I’m currently a full stack, independent web developer at <a href=\"https://snaptortoise.com/\">SnapTortoise</a> based out of Portland, Oregon, though I wear quite a few other hats. I’ve been freelancing for 13 years, but over the past 4 or 5 years I’ve gravitated towards mentorship roles. Teaching classes, workshops, leading bootcamps and working with junior developers one-on-one has been a rewarding experience and speaking feels like a natural extension to this.</p>\n<p>My first foray into speaking was actually at an Ignite event in Portland where I summarized, in 5 minutes, my experience <a href=\"https://www.youtube.com/watch?v=T2QC43jwPyM\">living as a digital nomad</a> for a year. I was terrified to speak in front of so many people, but it went well! After that I though I should look into conference speaking as a way to advance myself professionally, extend the aforementioned mentoring activities I mentioned and continue to travel and see the world, which is one my biggest passions.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/T2QC43jwPyM' frameborder='0' allowfullscreen></iframe></div>\n<h3>What do you like about speaking at conferences?</h3>\n<p><strong>Speaking at conferences is a really fun way to meet other developers and get outside perspectives on things — not just outside your particular industry, but outside your own country!</strong></p>\n<p>It’s always interesting to me to see one type of work or technology in-demand in one place and find it barely mentioned at all in another. It’s also nice to humanize other developers and put a face and a personality to a name. These conferences also have a tendency to be expensive and difficult to otherwise attend, as an independent developer. Being able to attend these conferences and pick the brain of people who work at some very large, influential tech companies is a wonderful opportunity.</p>\n<p>I think the process of preparing a talk and speaking in front of a large group people could benefit anyone’s career, but for mine it’s certainly opened some doors. <strong>Recently I joined the Google Developer Expert program, which is something that would have very likely not happened without my conference speaking.</strong></p>\n<p>The other benefit of speaking is I’ve found it’s a great opportunity to talk about the things you want to be doing, even if it’s not the thing you’re necessarily doing in your day-to-day. My talks tend to focus on creativity, art, hardware-dabbling and making interesting, outside-the-box projects through JavaScript. Speaking on these topics has allowed me to spend more time immersed in that world and meet other like-minded and very talented people with similar interests.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My very first “talk” was the 5-minute Ignite talk I mentioned earlier, but my first <em>technical</em> talk was at HolyJS in Russia. I remember applying to a number of conferences by that point in the year. Some had accepted me but had no budget for travel, but HolyJS was the first one where everything lined up.</p>\n<p>The idea of talking for a full hour was incredibly daunting — I’d never done that before! When I pulled up the conference website I became even more nervous — David Crockford and Lea Verou were two developers I’d read and followed for most of my career, and they were head-lining the conference! My attitude going in was, <strong>if this goes terribly, at least I’m 2000 miles from home and probably won’t ever run into any of these people again.</strong> It sounds funny, but it really took the pressure off!</p>\n<p>Fortunately it went well, and I’m happy to say I’ve seen several familiar faces from that conference at other conferences since then.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’m not sure I could put a number on the number I’ve applied to. I’ve spoken at something around 20 now, but can guarantee you <strong>my acceptance rate is in the single digits, percentage-wise.</strong> Like most opportunities, it really is a numbers game. You have to be diligent and persistent, but also mindful of how you might be able to tweak your proposals to better suit a particular conference’s theme.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>If I have time a day or two before the conference <strong>I like to walk to the venue from wherever I’m staying so that I’m not thinking too hard about finding it on the day I present.</strong> In the hours leading up to the presentation I practice saying key sentences and takeaways for specific slides as I go through the slide from beginning to end, over and over, and make sure all my demos work. Once it’s about 30-minutes or so to go I’ll put the slides away and just try to clear my head. This routine changes depending on how new the talk is and how comfortable I’m feeling with it.</p>\n<p><strong>I also try to see as many other talks as I can</strong>, though I that can be difficult sometimes when my nerves are racing and my talk is still looming. After I’ve given my talk I’m much more relaxed and find it easier to enjoy the other talks. I try to make a point of shaking hands with all the speakers I see and letting them know I really appreciated what they spoke on. Other speakers might have differing opinions on that, but I know I genuinely appreciate it when someone in the audience comes up to me just to let me know they enjoyed my talk.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>When it comes to applying <strong>it really is a numbers game.</strong></p>\n<p>Apply early and often and try not to get too down on yourself if your talk isn’t accepted. For topics, there are many schools of thought on this, but I personally feel sharing a case study or story about how you used a particular piece of technology to achieve a specific goal is a good approach for giving your talk structure. Talking about why technology X is cool in general way can be just fine, but sharing how we used X at Y to achieve Z gives the audience something more concrete to walk away with.</p>\n<p>If you’re giving a workshop you can dive more deeply into the nitty-gritty workings of a thing and keep your focus there, but in a 20-40 minutes talk it’s more about introducing an idea and making the case for why others should have interest in it.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>There are quite a few, but I’ll mention two people I met at my very first talk who I think are wonderful: <a href=\"https://twitter.com/LeaVerou\">Lea Verou</a> and <a href=\"https://twitter.com/g33konaut\">Martin Splitt</a>. The list could be much longer, but I’ll stick with those for fear of omitting someone! I feel both of them have real passion for the web as an open platform and convey their enthusiasm and knowledge very well when they speak.</p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>Next, I’ll be giving a talk called <a href=\"https://www.crowdsupply.com/teardown/portland-2019\">“Hacking Hardware with JavaScript” at Teardown 2019 in Portland, Oregon</a>.</p>\n<p>You can find out more about me, my projects, writing and where I’m speaking next on my website: <a href=\"https://george.mand.is/\">george.mand.is</a> and follow me on Twitter at <a href=\"https://twitter.com/georgeMandis\">@georgeMandis</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: George Mandis, Digital Nomad and Web Developer","path":"/blog/speakers-story-george-mandis/","category":"Speaker's Story","tags":null,"date":"2019/06/08","image":"https://georgemandis.s3.amazonaws.com/holyjs-piter-2017/me-holy-js.jpg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>This week, I interviewed Rhia Dixon, a relatively new conference speaker who’s been accepted to speak at 6 conferences in her first year on the stage! While new to speaking at conferences, Rhia obviously has a gift for communication, and sometimes beginners are actually the best people to take advice from. Read on to hear Rhia’s fresh approach to tech conference speaking and some of the fantastic women in tech who have inspired her.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/GLa6cwP.png\" class=\"right\">\n<p>I’m a software engineer from Kansas City, Missouri. I love to tech, and I love to share the cool things I’ve learned with other people.</p>\n<p>I have always enjoyed going to schools to speak to students, but I was intrigued by conference speaking. One fateful evening I told <a href=\"https://twitter.com/likeOMGitsFEDAY\">Jennifer Wadella</a>, founder of Kansas City Women in Technology, that I was interested in speaking at tech conferences. She volunteered to be my mentor, set me up with resources for writing abstracts, and she sent me links to open CFPs for various conferences for me to begin submitting those abstracts. It felt like a whirlwind of events…I was writing abstracts the first week of December 2018, submitting those to conferences within the next week, and I got my first acceptance in January!</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>What I like about public speaking is that it puts me in a new place to help other people. I am thrilled that I’m providing content that people want to hear, and content that they can take something from to apply to their lives.</p>\n<p>I do believe it has benefited my career, and it has helped me to shine a light on the things I believe are great.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first conference was DevFest KC this past February in Kansas City. <strong>I was super nervous, and I told the audience this was my first time speaking at a conference. I’m used to trying to engage small groups of teenagers, not 20-40 adults.</strong> However, I needn’t have worried so much. My audience was engaged, they asked questions, and they were eager to participate. By the end of the talk, they didn’t believe that was my first time.</p>\n\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 56.25%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <iframe src=\"https://player.vimeo.com/video/312227563\" frameborder=\"0\" allow=\"autoplay; fullscreen\" allowfullscreen style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          \n<p><a href=\"https://vimeo.com/312227563\">Rhia Dixon at the KC Women in Technology 2019 Kickoff</a></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>At the time of this response, I have applied to 28 conferences. Thus far, I have been accepted to speak at 6 of the 16 conferences that have announced their speakers (1 of which I’ve already done).</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>My pre-talk routine consists of taking one last look at my slides, a few deep breaths, and listening to whatever song that currently has my ears hostage (typically something upbeat and relatively positive with great musicality).</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>I would pass on some of the best advice I’ve received:</p>\n<ul>\n<li>Pick a topic that you wouldn’t mind speaking about for hours and make it interesting for the version of you that would benefit from the talk.</li>\n<li>Write your abstract in such a way that the reader gets a pretty good understanding of why they should be at your talk and what they will get from attending.</li>\n<li>While you may not feel like the expert on this topic, the people listening to you came to hear YOU! Remember you’ve got friends in the audience — some you may know, and some you may not know…yet.</li>\n<li>Find people from varying backgrounds to read your abstracts — <strong>I have a speaker in tech, a speaker not in tech, and a non-speaker in tech review all of my abstracts to tell me what they think the point is, what they would expect to learn, and offer alternative titles.</strong> I’ve found this particularly helpful for tweaking my abstracts and tailoring my talks.</li>\n</ul>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>Oh, I have plenty! <a href=\"https://twitter.com/likeOMGitsFEDAY\">Jennifer Wadella</a> is one of my favorites — I know her, she’s relatable, she doesn’t take herself too seriously, and she has a ball on stage sharing what she knows. I’m also inspired by <a href=\"https://twitter.com/techgirl1908\">Angie Jones</a> and <a href=\"https://twitter.com/DrShirleyDavis\">Dr. Shirley Davis</a>. I aspire to these levels of awesomeness and badassery.</p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>I’m pretty active on <a href=\"https://twitter.com/TheFakeRiRi\">Twitter (@TheFakeRiRi)</a>, and I post <a href=\"https://www.rhiadixon.com\">my upcoming conferences on my website</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Rhia Dixon, Software Engineer and Breakout Speaker","path":"/blog/speakers-story-rhia-dixon/","category":"Speaker's Story","tags":null,"date":"2019/05/31","image":"https://i.imgur.com/GLa6cwP.jpg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Like many conference speakers, John got his start speaking at local meetups. Over time, he got more comfortable in\nfront of a crowd, and has now spoken at over 20 technology conferences on a variety of topics. Now it’s become\npart of the way he helps his company, Comcast, make an impact on the technology community.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p><a data-flickr-embed=\"true\" href=\"https://www.flickr.com/photos/linuxfoundation/44425350705/in/faves-17844497@N00/\" title=\"1E6A7337_Web\"><img src=\"https://live.staticflickr.com/1958/44425350705_260783ba05_z.jpg\" width=\"427\" height=\"640\" alt=\"1E6A7337_Web\" class=\"left\"></a><script async src=\"//embedr.flickr.com/assets/client-code.js\" charset=\"utf-8\"></script></p>\n<p>I’m John Riviello and I’ve been working as a frontend web developer for over 20 years. I currently work at Comcast where I am the lead web developer for xFi. My first public presentation was at a Sass meetup in Philadelphia in 2012 where I volunteered to talk about a new open source project I was working on. From there I spoke at a few “unconferences” &#x26; “unconference tracks” at other conferences (where basically as long as you show up and there’s an open speaking slot, it’s yours) before I was first accepted to speak at a conference.</p>\n<p><em>Photo Credit: <a href=\"https://www.flickr.com/photos/linuxfoundation/44425350705/in/faves-17844497@N00/\">The Linux Foundation, some rights reserved</a></em></p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>The thing I enjoy the most is sharing my experiences, both on stage and in the conversations with attendees afterwards. It has also allowed me to travel to some fun and interesting places.</p>\n<p>There are a couple areas where it has directly benefited my career. <strong>I was given the opportunity to <a href=\"http://www.lynda.com/CSS-tutorials/CSS-Sass-Converting-Existing-Site/434463-2.html\">create a course for Lynda.com</a> because I met Lynda.com staff author <a href=\"http://www.raybo.org/\">Ray Villalobos</a> after we both spoke at a conference.</strong> It turned out that we were both speaking at another conference a few months later, so he made a point to check out my talk at that conference. He enjoyed it so he recommended me as a course author. Prior to that I had not even considered authoring a course, and after he sold me on the idea, it because a reality that never would have been had I not met Ray. In addition, at my current role at Comcast I am expected to be having an impact outside of the company, and public speaking is the path I’ve been leaning on to accomplish that.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>The first conference I was accepted to speak at via a CFP was the University of Illinois Web Conference in 2015. When I talked to folks that attended afterwards, everyone had good things to say, but given it was my first talk I essentially took that as I did not too anything terribly wrong, which was a great first step.</p>\n<p>My favorite talk I’ve given so far is “The Critical Career Path Conversation” which I premiered at The Lead Developer NYC in 2018. You can <a href=\"https://www.youtube.com/watch?list=PLBzScQzZ83I8H8_0Qete6Bs5EcW3p0kZF&#x26;v=hMz6QDURQOM\">view it on YouTube</a>, including a fun glitch about one-third of the way through for you all to enjoy watching me struggle &#x26; recover from.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/hMz6QDURQOM' frameborder='0' allowfullscreen></iframe></div>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve applied to about 70 so far and spoken at 20.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>Yes, but I wouldn’t recommend it 😜.</p>\n<p>I usually spend the hour before looking and my slide notes one last time and inevitably tweak a few things here or there. My system is to write out what I’m planning to say for each slide in the slide notes but then I rarely ever follow it directly once I start talking. It’s just a comfort feeling knowing that if I totally forget what I was going to say, the script is there.</p>\n<p>The last thing I do, which I do recommend, is to <strong>make sure you start off smiling</strong> 😃.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>There is so much I could say here but I’ll limit it to a few quick hits:</p>\n<ol>\n<li>\n<p><strong>Imposter syndrome is real and a totally normal feeling</strong>, so do not let that hold you back. Especially early on, I always had a feeling of “everyone in the audience will already know what I’m talking about.” That is not the case. If they did, they would not be there. Those that show up want to hear YOU and learn from your experiences. If it turns out there are a few people that decide to leave during the talk for whatever reason, there is nothing wrong with that.</p>\n</li>\n<li>\n<p>During the intro of your talk, let the audience know how you intend to take questions (raise your hand during the talk, hold them until the end, chat in the hallway later, email, etc.). If someone asks a question that you don’t know the answer to, it is much better to say “That is a great question. I don’t know what the answer is so let me get back to you,” than to try to make up an answer on the spot.</p>\n</li>\n<li>\n<p>My CFP acceptance rate went up when I internalized <a href=\"https://twitter.com/getify/status/804018344412217344\">this piece of advice from Fluent organizer Kyle Simpson</a>:</p>\n</li>\n</ol>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/advice?src=hash&amp;ref_src=twsrc%5Etfw\">#advice</a> <a href=\"https://twitter.com/hashtag/designingATalk?src=hash&amp;ref_src=twsrc%5Etfw\">#designingATalk</a><br><br>OK talks are about the topic.<br><br>Good talks are about the speaker/presentation.<br><br>Great talks are about the audience.</p>&mdash; getify (@getify) <a href=\"https://twitter.com/getify/status/804018344412217344?ref_src=twsrc%5Etfw\">November 30, 2016</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>There are 2 in particular that I look up to:</p>\n<p><a href=\"https://meowni.ca/\">Monica Dinculescu</a> because when it comes to technical knowledge, she does an excellent job of taking a topic and distilling it down so that the audience can understand it and apply it immediately. She is able to do it while keeping her talk entertaining with healthy doses of humor and emojis.</p>\n<p><a href=\"http://www.agiledeveloper.com/\">Venkat Subramaniam</a> is a marathon speaker that I am amazed by. He is a superhuman when it comes to learning new content and teaching it. At the last conference I spoke at, Venkat delivered a full day workshop on the first day and then gave a talk at literally every possible speaking slot over the course of the next 3 days, which totaled 13 separate 90 minute talks. The thing that amazes me even more (especially given my typical pre-talk routine) is he has no slides. He starts off each talk with some bullet point topics in a text editor and the magic happens from there.</p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>I tweet infrequently at <a href=\"https://twitter.com/johnriv?lang=en\">@JohnRiv</a>. In the middle of July I’ll be at <a href=\"https://uberconf.com\">ÜberConf</a> in Denver running a full-day workshop on Web Components and giving a couple talks in the days that follow. As the name suggests, ÜberConf covers a ton of topics related to software development, and Venkat Subramaniam will be speaking there, so if you’re not already familiar with the conference, check it out!</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: John Riviello, Frontend Web Developer","path":"/blog/speakers-story-john-riviello/","category":"Speaker's Story","tags":null,"date":"2019/05/25","image":"https://i.imgur.com/6V1TS6n.jpg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Jaime and I shared the stage once at <a href=\"https://theleaddeveloper.com/\">The Lead Dev</a>, and since then I’ve gotten to know Jaime a bit more on Twitter and by following his podcast, <a href=\"https://mtjc.fireside.fm/\">More Than Just Code</a>. Jaime has spoken at a lot of conferences, but like many of us, he’s applied at an order of magnitude more. Read on to learn more about his process and some of his suggestions for new speakers.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/ozbikNQ.png\" class=\"left\">\n<p>I’m Jaime Lopez Jr and I’m a software developer by day and a podcaster by night.</p>\n<p>I got into public speaking because I wanted to reach a new audience where I could share my knowledge, experiences, and stories. I’ve co-hosted a podcast (<a href=\"https://mtjc.fireside.fm/\">More Than Just Code</a>) for the past 4-5 years, so public speaking was a natural extension of that experience.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I like being able to share things that I have learned because I hope that my experiences can be helpful to others who encounter the same struggles that I have encountered.</p>\n<p>Speaking at conferences has benefited my career by providing an opportunity to meet other people in the industry that I wouldn’t ordinarily get a chance to meet!</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I do remember my first conference talk. I co-presented a talk at 360iDev in Denver, Colorado with <a href=\"https://twitter.com/timmitra\">Tim Mitra</a> (my friend and a co-host of More Than Just Code).</p>\n<p>The talk went very well from what I recall. The topic was about the way that hosting a technical podcast can help developers in their careers, which plays to our strengths as experienced podcasters. Of course it also helped that we had a few die-hard fans in the audience!</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Looking at my Google Sheets spreadsheet where I track this, I’ve applied to about <strong>115 conferences in the past three years or so</strong>. I’ve been accepted by 14 conferences and have spoken at (or am scheduled to speak at) 9 of those conferences.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I like to find a quiet place to collect my thoughts about an hour prior to when I give my presentation. It certainly helps when there is a dedicated room for speakers to do this! Also, if possible I try to check out the room where I’ll be speaking so I can get a sense of the acoustics as well as how the audience will experience the presentation.</p>\n<p><strong>I generally try not to memorize my talks because it causes me to become robotic when speaking</strong>. Instead, I walk through the main points (generally a single word) that I want to mention related to my slides or code that I’m sharing.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>There is one main piece of advice that I can give new speakers:</p>\n<p><strong>It is usually difficult to get started as a conference speaker in terms of getting your CFP submissions accepted. This is totally okay and you don’t need to worry about it!</strong></p>\n<p>I subscribed to the (now-defunct) <a href=\"https://techspeak.email/\">Technically Speaking newsletter</a> that was put together by Chiu-Ki Chan and Cate Huston. The content in that newsletter (which is still available online) helped me craft my CFP submissions so that there is a better chance of being accepted. As well, the Technically Speaking newsletter helped me feel better about CFP acceptance rates (which if I recall they said was somewhere about 10%).</p>\n<p>If I’ve learned anything over the past few years of submitting to CFPs, <strong>it’s that it is better to submit to many conferences that you think would benefit from your talk than it is to be fixated on any particular conference</strong> (which puts all of your hopes and dreams on a single CFP).</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>There are two speakers that come to mind.</p>\n<p>First is <a href=\"https://twitter.com/savinola\">Laura Savino</a>. The way she gives technical presentations makes the audience feel as if they’re going along on a shared journey. Each step of the way seems like a friend is sharing their favorite locations in an unfamiliar city.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/vkb9z68nhyo' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Readable Code - Laura Savino - DDD Europe 2018</em></p>\n<p>Second is <a href=\"https://twitter.com/nmeans\">Nickolas Means</a>. I’ve been impressed with the way that he can smoothly deliver stories that involve a lot of technical detail. The way he presents the topics at hand leaves the audience on the edge of their seat.</p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>I have a website: <a href=\"http://www.devwiththehair.com/\">http://www.devwiththehair.com/</a></p>\n<p>I co-host <a href=\"https://mtjc.fireside.fm/\">the More Than Just Code podcast</a></p>\n<p>I’m on Twitter: <a href=\"https://twitter.com/DevWithTheHair\">@DevWithTheHair</a></p>\n<p>My upcoming and previous conference talks <a href=\"https://github.com/DevWithTheHair/Conference-Talks\">can be found on GitHub</a></p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Jaime Lopez, the Dev With the Hair","path":"/blog/speakers-story-jaime-lopez-jr/","category":"Speaker's Story","tags":null,"date":"2019/05/17","image":"https://i.imgur.com/ozbikNQ.png"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Jason’s story is very similar to my own when it comes to speaking, but he’s been at it quite a bit longer. Now, he’s\nbuilt a name for himself in the Ruby community as one of the top people in testing, and has spoken internationally at events\nof all sizes. I’ve dealt with the problem of testing legacy systems before, so <a href=\"https://www.youtube.com/watch?v=NTr0h4v-jHw\">I enjoyed Jason’s talk on the issue</a>. Read on to learn more about Jason’s experience and advice for fellow speakers.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/BkjG0j1.jpg\" class=\"left\">\n<p>I don’t remember exactly how or why I first got into public speaking. I believe my first tech talks were at small user groups in the Grand Rapids, Michigan tech community around 2010 or so. From there I got into guesting on podcasts, then hosting my own podcast, and then speaking at conferences.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I have an altruistic reason and a selfish reason for speaking at conferences:</p>\n<p>The altruistic reason is that I can help a lot of people by speaking at conferences and sharing my message with attendees.</p>\n<p>The selfish reason is that speaking at conferences is a good way to boost my career prospects as a technology consultant. Since I’ve only started speaking at conferences about six months ago, I think it’s too early to expect to see any tangible benefit from it yet. One way conference speaking has intangibly benefited me though is that I can now list in my bio that I’ve spoken at certain conferences like RubyConf India which I think carries a lot of weight among my peers, and I can truthfully say that I’m an “international speaker”.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first conference talk was at a regional conference called DevOpsDays Midwest in St. Louis, Missouri in September 2018. Since I had already been speaking at local user groups for years before that point, this speaking gig didn’t feel like too big of a jump up. I’m happy to say that as far as I can tell, the talk went fine.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve applied to many dozens of conferences. I’ve spoken at five conferences at the time of this interview with two more conference talks coming up, for a total of seven. I’ve been accepted to more conferences than that but sometimes I can’t go because there’s a schedule conflict or the travel expense is too much to justify at the time.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I don’t have a pre-talk routine. I rehearse beforehand but on the day of the talk I just get up and do it.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>I only have one piece of advice: If getting a talk proposal accepted seems like an unattainable goal, just keep sending in proposals and you’ll probably eventually get something accepted.</p>\n<p>I had to submit dozens of proposals before I finally got a talk accepted, at least a talk at a conference I was able to attend. At this point I’ve actually gotten more talks accepted than I can take on and I’ve had to throttle back on sending in proposals. The act of giving my first talk gave me a couple ideas for my next talk. My next talk gave me several more ideas for future talks, and so on. The more I submitted proposals and the more I spoke, the easier it all got.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I think part of my motivation for speaking at conferences was seeing the success that my friend <a href=\"https://twitter.com/AlainChautard\">Alain Chautard</a> has had with it and seeing the impact speaking has had on his consulting career.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/wJwvmuK4tQw' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Alain Chautard at NG Conf 2018</em></p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>You can learn more about me and what I do at <a href=\"https://www.codewithjason.com/\">CodeWithJason.com</a>. Any of <a href=\"https://www.codewithjason.com/speaking/\">my upcoming speaking gigs can be found here</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Jason Swett, Podcaster and Ruby Testing Aficionado","path":"/blog/speakers-story-jason-swett/","category":"Speaker's Story","tags":null,"date":"2019/05/11","image":"https://i.imgur.com/BkjG0j1.jpg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Keanan Koppenhaver and I met through the <a href=\"https://www.meetup.com/Chicago-PHP-User-Group/\">Chicago PHP Usergroup</a> last year,\nand since we’ve been fortunate enough to share the stage at Midwest PHP, and share a meal in the airport on the way home.\nSpeaking is always a good chance to meet other people, but it’s also a fast way to learn new skills. I’ve seen several of\nKeanan’s talks including one about Alexa and another about serverless functions in PHP. Keanan also has an entrepreneurial\nspirit, which I appreciate, so it was great to learn more about his experience speaking.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/Mcsi3b6.jpg\" class=\"left\">\n<p>Hi I’m Keanan and I’m a developer-turned-CTO and I co-founded <a href=\"https://alphaparticle.com/\">Alpha Particle</a>, a digital consultancy in Chicago. I got into public speaking at one of my previous jobs when we decided that our company should get more involved in the development community. So I started reading up on exactly how conferences decided on talks and started submitting to CFPs!</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I really enjoy all the people I’ve been able to meet as a result of the speaking that I’ve done. <strong>I especially enjoy chatting with people at the speaker dinners or other informal events surrounding the conference.</strong> As far as benefits to my career, some of these connections I’ve made at conferences and meetups have definitely helped me land further speaking gigs, new clients and even (arguably) this interview.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first conference talk was at WordCamp Nashville in 2016. The <a href=\"https://wordpress.tv/2017/03/17/keanan-koppenhaver-take-wp-admin-to-the-next-level-with-advanced-custom-fields/\">video is actually online</a>, though I cringe watching it. It was a 20 minute “lightning talk” and I remember having to follow an awesome speaker who had the audience on the edge of their seat the entire time. The majority of my talk actually went well, but near the end (~14:00) you can see my heart jump up into my throat when one of my demos didn’t work correctly! Luckily, I was able to fix it and finish the talk, and <strong>this definitely wasn’t the last time demos didn’t work exactly right</strong>.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Between conferences and meetups, I’ve probably spoken at between 20-30 and applied to probably twice that many. I don’t really apply to conferences that I don’t feel like I’d be a great fit for, but even then sometimes they just really can’t take everybody.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p><em>Cue Eye of the Tiger montage…</em></p>\n<p>But seriously, I usually just try to get into the room I’ll be speaking in before I have to give my talk (either by getting to the conference early in the morning or during lunch) and make sure my computer can interface with the projector and that the fonts on my slides are readable even in the back of the room.</p>\n<p><strong>I always try to attend the talk before mine in the same room</strong>, just so I can start setting up and doing a final check of everything as soon as the last presenter is done with their talk.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>I think there’s definitely lots of feelings from new speakers around not being knowledgeable enough to start speaking. <strong>But if a conference was only filled with super-advanced talks, they would lose a huge part of their audience.</strong> So, even if you just learned something, you can teach it and many attendees will welcome your perspective as a relatively-recent beginner. <strong>Since you just went through it all for the first time yourself, you know and remember all the roadblocks that someone getting started will have and can help them learn even quicker.</strong></p>\n<p>In addition to that, the one thing that started really getting me more speaking opportunities is <strong>submitting multiple talks to each CFP</strong>. Conference organizers sometimes have an agenda of the talks they’re looking to accept and if you submit more talks, you give them more chances to fit you into the schedule they’re looking to craft. (However, some conferences specifically say to not submit more than X talks, so definitely abide by that.)</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I really enjoy <a href=\"https://twitter.com/garybernhardt\">Gary Bernhardt</a>, specifically <a href=\"https://www.destroyallsoftware.com/talks/the-birth-and-death-of-javascript\">Wat and The Birth and Death of Javascript</a> just because he manages to inject lots of humor into his talks while still keeping them super informative. I also loved <a href=\"https://www.ted.com/talks/tim_urban_inside_the_mind_of_a_master_procrastinator?language=en\">Tim Urban on Procrastination</a> just because of both his graphics and the way he walks the audience through his talk.</p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>More info about me is at <a href=\"https://keanan.dev\">keanan.dev</a> but most of the writing I do is on our company site at <a href=\"https://alphaparticle.com\">alphaparticle.com</a>.</p>\n<p>I’m speaking at a few meetups here in Chicago in the coming months, so I hope to see some familiar faces there!</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Keanan Koppenhaver, Software Developer and Entrepreneur","path":"/blog/speakers-story-keanan-koppenhaver/","category":"Speaker's Story","tags":null,"date":"2019/05/05","image":"https://i.imgur.com/Mcsi3b6.jpg"}}},{"post":{"html":"<p>Last week, I added a couple new sources that more than tripled the number of <a href=\"https://www.cfpland.com/conferences\">conference CFPs listed on our site</a>.\nUnfortunately, I made an assumption that any publicly available API would be okay to integrate with, and one of the new sources\ngot a little bothered about my cross-posting their listings. In order to increase transparency, I’m going to show you where\nI get all the data for this site, and outline my policy on sharing this data.</p>\n<!--more-->\n<h3>CFP Source Data</h3>\n<p>First of all, <strong>my immediate goal for CFP Land is to provide a free feed of all the upcoming CFPs for tech conferences that I can find</strong>.</p>\n<p>With that in mind, I want to give credit to the sources I use to find out about CFPs:</p>\n<ul>\n<li><strong><a href=\"https://confs.tech/\">Confs.tech</a></strong> - An open source list of conferences that I and many others have contributed to.</li>\n<li><strong><a href=\"https://callingallpapers.com/\">Calling All Papers</a></strong> - An open source list and API that aggregates CFPs from joind.in, papercall.io, and lanyrd (which I believe is now defunct).</li>\n<li><strong>Twitter searches and retweets</strong> - People often mention <a href=\"https://twitter.com/cfp_land\">@cfp_land</a> with new conferences, but I also have a few Twitter searches set up to help me find new CFPs.</li>\n<li><strong>Conference Speaker Slack channel</strong> - I am a part of a Slack channel for conference speakers where we often pass CFPs around. I add many of these to my list as well.</li>\n<li><strong>User submissions</strong> - Finally, I’m getting an increasing number of <a href=\"https://www.cfpland.com/submit\">submissions from subscribers</a>. This is really helpful, and I plan on making it even easier to do in the future.</li>\n</ul>\n<h3>Enhancing Source Data</h3>\n<p>Getting the upcoming CFPs is the first part of the process. Next, I manually review each one, make sure it’s categorized, that the location\nis accurate, and I add data about whether they cover travel and hotel costs for speakers. This takes me an increasing amount of time\neach week, but I’m working to automate it. 🤖</p>\n<p>I also have scripts that add logos, Twitter accounts, descriptions, and other metadata.</p>\n<h3>Acceptable Data Use</h3>\n<p>All the data I have is available to the public for any purpose (including building tools that directly compete with CFP Land!) <a href=\"https://www.cfpland.com/conferences\">here on the website</a>, <a href=\"https://feeds.cfpland.com/v2/rss/cfps\">in this RSS feed</a>, or <a href=\"https://cfpland.github.io/api-docs/\">through the API</a>. Seriously, if you want to build something cool with it, go for it. I’d love to hear about it! One guy sent me a message about a <a href=\"https://github.com/jonatasbaldin/cfpland-telegram-bot\">CFP Land Telegram Bot</a> that he built. 👍</p>\n<p>I don’t currently show CFPs that have closed or CFPs that are closing in more than 3 weeks, but I am working on making them available too.</p>\n<h3>Monetization</h3>\n<p><strong>My long-term goal for this project is to make it self-sustaining.</strong></p>\n<p>I do occasionally find sponsors for the newsletter, and I’m exploring building a CFP submission management tool for speakers. If it makes enough to pay for my hosting and email client bills someday, that would be pretty cool. If not, I’ll probably try to do as much as can be fully automated and stop doing as much cleanup.</p>\n<p>If you have questions or problems with any of this, I am a real person. My name is Karl. I live in Chicago, USA and have <a href=\"https://www.instagram.com/urbanmutt_chilidog/\">a dog named Chili</a>. Just <a href=\"mailto:karl@cfpland.com\">email me</a> and I’d love to talk. 💌</p>","frontmatter":{"layout":"post","title":"CFP Land Data Sources & Sharing","path":"/blog/data/","category":"Updates","tags":["Data","Website"],"date":"2019/04/29","image":"https://i.imgur.com/TU40Hf6.jpg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>I was probably a year into speaking at conferences before I heard about “developer relations” (also called “DevRel”).\nIt’s a relatively new field that blends software development and marketing, so many conference speakers get into DevRel (and vice-versa).\nThis week’s featured speaker, Alex Lakatos runs a great newsletter for developer relations professionals\ncalled <a href=\"https://developeravocados.net/\">Developer Avocados 🥑 Weekly</a>. In addition to that, he has a fantastic story about\nhow he accidentally fell into speaking, so read on to learn more about Alex and his tips for technical speakers.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/FDVubKV.png\" class=\"left\">\n<p>About 8 years ago, I was a JavaScript Test Developer working for an outsourcer in Romania (I happen to be Romanian), contracting for Mozilla. A friend was organizing this conference called Open Source Open Mind and wanted someone from our team to come to speak about Mozilla and how to get involved. I was terrified of public speaking, but luckily one of my coworkers, <a href=\"https://twitter.com/ioana_cis\">Ioana</a>, said she’d do it. Ioana was in the US at a client on-site just before the conference though, so she asked me to do the slides for her. Naively, I accepted, thinking there’s no harm in it and it’s the least I could do since she was getting me out of having to be on stage.</p>\n<p>The day of the conference rolls around, and we’re all in the airport early in the morning, waiting for Ioana’s flight to land. Just as the airport was listing her flight as “Cancelled”, we got a message from Ioana to go ahead to the conference, and stall as much as possible, she’ll be on the next flight and should be there in time for the last slot of the day.</p>\n<p><a href=\"https://twitter.com/pensacolla\">Marcela</a>, the conference organizer, being a friend, kept pushing Ioana’s talk further in the schedule. But the last talk of the day comes up, and Ioana is nowhere to be found. So Marcela goes up on stage and looks panicked at the audience, sees me in the front row, and just blurts out: “And now, talking about the Mozilla community…Alex is going to talk about the Mozilla community!“.</p>\n<p>I was dumbstruck, I got on stage and I just sat there quietly for about a minute. And then I started talking and didn’t stop until the Q&#x26;A part. It was horrible, I had my hands in my pocket the entire time, I made a bunch of rookie mistakes. There is a <a href=\"https://www.youtube.com/watch?v=pMnwjpy_3J0\">video of it</a> somewhere on youtube, luckily in Romanian, so not very popular. To this day I still use it as an example of ‘what not to do’ during my public speaking training. 😅</p>\n<p>When the Q&#x26;A part came, people were a bit on edge, and every time someone bashed Firefox with their questions, I took a step into the audience. I think I finished the Q&#x26;A part literally in the middle of the audience, and trying to make a step to my left to go towards the last person that asked a question. That’s when I realized maybe it was time to end the talk, well over my allotted time slot.</p>\n<p>That’s how I started speaking in public. A few weeks after that I was MCing one of the community events we had going, someone from the Mozilla Community team saw me and decided that’s what I was going to do moving forward. I got tons of mentorship from the Mozilla people, like <a href=\"https://twitter.com/codepo8\">Chris Heilmann</a>, as I was starting out and it just encouraged me to get better and be on stage more often than in the audience.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>The reason I speak at conferences is simple. I feel guilty about being privileged enough to have gone to a Computer Science University, so <strong>I try as much as possible to help other people get into tech, or get better at tech</strong>. Knowing I helped at least one person by being on stage and sharing my knowledge makes me feel a bit better about that.</p>\n<p>I used to think public speaking was making me a better communicator, so it was helping me indirectly in my career as a JavaScript Developer. But about two years ago I got a job as a JavaScript Developer Advocate at <a href=\"https://developer.nexmo.com/team\">Nexmo</a>, and my community work and public speaking was the reason I got the job. So it helped me directly in my career, to the point its part of my day to day work! 😅</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/5mWBqS30hoI' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Alex Lakatos at View Source</em></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I don’t really have an exact number, but let’s go with “a lot”. For context, last year I’ve either spoken, attended, hosted or sponsored 40 events (not just conferences, but smaller meetups as well). If I had to venture a guess based on my slides repo on Github, I’d say <strong>I spoke at around 50 conferences and meetups so far</strong>.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>Yes, and it’s a little embarrassing, to be honest. <strong>I get so nervous before going on stage that I can’t eat, drink or interact with people.</strong> There is this Psychology of Winning that tells you how to get into a winner mindset, and that calms down my nerves enough to get on stage and start talking. After the first minute or so practice takes over and I actually enjoy being on stage but let me tell you about getting there.</p>\n<p><strong>I usually find a quiet spot in the speakers room, or in the bathroom (I want to apologize to anyone who has heard my pre-talk routine), and I start imagining I just won</strong> (dunno what, but the point is I’m a winner now!): pump my chest forward, straighten my shoulders, raise my fist in the air, grin widely, maybe even shout a few “Hell yeah!“s if I think the toilet it empty (spoiler alert: it rarely is as empty as I think). That makes me think I just won something, I don’t need to win on stage as well, and it calms my nerves enough so I don’t shake as I speak.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>There are so many things I can list, it’ll just end up being another blog post just for this question. I think there are a lot more resources out there now compared to when I started, so <strong>my advice is just “practice”. No one did great the first time they got on stage or the second one, but practice makes perfect.</strong> So look at your presentations, identify the areas you could have done better (be it slides, content, posture, delivery), and then find the next conference or meetup where you can practice your talk some more and improve on those points.</p>\n<p>If you’re looking for resources on public speaking or want to take the plunge and become a Developer Advocate, I co-curated this newsletter called “Developer Avocados 🥑 Weekly”. If you <a href=\"http://developeravocados.net/\">subscribe</a>, you get a bunch of highly curated articles from the past week in your inbox every Monday, along with a few conferences CFPs that support speakers with travel and accommodation.</p>\n<h3>Are there any other speakers you look up to?</h3>\n<p>When I started out <a href=\"https://twitter.com/codepo8\">Chris Heilmann</a> and <a href=\"https://twitter.com/robertnyman\">Robert Nyman</a> helped me and inspired me a lot.</p>\n<p>Today, I think one of my favorite speakers is <a href=\"https://twitter.com/simona_cotin/\">Simona Cotin</a>. I like her Serverless talks a lot, the live coding with a fallback to recordings is something I keep telling people they should do more of in their talks.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/GTrHSQbxR-Y' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Simona Cotin at JAMStack</em>conf 2018_</p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>I hang out on Twitter these days, so <a href=\"https://twitter.com/lakatos88\">follow me there</a>. I’m hoping my next talk is going to be JSUnconf, but it is an unconference so it’s a bit uncertain. My next confirmed talk is going to be the International JavaScript Conference in London.</p>\n<hr>\n<p>If you’re a tech conference speaker, email karl@cfpland.com to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Alex Lakatos of Developer Avocados 🥑 Weekly","path":"/blog/speakers-story-alex-lakatos/","category":"Speaker's Story","tags":null,"date":"2019/04/27","image":"https://i.imgur.com/FDVubKV.png"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Joe and I are both from Chicago, so we’ve known each other for a few years. One thing I really admire about Joe is his eagerness to help new developers find their way in our industry. While we didn’t talk about it in this interview, he runs <a href=\"http://chicagoapprenticeships.com/\">Chicago Apprenticeships</a>, a site dedicated to helping bootcamp graduates find their first development job.</p>\n<!--more-->\n<p>I’ve always looked at Joe as someone who really knows his stuff, so it was interesting to me to hear that Joe still struggles with nerves when he’s speaking. Remember, people may look like they’ve got it all together on the outside, and still be nervous!</p>\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/pUB2xtQ.jpg\" class=\"left\">\n<p>Hi, I’m Joe! I’ve been in tech for a very long time, and giving talks at conferences for maybe five years. I’m very much a generalist, so I take a lot of different roles in tech. Overall, though, I’d say I’ve been most interested in making teams more effective lately.</p>\n<p><strong>I was originally on the fence about whether I should give a talk. Too nervous.</strong> While grabbing drinks with someone much more experienced than myself, she basically told me to get over it and just apply. That turned out to be great advice. Since then I’ve given a ton of talks, both soft topics and purely technical ones.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p><strong>I’ve been incredibly fortunate to get to meet and become friends with some of my heroes in the industry as a result of speaking at conferences.</strong> That’s probably the biggest benefit for me. The Ruby community — where I give most of my talks — is full of supportive, brilliant folks, so that’s really made me feel good about participating.</p>\n<p>It’s definitely impacted my career. <strong>I still get folks coming to talk to me about talks I gave a few years ago.</strong> I can point to videos of my talks when talking to companies or folks inside my own company. And it let me sharpen my own thinking and discussion skills around tech topics. It’s been a huge boon.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/hFuzIWz6Ynk' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Joe speaking at Rails Conf, 2017</em></p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>Honestly I don’t think I slept for three days before my first talk. One of the reasons I enjoy giving talks is that I get to work on my fear of speaking in front of crowds. That said, <strong>I always struggle right before I actually get on stage.</strong> I was at a single track conference in a theatre auditorium, which made me feel even more nervous.</p>\n<p>But once I was on stage, I was able to get into a rhythm and really get across the ideas I wanted to convey. And at some point I remembered that I do know and care about my topic deeply. That gave me a lot of confidence. I’d say it was a success.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve applied to a few dozen. I’ve been accepted at maybe a quarter of those that I applied to? <strong>I have a much easier time getting accepted at regional and US-based conferences.</strong> I’d really like to do more international speaking, but I think I probably need to have more visibility domestically and focus more on that goal before it’ll happen. I’m also much more comfortable in communities that I feel attached to (Ruby) than general programming conferences.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>Panic? Honestly, I usually spend the morning of a talk walking back and forth clicking through my slides and making sure that I have the major points from that slide down cold. I’ve never been good at preparing to the point where I’ve got my entire talk scripted, so that’s helpful for me as a routine.</p>\n<p>I probably should script my entire talks, but that’s not really my speed.</p>\n<p><strong>I do wear the same t-shirt nearly every time I give a talk. That’s pretty much a ritual at this point.</strong></p>\n<h3>What advice do you have for new speakers?</h3>\n<p><strong>Ignore the fear and just apply.</strong></p>\n<p>I can totally understand the impostor syndrome, it’s hard to make the transition from an audience member to a speaker. It’s a bit cliche, but I do try to help new speakers remember that <strong>the things that they learned in the past year are totally new material to others</strong>.</p>\n<p><strong>I’d definitely recommend taking advantage of any speaker help that conferences offer.</strong> It’s a huge boon to get people to listen to your talk ahead of time. There are also lots of articles out there on how to write a good proposal. Overall, let other peoples’ hard won wisdom get you through the early parts.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I’ve had the fortune or misfortune to speak on the same stage as <a href=\"https://twitter.com/sandimetz\">Sandi Metz</a> before. The clarity of how she conveys deep technical ideas always blows my mind. She’s definitely the person whose style I’d like to get better at emulating. If I would just start scripting my talks.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/VzWLGMtXflg' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Sandi Metz at RubyConf 2017</em></p>\n<p>That said, there are plenty of other speakers with really different styles who all convey ideas really effectively, in really different ways. Say, <a href=\"https://twitter.com/nmeans\">Nick Means</a> versus <a href=\"https://twitter.com/searls\">Justin Searls</a>. You can’t take someone else’s voice, and you don’t need to.</p>\n<h3>Where can readers find more about you?</h3>\n<p>No conferences on the books now as I’m adjusting to a new job and hoping to take advantage of being in a company to get more opportunity to give talks. Hopefully this next CFP season I’ll be back on the trail.</p>\n<p>Until then I’m at <a href=\"http://josephmastey.com/\">josephmastey.com</a>, <a href=\"http://chicagoapprenticeships.com/\">chicagoapprenticeships.com</a>, or on Twitter at <a href=\"https://twitter.com/jmmastey\">@jmmastey</a>.</p>\n<p><img src=\"https://i.imgur.com/RSeC2VQ.jpg\"></p>\n<hr>\n<p>If you’re a tech conference speaker, email karl@cfpland.com to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Joe Mastey, Tech Generalist and Apprenticeship Advocate","path":"/blog/speakers-story-joe-mastey/","category":"Speaker's Story","tags":null,"date":"2019/04/21","image":"https://i.imgur.com/JPkvp6S.jpg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>After being reluctant (and admittedly nervous) to get on stage as a speaker, Nicola was finally\nconvinced that her experience was worth sharing. Her story is inspiring, because as Nicola points\nout, there aren’t a ton of speakers like her (Australian, female designers) out there.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p>I’m an independent product design consultant, working with software teams on their research and design as well as their process. I’m Australian, but I travel around a lot now days.</p>\n<p>I really had to force myself into public speaking. <strong>I was that girl who was so nervous I felt sick when I had to answer a question in class in front of people in high school.</strong> I was so shy and scared of public speaking. I never, ever thought I’d be speaking at conferences one day.</p>\n<p>I was lucky later on that I had a manager (Lawrence Crowther) who kept suggesting I give a talk. I think the fact that he saw me as someone who should be on stage was what I needed to feel like I could do it. Then the guy who runs Web Directions in Sydney reached out to me on Twitter after some blog posts I wrote, and specifically said he’d love to see my application to speak at the conference coming up. They promised speaker training for anyone who wanted it, so I went ahead and applied. Lo and behold, I was accepted… So then I had to force myself to get comfortable with public speaking in a matter of a few months.</p>\n<p>I really appreciate both of these people for believing I was the right person to be on stage, and encouraging me to do it. <strong>I think to get less represented people on stage, we really need to just ask them more.</strong> It’s hard to imagine yourself on stage if you’ve never really seen someone like you doing it. I didn’t feel like I’d seen many young, Aussie, female designers doing talks, so I guess it just didn’t really seem like something I could do.</p>\n<img src=\"https://i.imgur.com/qTCPnIX.jpg\" class=\"center\">\n<h3>What do you like about speaking at conferences?</h3>\n<p>The two things I’ve spoken about most - retrospectives and collaborative user research - are both things I’m really passionate about. So it’s just exciting to be able to share information I really think people should have.</p>\n<p>On a more selfish level, <strong>its great to be able to speak about the thing you’re interested in in front of a lot of people, because it means for the rest of the conference the other people who share your passion will come up and talk to you.</strong> I’ve met some really interesting people. And having spoken about your field at conferences gives you a little boost of initial authority on the subject that you otherwise have to build from scratch every time you meet a new client.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I tested out that my laptop connection and slides were working so many times in the break before my talk that they had to shoo me off stage. And still, the connection totally failed when I got up there in front of 800 people. The AV guy had to actually restart my computer on stage while I was standing there introducing myself at length. Super awkward! But I feel like I swallowed the frog: the possibly worst thing happened the first time. It all had to be uphill from there.</p>\n<p>(For the record, the talk went fine once we got the slides working again!)</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve spoken at 3 conferences, with #4 coming up in June. Two in Sydney one in Kingston, Jamaica (!) and the next in Cornwall in the UK. I’ve applied to a lot more than that!</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/J5mC7jQ3Lto' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Nicola Rushton at WebCraftConf - User Research is for Everyone</em></p>\n<h3>Do you have a pre-talk routine?</h3>\n<p><strong>I always try and test out the talk on a real audience or two before the conference.</strong> Whether that’s at a workplace or a Meetup, I always find things to change and get feedback from people. I will practice my talk probably ten or more times in the few weeks before the conference, just in my house talking to the walls!</p>\n<p>Directly on the day of the talk, I don’t have much of a routine. If anyone asks me about how I’m feeling I tell them “excited!” Even if I’m actually totally nervous, I find that embodying excitement helps me feel that way. I normally don’t eat much on the day.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>The most useful thing I have ever been told regarding public speaking was that <strong>the intense rush of adrenaline and nerves before you get on stage is COMPLETELY NORMAL and it happens to everyone, even people who’ve been doing it for years</strong>. In fact, if it stops happening, there’s something wrong. When I felt like that before, I used to get kind of worried and feel like maybe it would cause me to shake or faint on stage or something. But now I just observe that feeling and think to myself, awesome. My body is giving me all the adrenaline and hormones to do an awesome job of this. And I know it doesn’t come across on stage (especially if you smile!)</p>\n<p><strong>Think about starting by talking at Meetups, being on panels, or even hosting a Meetup.</strong> Smaller moments of being on stage helped me feel comfortable building up to standing up and speaking for 45 minutes straight.</p>\n<p>I think it’s also worth saying that representation on stage can be really useful for other people in the audience. Seeing people like you doing things can make someone reconsider whether they might be the right person to do that thing too. <strong>Just by being up there and being yourself you could be encouraging someone else to get up and share the thing they’re passionate about too.</strong> I find this perspective valuable if I start to feel imposter syndrome.</p>\n<h3>Are there any other speakers you look up to?</h3>\n<p>One of the most useful things I did for myself when forcing myself to become comfortable with public speaking was to <strong>hold myself to a low standard</strong>.</p>\n<p>That might sound really counterintuitive, but I just told myself at the start that if I got on stage, said everything I wanted to say, and didn’t trip over myself, then it would be a huge success. Then the next time, I pushed myself to do all of that and one more thing. Then the next time, just a tiny bit better. This allowed me to always feel REALLY positive and successful and happy about my public speaking. I didn’t want to get into feeling like I didn’t do good enough, and become discouraged. So really, my goal is to just be myself on stage, have good content, and communicate what I want to communicate in an engaging way.</p>\n<p>I don’t compare myself to anyone else!</p>\n<h3>Where can readers find more about you?</h3>\n<ul>\n<li><a href=\"http://nicolarushton.com/\">www.nicolarushton.com</a></li>\n<li><a href=\"https://twitter.com/nicolarushton\">Nicola on Twitter</a></li>\n<li><a href=\"http://linkedin.com/in/nicola-rushton/\">Nicola on Linkedin</a></li>\n</ul>\n<p>My next conference talk is in <a href=\"https://agileonthebeach.com/sessions/2019/bring-the-team-along-for-the-ride-why-products-are-better-when-agile-teams-do-research-together/\">June at Agile on the Beach, UK</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email karl@cfpland.com to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Nicola Rushton, Overcoming Reluctance to Share Her Passion","path":"/blog/speakers-story-nicola-rushton/","category":"Speaker's Story","tags":null,"date":"2019/04/12","image":"https://i.imgur.com/qTCPnIX.jpg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Like many people who get into public speaking, Chris Holland has a strong drive to help other engineers perform at their best. When I first met Chris, he was speaking on application security at a regional PHP conference. One thing that comes across here (and if you meet Chris in person) is his passion for helping other engineers learn about topics that can be challenging to tackle.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p>I was raised in Paris, France then moved to Los Angeles in the 90s where I studied some computer science and quickly got into web applications development.</p>\n<p>My early career was focused on front-end development before we had standards such as CSS and the DOM - before AJAX was a thing. Fun trivia, back when Gmail first came out and people were impressed with its “autocompletion” on email addressees, I won a contest to deliver <a href=\"http://wick.sourceforge.net/\">the first open-source framework to do this</a>. Nobody cared, but it was fun.</p>\n<p>Pretty quickly however, I got more into server-side software engineering with Java/J2EE, then PHP and C#/.Net, where I developed a better understanding of Object-Oriented Design, Database Design and Information Security.</p>\n<p>I’ve been managing engineering organizations of various sizes since 2007, and to this day, remain close to the code, seeking out every opportunity to coach software engineers toward successful careers.</p>\n<p>Having learned many lessons “the hard way” over the past 20 years, in 2017 I started developing a growing portfolio of talks shining light on various aspects of Software Crafting and InfoSec. Having spoken at various local meetups, I got into my first “full software conference” as a speaker at the 2017 inaugural Coder <a href=\"https://www.codercruise.com\">Cruise Conference</a> by the fine folks at One for All Events. In 2017 I also spoke at a couple of InfoSec conferences by invitation from contacts developed from speaking at local OWASP meetups. All in all, 2017 ignited my speaking career.</p>\n<img src=\"https://i.imgur.com/eEzegV6.jpg\" class=\"center\">\n<h3>What do you like about speaking at conferences?</h3>\n<p>Speaking at conferences has been a powerful cathartic outlet for overcoming my ever-growing frustration of seeing software engineers making the same mistakes I did earlier-on in my career.</p>\n<p>Far beyond this however, speaking with attendees and listening to their stories, experiences, frustrations and successes, has also been very rewarding and has often given me ideas for new talks, while helping me refine existing talks. Sharing meals and drinks with attendees is a lot of fun. I do tend to be shy though, so I find it easier to engage with people in more intimate settings. <strong>I make a point of sitting at tables of people I don’t know and listening to their conversations while slowly coming out of my shell.</strong></p>\n<p>I also love meeting and learning from other sharp speakers at conferences. It’s helped me correct misconceptions, learn new things, and think about various problems differently.</p>\n<p><strong>Getting to travel the World has been an unbelievable experience. The people, the sights, the food. Just amazing.</strong></p>\n<p>Finally, I absolutely love meeting authors and contributors to open-source projects, with plenty of time to chat with them at speaker dinners and thank them profusely, in person, for their work. I’m also starting to contribute to some projects on Patreon.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first Software Engineering talk lacked structure. I jumped into concepts without sufficiently linking them with a common thread, both with slides and verbally. The audience was very supportive though and in general agreed with my concepts. Questions were thoughtful, and I did get a good amount of spontaneous positive feedback after it, with solid break-out discussions.</p>\n<p>My first InfoSec talk could date as far back as 2015 at a local OWASP Meetup. The graphics in my slides were just too “thin” with insufficient contrast and text that was too small. My delivery wasn’t on-point either. <strong>Despite all that, several people came-up afterward to continue the discussion.</strong></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>In 2018, I started getting accepted to a good number of conferences and spoke at seven of them. In 2019 so-far I’m looking at seven conferences between March and June. I’d be happy to score a couple more for the fall/winter season, but I do have limited availability because speaking at conferences isn’t part of my job description.</p>\n<p>For each conference at which I speak, I take personal time off from work. I also save-up money to bring my Wife to <em>a couple</em> of conferences per year. We strategize about the destinations she’d hope for the most, and when her parents are available to take care of our 2 daughters for a few days.</p>\n<p><strong>I do apply to “several dozen” conferences each year. It’s … overwhelming at times.</strong></p>\n<h3>Do you have a pre-talk routine?</h3>\n<ul>\n<li>Go over my slides, rehearse mental timing milestones at various sections of it. In some cases make some last-minute tweaks if I find an opportunity to more closely align an area of the presentation with the conference’s audience. Or something relevant that just happened in the news.</li>\n<li>Try to scope out the room and check for connectivity, HDMI, Power.</li>\n<li>Make sure my laser pointer works.</li>\n<li>Figure out where I can stash a bottle of water near the podium for mid-talk swig.</li>\n<li>Scope out well ahead of my talk, where the Audio/Video engineers are in case I need their help.</li>\n<li>See whether the previous speaker in my room had any issue with the equipment.</li>\n<li>Get laptop, remote and everything set-up at least 10 minutes before my talk, I like to start setting-up 15-20 minutes ahead of time when I can, and be fully-ready at the 10-minute mark. Yea … I’m also the person who shows-up at the airport at least 2 hours before any flight even with CLEAR and Pre-check.</li>\n</ul>\n<h3>What advice do you have for new speakers?</h3>\n<p><strong>Conferences are literally yearning for new voices. Attendees are growing tired of seeing the same people at conferences year after year.</strong> An increasing number of conferences are focusing their attention on attracting new speakers with no speaking experience with a great emphasis on diversity for underrepresented demographics.</p>\n<p>Check out <a href=\"http://selfconference.org\">SelfConference.org</a> — Speaking at a conference doesn’t have to be about having mastered technology X or methodology Y. It can be about your journey, your struggles, your learning process. Conference attendees love seeing a person to whom they can relate, sharing their struggles and hearing their story.</p>\n<p>Additionally, some of the most compelling talks and keynotes I’ve watched had nothing to do with technology. They were about human topics:</p>\n<ul>\n<li>If you’re struggling with mental health, become a spokesperson for <a href=\"https://osmihelp.org/\">OSMIHelp.org</a>, and educate us.</li>\n<li>If you’re struggling with discrimination, educate us.</li>\n<li>If you’re struggling with accessibility, educate us.</li>\n<li>If you care about something, educate us.</li>\n</ul>\n<p><strong>Turn the World into allies for the causes you care about.</strong></p>\n<p>Back to technology though, if you fear “imposter syndrome”, just know that you have valuable experience to share. I use this syndrome as motivation to more thoroughly research topics I speak on, and to seek out prevailing counter arguments to the points I’m about to make.</p>\n<p>With all this said, the most defensible position lies within what has worked for you, from the confines of realities which you had to face.</p>\n<p>Finally, keep in mind that conference organizers and their speaker selection panels know what they’re doing. <strong>If they’ve picked you, it’s important for you to realize that they’ve done their due-diligence, and that you absolutely, positively, unequivocally belong on that stage.</strong></p>\n<p>So what’s the downside to submitting? What’s the worst that can happen? You might unleash your awesomeness unto the World?</p>\n<p>Bring it.</p>\n<h3>Are there any other speakers you look up to?</h3>\n<p>Yes.</p>\n<ul>\n<li><a href=\"https://www.sandimetz.com\">Sandi Metz</a></li>\n<li><a href=\"https://twitter.com/anjanavakil\">Anjana Vakil</a></li>\n<li><a href=\"https://twitter.com/ieatkillerbees\">Samantha Quiñones</a></li>\n<li><a href=\"https://twitter.com/CalEvans\">Cal Evans</a></li>\n<li><a href=\"https://twitter.com/jonskeet\">Jon Skeet</a></li>\n<li><a href=\"https://twitter.com/likeOMGitsFEDAY\">Jennifer Wadella</a></li>\n<li><a href=\"http://jenna.io\">Jenna Quindica</a></li>\n<li><a href=\"https://twitter.com/xiehan\">Nara Kasbergen</a></li>\n<li><a href=\"http://docondev.com\">Doc Norton</a></li>\n<li><a href=\"https://twitter.com/eryno\">Eryn O’Neil</a></li>\n<li><a href=\"https://twitter.com/philsturgeon\">Phil Sturgeon</a></li>\n<li><a href=\"https://twitter.com/HMSEvans\">Stephanie Evans</a></li>\n<li><a href=\"https://twitter.com/matthewtrask\">Matthew Trask</a></li>\n<li><a href=\"https://twitter.com/JessicaMauerhan\">Jessica Mauerhan</a></li>\n<li><a href=\"https://twitter.com/saramg\">Sara Golemon</a></li>\n<li><a href=\"https://fsharpforfunandprofit.com\">Scott Wlaschin</a></li>\n<li><a href=\"https://twitter.com/IanColdwater\">Ian Coldwater</a></li>\n<li><a href=\"https://www.jbrains.ca\">J.B. Rainsberger</a></li>\n</ul>\n<p>These folks have all delivered amazing talks and keynotes which have impacted how I think about human, management, infosec and software engineering topics.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/VzWLGMtXflg' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Sandi Metz at RubyConf 2017</em></p>\n<h3>Where can readers find more about you?</h3>\n<ul>\n<li><a href=\"http://twitter.com/chrisholland\">Chris on Twitter</a></li>\n<li><a href=\"https://github.com/elchris/speaking\">Talks on Github</a></li>\n<li><a href=\"https://speakerdex.co/chrisholland\">Chris on Speakerdex</a></li>\n</ul>\n<hr>\n<p>If you’re a tech conference speaker, email karl@cfpland.com to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Chris Holland, Engineering Director Driven to Empower Others","path":"/blog/speakers-story-chris-holland/","category":"Speaker's Story","tags":null,"date":"2019/04/07","image":"https://i.imgur.com/eEzegV6.jpg"}}},{"post":{"html":"<p>This week, I released three new features to newsletter subscribers that should improve your experience with CFP Land: Category Preferences, 🔔 New tags, and Perks.</p>\n<!--more-->\n<h2>Category Preferences</h2>\n<p>The most requested feature so far has been the ability for subscribers to choose a preferred category. Each week, the CFP Land newsletter contains more than 30 conferences, so it’s really annoying to sift through all of them looking for the few you really care about. For that reason, each email you get now includes a link to “Update Your Preferences”:</p>\n<p><img src=\"https://i.imgur.com/sp9mq2c.png\" alt=\"Update your preferences in the weekly email\"></p>\n<p>This will take you to form where you can specify the category of conferences you prefer:</p>\n<p><img src=\"https://i.imgur.com/iibk8D7.png\" alt=\"Category preference form\"></p>\n<p>Each week, any CFPs matching your preferred category should show up at the top of your email:</p>\n<p><img src=\"https://i.imgur.com/3utX9jM.png\" alt=\"Preferred CFPs\"></p>\n<p>Location preferences aren’t quite ready yet, but they will be coming soon!</p>\n<h2>“New” Tags</h2>\n<p>Another way to pick out new CFPs from the weekly email is to focus on any that are new. The list is sorted by CFP end date, so usually new ones will be at the bottom, but occasionally I’ll add a conference CFP just before it closes. In this case, it will show up marked with the ”🔔 New” tag. This means the conference has been added since the last email was sent 7 days ago:</p>\n<p><img src=\"https://i.imgur.com/sp9mq2c.png\" alt=\"New tag indicates a conference has been added in the past 7 days\"></p>\n<h2>Perks for Speakers</h2>\n<p>Finally, I’m spending extra time each week looking for the “Perks” that each conference offers to speakers (hopefully I’ll be able to automate this eventually). This was another highly requested feature, and it definitely helps if you’re trying to prioritize conferences that will cover travel or hotel costs for you.</p>\n<p>Right now the perks I look for are:</p>\n<ul>\n<li><strong>Travel</strong> meaning that the conference will pay for your travel to and from the event.</li>\n<li><strong>Hotel</strong> indicates that the conference offers reimbursement for hotel costs.</li>\n<li><strong>Stipend</strong> is an offer for payment or extra cash to cover miscellaneous expenses while speaking. Not many conferences offer this, so it’s nice when they do!</li>\n</ul>\n<p>Because my resources are limited, I only include these perks when they are <strong>clearly listed</strong> on the conference’s website page for speakers. If I miss something, you can always email me to let me know. Also, I decided not to include whether a free ticket for the event was included because <em>almost</em> every conference includes this by default.</p>\n<p><img src=\"https://i.imgur.com/P03MMW4.png\" alt=\"Perks like travel, hotel, and stipend are included in each email\"></p>\n<p>That’s it for this month’s new features. All new subscribers are asked to fill out a feedback form, so if you’d like to see improvements, keep an eye out for that email after you subscribe or contact me (<a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a>) to start a conversation.</p>","frontmatter":{"layout":"post","title":"New Features: Category Preferences, \"New\" Tags, and Perks","path":"/blog/category-preferences-perks/","category":"Updates","tags":["Email","Website"],"date":"2019/04/05","image":null}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Laura is currently the <a href=\"https://www.modernteacher.com/\">Chief Product Officer at Modern\nTeacher</a>, an edtech startup based in Chicago,\nIL. She was recently featured as a <a href=\"https://www.asianentrepreneur.org/women-on-top-in-tech-laura-janusek-vice-president-of-product-and-founding-team-member-of-modern-teacher/\">“Woman on Top in\nTech”</a> by Asian Entrepreneur magazine, and has been involved in public speaking for\nmany years. In this interview, we cover how she got into speaking at tech\nconferences, her advice for new speakers, and some of the ways speaking has\nbenefited her professionally.</p>\n<!--more-->\n<img src=\"https://cdn-images-1.medium.com/max/1200/1*0KSCAln6MEJrW0a3URY6ow.jpeg\" class=\"left\">\n<h3>How did you get into public speaking?</h3>\n<p>I’ve become a more active speaker at technical conferences just in the last\nyear. Over the past several years, I would speak here and there, generally after\nbeing invited by someone involved with the event. But last year I was looking\ninto conferences I might want to attend for women in tech, and I saw a CFP on\nthe website for one of them. I thought, “Oh, maybe instead of just attending\nthese conferences, I could speak at them,” and I was right!</p>\n<p>I wish I had realized sooner that <strong>you don’t always have to be personally\ninvited to speak at events.</strong> Now that I’m aware of the CFP process, I’m\nspeaking regularly at conferences across the country.</p>\n<h3>What do you like about speaking at conferences? Has it benefited your career?</h3>\n<p>I think conferences can be such a fun way to meet people, whether you’re\nspeaking or not. But I have to admit, being a speaker has its perks. There are\ndinners, networking events, sometimes lounges specifically for the speakers,\nwhich build an immediate sense of community. I’ve been blown away by some of the\nother speakers I’ve met in these settings.</p>\n<p>Speaking also establishes your authority in your subject area, and it gives you\nthe chance to genuinely help people learn something new. This teaching aspect is\nespecially important to me, given my background in the education space.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>Being in EdTech, I’ve always spoken at events for teachers, which was a natural\nprogression from being in the classroom and participating in or leading\nprofessional development sessions. But my first speaking engagement that was for\nmore of a technical and business-oriented audience was on a panel of EdTech\nentrepreneurs at <a href=\"https://1871.com/\">Chicago’s tech incubator and hub, 1871</a>.\nOne of the organizers had seen me giving a product demo and asked for me to join\nthe event, perhaps to help them avoid the dreaded all-male panel (or “manel”).</p>\n<p>And again, this experience corrected some misconceptions I had about public\nspeaking. I used to think all panelists must be exceptional at coming up with\noff-the-cuff responses to tricky questions on the spot, and maybe some of them\nare, but that’s definitely not the norm.</p>\n<p>In my experience at the 1871’s event, the panelists were all given the questions\nahead of time so we could prepare, and I was asked if I’d be comfortable kicking\nthe panel off by responding to the first question. I didn’t need to worry about\ncoming up with responses in the moment, because I was prepped ahead of time,\nwhich made the experience a lot less intimidating. And the format of a panel —\nbeing seated, one in a row of several speakers — creates a more casual vibe as\nwell. <strong>I’d definitely recommend panels as a gateway experience for anyone who\nis considering branching out into public speaking.</strong></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve spoken at about 10 conferences to date, and I currently have 4 more\nscheduled in the coming months. I don’t keep count on how many I’ve applied to,\nbut it’s been a lot! <strong>I definitely don’t get accepted to every event — I don’t\nthink anyone does.</strong> But I’ve very much enjoyed the conferences I’ve been a part\nof, and I’m looking forward to the ones ahead.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I try to access the room some time before my session to make sure the AV setup\nis good to go, but apart from that, I’m usually attending someone else’s session\nright up until it’s time for mine to start!</p>\n<p>I know not everyone’s schedules allow them to spend the full day at the event,\nbut <strong>I think it’s a shame when speakers come in just for their session and then\nleave.</strong> I make it a point to support and learn from the other speakers when I’m\nat a conference, so my session is usually one of many that I participate in\nthroughout the day.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>My biggest piece of advice is to just go for it!</p>\n<p>I’m involved in a lot of online communities, and I’ll see people posting in\nSlack, asking if they should respond to a CFP they’re interested in. My response\nis always yes. Why not? <strong>It doesn’t take much to respond to a CFP. You don’t\nhave to have a whole session ready to go. You just need an idea and an\nabstract.</strong></p>\n<p>Think of something you’ve been successful at professionally, and then think of\nwhat advice you’d give to others on that topic. Can you come up with 5–10 tips\nto make your audience better at X? A coding language, a new tool, even a soft\nskill? Then you’ve got enough to respond to a CFP.</p>\n<p>There are a lot of resources on writing strong CFP submissions, so I’d recommend\ndoing a little research in that area, but <strong>don’t be intimidated, especially if\nyou’re a member of an underrepresented group. Conferences need more\nrepresentation of diversity and inclusion.</strong> Go for it!</p>\n<h3>Are there any other speakers who have inspired you?</h3>\n<p>One that comes to mind is Jennifer Wesley at Google, who gave the opening\nremarks at the Women Techmakers Summit in Chicago for International Women’s Day\nrecently. She stands out to me because she was able to get personal on stage,\nand in doing so, she established that the summit was a safe space for women.\n<strong>By being willing to be a little vulnerable with her personal story, she set\nthe tone for the whole day.</strong></p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/95g2cd8pwe8' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Jennifer Wesley at TEDxParker speaking about women in STEM</em></p>\n<h3>Where can readers find more about you?</h3>\n<p>I always post about my upcoming sessions on\n<a href=\"https://twitter.com/LBJanusek\">Twitter</a> and\n<a href=\"https://www.linkedin.com/in/lbjanusek/\">LinkedIn</a>, and I share speaker\ndiscounts there when I can, so follow or connect with me if you’re interested.</p>\n<hr>\n<p>If you’re a tech conference speaker, email karl@cfpland.com to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Laura Janusek, Chief Product Officer in Educational Technology","path":"/blog/speakers-story-laura-janusek/","category":"Speaker's Story","tags":null,"date":"2019/03/31","image":"https://cdn-images-1.medium.com/max/1200/1*0KSCAln6MEJrW0a3URY6ow.jpeg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>This week, I’m thrilled to bring you the story of <a href=\"https://geshan.com.np/\">Geshan\nManandhar</a>, a native of Nepal who now lives in\nAustralia. One of the things I love about speaking at conferences is the\nopportunity to meet people from all over the world, so reading Geshan’s\nexperience as a speaker on multiple continents was inspiring.</p>\n<!--more-->\n<img src=\"https://cdn-images-1.medium.com/max/1200/1*mQ216JZETiJBtVpHdGLBkA.jpeg\" class=\"left\">\n<h3>Tell me about yourself? How did you get into public speaking?</h3>\n<p>I have been a software engineer for more than a decade now. I have worked as a\nsoftware engineer in 3 countries in the past 10 years. I am primarily a backend\nsoftware engineer who dabbles in the frontend side of things once in a while.</p>\n<p>I used to do public speaking even in 2010 but I restarted doing it in 2014 when\nI spoke at a meetup in Kathmandu, Nepal. Then I started sending out abstract to\nCFPs in 2015, and in 2016 I spoke at my first conference: Code Motion Dubai.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I like meeting like-minded people with the profession in common. All of us are\nsolution providers at the end of the day at times with code and sometimes\nwithout code too. I like the positive energy conferences have and regardless of\nwhere you work or the number of years of experience one has all of the\nparticipants are there to learn and share the experience. I admire the time,\neffort and resources put in by speakers for their talk.</p>\n<p>Public speaking, to be honest, has benefited my career both directly and\nindirectly. It has surely given me recognition and many people have approached\nme after doing some public speaking for various reasons. To be honest, adding a\nsection in your CV where you have spoken in a couple of good conferences does\nadd more value.</p>\n<h3>Do you remember your first conference talk?</h3>\n<p>My first big conference talk was in August, 2016 in Amsterdam for Laracon EU.\nProbably that was the biggest audience I had spoken in front of and included all\nthe who’s who of that community. It was a talk on ChatOps and I think for that\ncommunity of people it was a relatively new thing then.</p>\n<p><span class=\"figcaption_hack\">Geshan’s first big conference talk at Laracon EU, 2016</span></p>\n<p>I think it went pretty well, I was shaky and nervous when I started of course\nand then after the first 10 minutes I think I was in the flow and telling most\nof the things I had to talk about.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>To be honest, I have lost count on how many CFPs I have submitted my abstracts,\nfrom 2015 it surely should be in the 100s. I generally submit to conferences\nthat cover both travel and accommodations or at least travel. Like an e-commerce\nwebsite, I believe (at least for me) the conversion (success) rate is like 1% or\nless :). In total from 2016 to now I have spoken at 4 conferences in 4\ncontinents, not sure if it qualifies me to be called an international speaker\nfrom Nepal though :).</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I narrate the talk to myself the night before. Then right before the talk, I\nmake sure I have things I need with me like water, screen connections, and that\nthe screen size is fine. After I get on stage, I focus on delivering the message\nwith the right impact.</p>\n<p>I try to keep preparation pretty simple: don’t over-prepare, keep things\nspontaneous, but have some direction and keep an eye on the time.</p>\n<p>I usually don’t have speaker notes so I look at the slides and then improvise on\nthem. That’s why even if I do the same talk a second time, the details I include\neach time will be different.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>For new speakers, there are two main pieces of advice:</p>\n<p><strong>First, give your talk on local meetups.</strong> Local user group meetups are always\nlooking for speakers so if you approach them you will rarely hear a no you can’t\npresent. Depending on your city, the frequency of meetups in your area of tech\nmight be many, little, or none. When you practice your talk in a smaller group\nyou get feedback and also get over imposter syndrome.</p>\n<p>Speaking is not a thing for everyone, so try it in a smaller group. If you like\nit do it more, but bare in mind public speaking is a very important skill for\nyour career.</p>\n<p><strong>The second one is to work on your title and abstract.</strong> When conferences have\nCFPs the main thing in my opinion that stands out is your title and abstract.\nThe relevance of the talk in that conference is vital too, for instance, a Ruby\nconference will never accept a PHP 7 features talk. As some conferences have\nblind speaker selection, always work an extra bit on your title and abstracts.</p>\n<p>Then, it’s all about submitting your talk to all the CFPs you can find. The best\nway to find CFPs is <a href=\"https://www.cfpland.com/\">CFP Land</a>,\n<a href=\"https://www.papercall.io/\">papercall.io</a>, <a href=\"https://confs.tech/\">confs.tech</a>,\nlanyrd.com (it’s usually down though),\n<a href=\"https://callingallpapers.com/\">callingallpapers.com</a>. I wrote some <a href=\"https://geshan.com.np/blog/2016/09/some-useful-resources-for-conference-speakers-and-wanna-be-speakers/\">more advice\nfor finding speaking opportunities on my blog\ntoo</a>.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>One tech speaker who is great to listen to is <a href=\"https://twitter.com/kelseyhightower\">Kelsey\nHightower</a> from Google. His talks are\nspontaneous, fun, and filled with information.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/_1-5YFfJCqM' frameborder='0' allowfullscreen></iframe></div>\n<p>Someone that I witnessed in-person who is very good on stage is <a href=\"https://twitter.com/adamwathan\">Adam\nWathan</a>. He was able to explain a complex topic\nin a very easy way and had the courage to do live coding on a stage with like\n500+ people watching.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/dfgtKb-VpRk' frameborder='0' allowfullscreen></iframe></div>\n<h3>Where can readers find more about you?</h3>\n<p>I blog at Geshan.com.np, I don’t have my next talks up yet, but the talks I have\ndone in the past are in the <a href=\"https://geshan.com.np/blog/categories/talks/\">“talks” section of my\nblog</a>.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed//QitdhwHYAVE' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Geshan’s more recent talk from DevOps Days Newcastle on Microservices</em></p>\n<hr>\n<p>If you’re a tech conference speaker, email karl@cfpland.com to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Geshan Manandhar, Intercontinental Speaker and Senior Software Engineer","path":"/blog/speakers-story-geshan-manandhar/","category":"Speaker's Story","tags":null,"date":"2019/03/24","image":"https://cdn-images-1.medium.com/max/1200/1*mQ216JZETiJBtVpHdGLBkA.jpeg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<!--more-->\n<h3>Tell me about yourself? How did you get into public speaking?</h3>\n<p>I’m Laurie and I’m a software engineer. I got into speaking for a couple of\nreasons. In my former life I was an active member of the debate team and did a\nlot of musical theatre, so audiences don’t scare me. I decided I wanted to be\ninvolved in technical speaking in part because I wanted to see more diversity\nrepresented on the stage.</p>\n<img src=\"https://cdn-images-1.medium.com/max/1200/1*fM3yLcP58eVXUsdeHAnVdA.jpeg\" class=\"left\">\n<h3>What do you like about speaking at conferences?</h3>\n<p>There is so much to love about speaking.</p>\n<p>I like thinking up the talk subject and coming up with something I think is new\nor interesting that will benefit attendees. While writing talks are a huge time\ncommitment, there is nothing quite like explaining a concept to others to help\ncrystalize it in your mind.</p>\n<p>And, speaking is an incredible way to connect with other people outside of your\ntech silo and/or geographic area. It has also opened up additional career\nopportunities for me, and has resulted in growing in different directions as\nwell, like writing blog posts and answering interview questions!</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I do! It was a local first year conference. I think the talk was meant to be 20\nminutes or so and I was overly concerned about running short.</p>\n<p>It went pretty well, and people laughed at my jokes, but I was far more nervous\nthan I’d expected to be. If you want to judge for yourself <a href=\"https://www.youtube.com/watch?v=eS8tO3Z6E7U&#x26;t=579s\">the video is\nonline</a>. I really should\nretool this talk and give it again.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed//eS8tO3Z6E7U' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Laurie Barth’s first ever conference talk at DC Full Stack Web Summit, 2017</em></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I looked at my Trello board, and I’ve applied to around 35 conferences over the\ncourse of 3 years. I’ve been accepted at 12 and spoken at 9–10 of those.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I try to arrive in the room as early as I can after the previous speaker, and\nnormally I run the talk through without notes while getting ready that morning.\nAs long as I know I have the cues in my head I’m not worried about any further\nmemorization.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>My biggest piece of advice is about content.</p>\n<p>The talks that are most engaging to me include stories of failure, they talk\nabout learning something you don’t know and falling down along the way, or\nthey’re a new perspective from an outsider on a specific topic.</p>\n<p>This isn’t a hard and fast rule, but I think it’s a great way to think about\npotential topics and to feel confident being honest with your audience. You’ll\nbe more memorable.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>So so many! I really couldn’t pick so I’ll try and talk about speakers with\ntotally different types of talks.</p>\n<p>I love <a href=\"https://twitter.com/nmeans\">Nicholas Means</a> who takes you through\nincredibly real stories about disasters and almost disasters and what we can\nlearn from them.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed//099cHWSbAL8' frameborder='0' allowfullscreen></iframe></div>\n<p>I love <a href=\"https://twitter.com/editingemily\">Emily Freeman</a> who talks about how the\nhuman reactions of all of us manifest themselves in our work and how that can\nhelp us be more cognizant of our actions.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed//dbKjzxd-f70' frameborder='0' allowfullscreen></iframe></div>\n<p>I’ve recently discovered some amazing speakers through youtube videos like\n<a href=\"https://twitter.com/philip_roberts\">Philip Roberts</a> who did a great talk on the\njavascript event loop:</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed//8aGhZQkoFbQ' frameborder='0' allowfullscreen></iframe></div>\n<h3>Where can readers find out more about you?</h3>\n<p>I have a website: <a href=\"http://laurieontech.com/\">laurieontech.com</a> (pardon the lack\nof responsive design, I just migrated to a new framework and it’s a work in\nprogress). I also tweet a fair amount\n@<a href=\"https://twitter.com/laurieontech?lang=en\">laurieontech</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email karl@cfpland.com to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Laurie Barth, Software Engineer and Conference Speaker","path":"/blog/speakers-story-laurie-barth/","category":"Speaker's Story","tags":null,"date":"2019/03/17","image":"https://cdn-images-1.medium.com/max/1200/1*fM3yLcP58eVXUsdeHAnVdA.jpeg"}}},{"post":{"html":"<p>When I <a href=\"/how-cfpland-came-to-be/\">started CFP Land last\nyear</a>,\nit was to help other speakers like me find out about new opportunities. In the\npast few months the project has struck a chord and hundreds of speakers have\nfollowed @<a href=\"https://twitter.com/cfp_land\">cfp_land</a> on Twitter or <a href=\"https://www.cfpland.com/\">subscribed to\nthe weekly email</a>.</p>\n<!--more-->\n<img src=\"https://cdn-images-1.medium.com/max/2600/1*bmxvII4crxCtfxC8iV84Og.jpeg\" class=\"center\">\n<p>📖 Anyway, I’d like to start publishing other speakers’ stories here on the blog\nwith <strong>the goal of helping inspire and teach new tech conference speakers what\nit takes to get up on the stage for the first time.</strong></p>\n<p>After you’ve given a few talks — or a few dozen — it starts to seem automatic,\nbut most of us can still remember that first time, the worst talk we ever gave,\nor the best talk we ever gave. If you’re a conference speaker, <strong>I’d like to\npublish a short interview with you on this blog.</strong> It doesn’t matter if you’ve\nspoken one time or one hundred times, someone can benefit from hearing your\nstory.</p>\n<p>If you’re interested, please email a short bio and link to your website to\n<a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a>.</p>\n<p>I look forward to hearing your story!</p>","frontmatter":{"layout":"post","title":"Calling All Speakers: We Want to Hear Your Story","path":"/blog/speakers-tell-your-story/","category":"Updates","tags":null,"date":"2019/03/13","image":"https://cdn-images-1.medium.com/max/2600/1*bmxvII4crxCtfxC8iV84Og.jpeg"}}},{"post":{"html":"<p><em>TL;DR: Back in 2017, I made a personal goal to get accepted to speak at 4\nconferences. <a href=\"https://www.karllhughes.com/posts/one-year-conference-summary\">I made\nit</a> 🎉 and used\nthe experience to launch <a href=\"https://www.cfpland.com/\">CFP Land, a free tool to help conference speakers\nkeep up with CFPs (Calls for Proposals</a>) 📣</em></p>\n<!--more-->\n<p>In 2017, I set myself a goal to <strong>get accepted to speak at 4 technical\nconferences.</strong></p>\n<p>I’m a big goals person — every month I reassess my list of personal goals,\nrecord my progress, and make adjustments as necessary — so when I set out to do\nsomething, I <em>usually</em> figure out a way to make it happen.</p>\n<img src=\"https://cdn-images-1.medium.com/max/1200/1*8lIHyJIsYF9Ci31_DOWYgg.png\" class=\"left\">\n<p>I had done enough presenting, teaching, singing and acting in my life to feel\npretty comfortable on a stage, but I had never tried to break into the tech\nconference scene. Like many software developers, <strong>I felt that I didn’t really\nhave that much to talk about, that my experience was not unique, and that\nsomeone in the audience would call me out for being a fraud.</strong></p>\n<h3>Overcoming the Fear</h3>\n<p>Grappling with the fear of inadequacy is a lifelong pursuit for many of us. I’m\nfortunate to not be crippled by it, but it still took me years to put myself out\nthere and give a technical talk.</p>\n<p>The way I overcame this fear was to <strong>start small</strong>. As I came up with talk\nideas I pitched them to local meetups and code bootcamps. After giving some of\nthese talks, I realized that the audience isn’t as scary as I thought. <em>These\nare just other developers who genuinely want to learn something, and I’m lucky\nenough to be helping them!</em></p>\n<h3>Setting the Goal</h3>\n<p>Four conferences was arbitrary. It felt like enough that I would be able to call\nmyself a “real” conference speaker, but not so many that I would have to travel\nall the time. I love traveling, but with a wife and puppy at home, I have\npractical limits.</p>\n<p>So, I settled on four, and started forming a plan for making it happen.</p>\n<h3>Making a Plan</h3>\n<p>When I create a personal goal, I don’t just write it down and check on it. The\nimportant part to goal-setting is making measurable milestones that you believe\nwill help you achieve that goal. In this case, I started by making a sub-goal:</p>\n<h4>Sub-Goal: Get Accepted to Speak at One Conference</h4>\n<ul>\n<li>✅ Write 2 conference talk proposals</li>\n<li>✅ Create slides for the proposed talks</li>\n<li>✅ Find 40+ conference CFPs</li>\n<li>✅ Submit 2 proposals to 3+ conferences per week until I get accepted</li>\n</ul>\n<p>As I worked my way through the checklist (it probably took about 12 weeks in\nall), I learned a lot about how to write a good proposal and what conferences\nusually looked for. I was very careful to read the conference’s CFP page, but\nI’ll admit that I sometimes submitted proposals that weren’t an ideal fit\nanyway.</p>\n<p>Within a few weeks, <a href=\"https://www.karllhughes.com/posts/api-strat-2017-presentation\">I had gotten my first\nacceptance</a>! Now\nI knew what it would take to get a talk accepted, and I felt like I had some\nmomentum.</p>\n<h3>Oh Yeah, I Still Have to Prepare</h3>\n<p>With one conference booked, I started refining and practicing my proposed talk.\nThe very first time I went through the slides it took me 25 minutes…for a 45\nminute speaking slot…whoops!</p>\n<p>This is where the meetups came in. After I had practiced about 12 times on my\nown, I gave my talk to the local <a href=\"https://www.karllhughes.com/posts/testing-layers-js-chicago\">Chicago Javascript\nmeetup</a>. I\npracticed solo several more times before giving it at the conference.</p>\n<img src=\"https://cdn-images-1.medium.com/max/2400/1*Va0ug0QDjguymVqLGXvU-g.png\" class=\"center\">\n<p>But while I was preparing, I was surprised to see acceptances continue rolling\nin. I ended up getting 7 accepts in the first few months of pitching my talk.</p>\n<h3>It Doesn’t Always Work Out</h3>\n<p>I was excited, but started to run into some tough decisions. One conference in\nRomania was the same weekend as a family obligation and two conferences were on\nthe exact same day, so I turned down the second one that accepted me. In another\nunexpected turn, one conference couldn’t get the attendance they needed, so it\nwas cancelled outright.</p>\n<p>That took my total for 2017/2018 down to four. A manageable number, and even\nbetter, I had hit my goal for the year! 🎉</p>\n<h3>The takeaway: CFPs seem hard, but they don’t have to be</h3>\n<p><a href=\"https://www.karllhughes.com/posts/one-year-conference-summary\">I learned a lot in that first year\nspeaking</a>, and\nwhile I’ve dialed back the number of applications I submit, I’m still actively\nengaged in the speaking community, and submitting a few CFPs per month.</p>\n<p>The whole experience has showed me that speaking isn’t as scary as it seems, and\nsubmitting winning CFPs isn’t a black art. It inspired me to create something\nthat would help other speakers — new and experienced — improve their odds of\nsuccess and become better, more prolific speakers, and thus <a href=\"https://www.cfpland.com/\">CFP Land was\nborn</a>.</p>\n<img src=\"https://i.imgur.com/IANh995.jpg\" class=\"center\">\n<h3>CFP Land: Never Miss a Call for Proposals Again</h3>\n<p><strong>One of the most frustrating things for me was when I’d discover a great\nconference in a fantastic location just a few days or weeks too late.</strong> Once the\nCFP closes, you have to wait a whole year to get back in the mix, and keeping up\nwith dozens of conferences is a lot of work.</p>\n<p>Initially, I used <a href=\"https://airtable.com/invite/r/4EaSmQNr\">Airtable</a> to store\nall the conferences I could find. Each week, I’d manually check on them and\nupdate CFP dates and links as needed. It took valuable time away from the real\nwork of writing proposals and practicing my talk, so I thought this problem\nneeded a better solution.</p>\n<p>Fortunately, other conference aggregators and CFP websites already exist, but\nthe killer feature that they were missing was a single weekly reminder of all\nupcoming CFPs.</p>\n<p>This seems obvious, but I wouldn’t have thought of it if I hadn’t spent months\napplying for CFPs. <strong>As a speaker, I don’t want a huge list of conferences or a\nbunch of noise — I just want a focused, weekly reminder of all the CFPs that\nwould be right for me.</strong></p>\n<h3>The Present and the Future</h3>\n<p>In its current iteration, <a href=\"https://www.cfpland.com/\">CFP Land</a> is an email\nnewsletter with all the upcoming CFPs listed in chronological order. <a href=\"https://twitter.com/cfp_land\">I also\nTweet each CFP</a> when it’s due in 30 days so\nfollowers have plenty of time to submit.</p>\n<p>As speakers have joined, I’ve gotten some great feedback, and am working on\nimprovements already. In the coming months, you’ll be able to filter CFPs by\nlocation, category, and whether or not travel/hotel costs are covered. I’m also\nworking to get more data from more sources so speakers are really sure to never\nmiss a CFP again.</p>\n<p>Of course, I can’t continue improving CFP Land without input from other\nspeakers! If you’re a technology conference speaker and you’ve got feedback,\nemail me at <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> or sign up below to start getting the weekly\nnewsletter 💌.</p>","frontmatter":{"layout":"post","title":"43 Conferences, 7 Offers, 4 Talks: How CFP Land Came to be","path":"/blog/how-cfpland-came-to-be/","category":"Updates","tags":null,"date":"2019/03/07","image":"https://i.imgur.com/IANh995.jpg"}}},{"post":{"html":"<p>Not sure where to start? New to public speaking? Want to know more about the CFP process for technology conferences? You’ve come to the right place.</p>\n<p>Here are some tips and resources compiled from experienced speakers and writers.</p>\n<!--more-->\n<ul>\n<li><a href=\"https://github.com/vmbrasseur/Public_Speaking\">VM Brasseur’s big open source list of conference speaking tips</a></li>\n<li><a href=\"https://twitter.com/johnsundell/status/976496157928165378?s=19\">John Sundell’s top 4 tips for new conference speakers</a></li>\n<li><a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">How and why to speak at tech conferences by Nick Heiner</a></li>\n<li><a href=\"https://blog.prezi.com/speaking-at-a-conference-here-are-10-things-the-organizer-wants-you-to-keep-in-mind/\">10 things conference organizers want speakers to do</a></li>\n<li><a href=\"https://github.com/karlhorky/awesome-speakers\">An awesome open source list of speakers you can follow online</a></li>\n<li><a href=\"https://speaking.io/\">Zach Holman’s wonderful list of tips at Speaking.io</a></li>\n<li><a href=\"https://www.lifehack.org/688597/the-ultimate-public-speaking-tips\">Lifehack’s Public Speaking Guide</a></li>\n<li><a href=\"https://news.ycombinator.com/item?id=16838460\">Hacker News’ favorite tech talks</a></li>\n<li><a href=\"http://www.speaktosucceed.in/\">Speak to Succeed - A blog with lots of public speaking tips</a></li>\n<li><a href=\"https://www.matthewgerstman.com/tech/how-i-prepare-a-talk/\">“How I Prepare a Tech Talk” by Matthew Gerstman</a></li>\n<li><a href=\"https://medium.com/@shehackspurple/presentation-tips-for-technical-talks-8d59f3de9f6d\">23 Presentation Tips for Technical Talks by Tanya Janca</a></li>\n<li><a href=\"https://dev.to/azure/a-guide-for-everyone-who-wants-to-give-technical-presentations-53bo\">A Comprehensive and Practical Guide to Technical Presentations by Jeremy Likness</a></li>\n<li><a href=\"https://www.garfieldtech.com/blog/3-paragraph-pitch\">Larry Garfield’s Three Paragraph Pitch for writing CFP Abstracts</a></li>\n<li><a href=\"/blog\">CFP Land Blog - Speaking Tips, Interviews, and Advice for New Speakers</a></li>\n</ul>\n<p>We will continue to keep this list up to date as we find more. If you want to submit your own resource, contact <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a>.</p>","frontmatter":{"layout":"post","title":"Tips for New Conference Speakers","path":"/blog/new-conference-speakers/","category":"Tips","tags":["New Speakers"],"date":"2019/01/01","image":null}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}