{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"74b0c957-09c4-56cb-9e46-25c48496bb2f","html":"<h2>Choosing Topics</h2>\n<ul>\n<li>“The talks that are most engaging to me include stories of failure, they talk about learning something you don’t know and falling down along the way, or they’re a new perspective from an outsider on a specific topic.” - <a href=\"https://www.cfpland.com/blog/speakers-story-laurie-barth/\">Laurie Barth</a></li>\n<li>“Think of something you’ve been successful at professionally, and then think of what advice you’d give to others on that topic. Can you come up with 5–10 tips to make your audience better at X? A coding language, a new tool, even a soft skill? Then you’ve got enough to respond to a CFP.” - <a href=\"https://www.cfpland.com/blog/speakers-story-laura-janusek/\">Laura Janusek</a></li>\n<li>“Talks that can be summarized as an ‘Intro to (Tool)’ are often lazily conceived, poorly designed, and delivered mechanically. Great talks, meanwhile, dive deeper and are eager to explore fundamental issues, even if they use a tool as the catalyst for discussion.” - <a href=\"http://jumpstartlab.com/news/archives/2014/02/15/prototypical-conference-talks\">Justin Searls</a></li>\n<li>“OK talks are about the topic. Good talks are about the speaker/presentation. Great talks are about the audience.” - <a href=\"https://twitter.com/getify/status/804018344412217344\">https://twitter.com/getify/status/804018344412217344</a></li>\n<li>“Pick a topic that you wouldn’t mind speaking about for hours and make it interesting for the version of you that would benefit from the talk.” - <a href=\"https://www.cfpland.com/blog/speakers-story-rhia-dixon/\">https://www.cfpland.com/blog/speakers-story-rhia-dixon/</a></li>\n<li>“your talk should have a point. When someone walks away from your talk they might only take away 2-3 things with them. Those things should be in your proposal” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n<li>\n<p>Is this the right medium?</p>\n<ul>\n<li>“Before you submit a proposal on a topic, consider writing a blog post about it. If you were able to say everything you wanted to in 1 post, then it’s probably not a good candidate for a talk. Written words work well for reference and getting started, materials, and for comprehensive rundowns. Talks on the other hand favor emotional communication. What is the story behind this refactoring? Are you taking a boring topic and making it interesting or memorable somehow in a way that only a live performance could do justice to?” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n</ul>\n</li>\n<li>\n<p>Unique or repurposed content?</p>\n<ul>\n<li>“ANY topic is fair game even if people have talked about it before. You can always bring a new perspective to a topic.” - <a href=\"https://www.cfpland.com/blog/speaker-molly-struve/\">https://www.cfpland.com/blog/speaker-molly-struve/</a></li>\n</ul>\n</li>\n<li>“Instead of simply stating opinions or facts (e.g. “React is the most popular JavaScript library”) as well as revealing all of your cards instantaneously, tell a story.” - <a href=\"https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32\">https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32</a></li>\n<li>\n<p>Passion:</p>\n<ul>\n<li>“DO NOT propose a topic that you think will get you on stage but doesn’t actually excite you at all.” - <a href=\"https://rckbt.me/2014/01/conference-proposals/\">https://rckbt.me/2014/01/conference-proposals/</a></li>\n<li>“When you speak about something that you are passionate about; you will actually be pretty excited to speak instead of being nervous. And your energy will be reflected when you present. It will boost your confidence and you will enjoy speaking!” - <a href=\"https://www.cfpland.com/blog/speakers-story-drishti-jain/\">https://www.cfpland.com/blog/speakers-story-drishti-jain/</a></li>\n<li>“Talk about topics that make the world a better place in particular accessibility, diversity, ethics, etc. I started trying to go beyond just technical issues and trying to spread some good ideas I believe in.” - <a href=\"https://medium.com/@tryshchenko/why-am-i-doing-public-speaking-at-tech-events-the-honest-answer-a75d80f85cfd\">https://medium.com/@tryshchenko/why-am-i-doing-public-speaking-at-tech-events-the-honest-answer-a75d80f85cfd</a></li>\n<li>“You know you’re passionate about a topic if you’re already spending a lot of time reading about it, thinking about it, and debating it with people on Twitter. Wrap your talks around your passions.” - <a href=\"https://www.cfpland.com/blog/speaker-anjuan-simmons/\">https://www.cfpland.com/blog/speaker-anjuan-simmons/</a></li>\n</ul>\n</li>\n<li>“I personally feel sharing a case study or story about how you used a particular piece of technology to achieve a specific goal is a good approach for giving your talk structure. Talking about why technology X is cool in general way can be just fine, but sharing how we used X at Y to achieve Z gives the audience something more concrete to walk away with.” - <a href=\"https://www.cfpland.com/blog/speakers-story-george-mandis/\">https://www.cfpland.com/blog/speakers-story-george-mandis/</a></li>\n<li>“pick a topic you are passionate about but also already knowledgeable about. Don’t experiment on new topics until you start getting accepted to speak. No need to add pressure on top of everything else.” - <a href=\"https://www.cfpland.com/blog/speakers-story-matthew-trask/\">https://www.cfpland.com/blog/speakers-story-matthew-trask/</a></li>\n<li>“Submit sessions that are interesting, engaging, and challenging, but don’t resort to clickbait titles and topics. Break the mold of what people normally talk about and how they discuss it, but stay classy.” - <a href=\"https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/\">https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/</a></li>\n<li>\n<p>Think of your audience</p>\n<ul>\n<li>“Think carefully about what your audience is interested in as opposed to what you are. What problems do they want to solve? What are the gaps in their experience? Where do they need guidance. You need to serve a need and purpose, and if you can map your presentation more commonly to these needs, you are more likely to get picked.” - <a href=\"https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/\">https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/</a></li>\n</ul>\n</li>\n</ul>\n<h2>Writing an Abstract</h2>\n<ul>\n<li>“Start off with a bang, if your first sentence isn’t good they won’t read the rest.” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n<li>\n<p>Customize to each CFP</p>\n<ul>\n<li>“at least 30% of ~2,500 proposals I’ve ever read violated the predefined rules for talk abstracts and submissions that have been set.” “no matter how adept in speaking you are do read the instructions carefully before submitting and ensure the proposal is following them.” - <a href=\"https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32\">https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32</a></li>\n</ul>\n</li>\n<li>\n<p>Not too wordy</p>\n<ul>\n<li>“Most of JSConfs receive an average of 500 proposals, assuming a very strict 1-minute reading time per submission it’s still a full workday of reading…A good rule of thumb is two to three paragraphs clearly expressing your idea.” - <a href=\"https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32\">https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32</a></li>\n</ul>\n</li>\n<li>\n<p>Multiple per conf</p>\n<ul>\n<li>“one thing that started really getting me more speaking opportunities is submitting multiple talks to each CFP. Conference organizers sometimes have an agenda of the talks they’re looking to accept and if you submit more talks, you give them more chances to fit you into the schedule they’re looking to craft. (However, some conferences specifically say to not submit more than X talks, so definitely abide by that.)” - <a href=\"https://www.cfpland.com/blog/speakers-story-keanan-koppenhaver/\">Keanan Koppenhaver</a></li>\n</ul>\n</li>\n<li>\n<p>Persistence</p>\n<ul>\n<li>“If getting a talk proposal accepted seems like an unattainable goal, just keep sending in proposals and you’ll probably eventually get something accepted.” - <a href=\"https://www.cfpland.com/blog/speakers-story-jason-swett/\">Jason Swett</a></li>\n</ul>\n</li>\n<li>\n<p>Specific</p>\n<ul>\n<li>“make it easy for a reviewer to get excited about your talk. Be specific and get into the details about what you’re point of view is.” - <a href=\"https://medium.com/uxrblog/uxrconf-2020-a-few-tips-for-crafting-a-great-speaker-application-b295e3f61260\">https://medium.com/uxrblog/uxrconf-2020-a-few-tips-for-crafting-a-great-speaker-application-b295e3f61260</a></li>\n</ul>\n</li>\n<li>\n<p>Proof reading</p>\n<ul>\n<li>“Find people from varying backgrounds to read your abstracts — I have a speaker in tech, a speaker not in tech, and a non-speaker in tech review all of my abstracts to tell me what they think the point is, what they would expect to learn, and offer alternative titles. I’ve found this particularly helpful for tweaking my abstracts and tailoring my talks.” - <a href=\"https://www.cfpland.com/blog/speakers-story-rhia-dixon/\">https://www.cfpland.com/blog/speakers-story-rhia-dixon/</a></li>\n<li>“Try not to make overt typos in anything you submit. They stick out like a sore thumb in otherwise potentially well written submissions. It seems trivial, but when your talk comes up as the 70th submission that a reviewer is looking at that day it might break their brain and hurt your chances. If you’re not a native English speaker or you’re awful with grammar like me, ask a friend for a review.” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n<li>“don’t immediately submit your abstract. Write it, and then talk a walk, get away from it, and come back after an hour and see how you feel about it. You may see things you can do better.” - <a href=\"https://www.cfpland.com/blog/speakers-story-matthew-trask/\">https://www.cfpland.com/blog/speakers-story-matthew-trask/</a></li>\n</ul>\n</li>\n<li>“Don’t use cliches, everyone use’s cliches and it makes your proposal blend in. If you feel the pull of using a phrase everyone has heard “a million times”, ask yourself if it adds to what you’re trying to convey.” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n<li>“Use short sentences. Short sentences are concise. Short sentences are rich. Short sentences are powerful. Short. Sentences.” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n<li>\n<p>Get Creative</p>\n<ul>\n<li>“one thing I found helps in my abstract creative process, is to make word clouds. Given a topic like “security” or “performance” I write down as many other words come to mind. I then stack rank them based on which are the most interesting. I write about 10-20 different intro sentences. About 3-4 different copies of the “takeaway” sentences, and about 5-10 outro sentences. I then mix them up until they feel right.” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n<li>“It’s fairly easy for anyone to step in, read available materials and prepare a mediocre presentation. Don’t get me wrong, I’ve done it too, which now makes me able to see why we can do better. Trust me, we’ve all seen the Angular 2 talks already. Don’t copy your predecessors. Interesting angle on React Native? Experimental usage of Rails to build a realtime app? Your own personal experiences and unexpected solutions? Yes please.” - <a href=\"https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32\">https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32</a></li>\n<li>“Conferences are generally looking for novelty when choosing talks.” - <a href=\"https://medium.com/uxrblog/uxrconf-2020-a-few-tips-for-crafting-a-great-speaker-application-b295e3f61260\">https://medium.com/uxrblog/uxrconf-2020-a-few-tips-for-crafting-a-great-speaker-application-b295e3f61260</a></li>\n</ul>\n</li>\n<li>\n<p>Titles</p>\n<ul>\n<li>“A good title is reasonably short, self-descriptive, contains the appropriate buzzwords for your topic (and no others), and has enough of a “hook” to make someone want to read further (or attend).” - <a href=\"https://www.garfieldtech.com/blog/3-paragraph-pitch\">https://www.garfieldtech.com/blog/3-paragraph-pitch</a></li>\n<li>“set a timer for 3 minutes, write as many titles as you can. Pick your favorite, then write the rest of your submission. When you’re done go back and throw away the title and re-write it.” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n<li>“Try to use descriptive words or action statements in the title.” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n<li>“Don’t alienate your audience through jargon. Your title should say something about your talk. If it’s an “in” joke or an acronym don’t use it.” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n</ul>\n</li>\n<li>\n<p>Closing:</p>\n<ul>\n<li>“make the last sentence in your abstract somewhat memorable, preferably short, even better if it’s actionable.” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n</ul>\n</li>\n<li>\n<p>Inclusive language, avoid ablism</p>\n<ul>\n<li>“Common examples of ableist language are words like, “lame,” “dumb,” “retarded,” “blind,” “deaf,” “idiot,” “imbecile,’ “nuts,” “psycho,” and “spaz.” These terms can be associated with a person’s identity or their challenges, and because of that, can be interpreted as insulting or hurtful. And every time people use them, they reinforce the idea that people with disabilities are somehow inferior.” - <a href=\"https://deareverybody.hollandbloorview.ca/learn/tips-and-tools/how-to-avoid-using-ableist-language/#.XcXTqJJKigQ\">https://deareverybody.hollandbloorview.ca/learn/tips-and-tools/how-to-avoid-using-ableist-language/#.XcXTqJJKigQ</a></li>\n</ul>\n</li>\n<li>\n<p>Two speakers?</p>\n<ul>\n<li>“double the speakers means double the cost. To be transparent, we do hold applications with multiple speakers to a higher standard during our evaluation.” - <a href=\"https://medium.com/uxrblog/uxrconf-2020-a-few-tips-for-crafting-a-great-speaker-application-b295e3f61260\">https://medium.com/uxrblog/uxrconf-2020-a-few-tips-for-crafting-a-great-speaker-application-b295e3f61260</a></li>\n</ul>\n</li>\n<li>\n<p>Format:</p>\n<ul>\n<li>“There’s no one right way to write a session pitch, but I’ve found the 3-part pitch works well for me. A 3-part pitch has (you’ll be amazed to hear) three key points, in order:</li>\n</ul>\n<p> State the problem\nTease the solution\nExplain how you’ll provide the rest of the solution in the session” - <a href=\"https://www.garfieldtech.com/blog/3-paragraph-pitch\">https://www.garfieldtech.com/blog/3-paragraph-pitch</a></p>\n</li>\n</ul>\n<h2>Submitting Your Talks</h2>\n<ul>\n<li>Submit lots of them</li>\n<li>\n<p>Start with 2-3 talks - some conferences like more than 1 per speaker</p>\n<ul>\n<li>“No matter how confident you are, never bet the farm on one idea—brainstorm and prepare several talks.” - <a href=\"https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32\">https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32</a></li>\n</ul>\n</li>\n<li>Relevant - tweak if necessary</li>\n<li>\n<p>Consider a workshop</p>\n<ul>\n<li>“workshops require a lot of preparation time that not every speaker has. You can improve your chances of being accepted by submitting such a workshop.” - <a href=\"https://blog.frankel.ch/advices-junior-conference-speakers/\">https://blog.frankel.ch/advices-junior-conference-speakers/</a></li>\n</ul>\n</li>\n<li>\n<p>Audience level</p>\n<ul>\n<li>“But if a conference was only filled with super-advanced talks, they would lose a huge part of their audience. So, even if you just learned something, you can teach it and many attendees will welcome your perspective as a relatively-recent beginner. Since you just went through it all for the first time yourself, you know and remember all the roadblocks that someone getting started will have and can help them learn even quicker.” - <a href=\"https://www.cfpland.com/blog/speakers-story-keanan-koppenhaver/\">Keanan Koppenhaver</a></li>\n</ul>\n</li>\n</ul>","frontmatter":{"layout":"post","title":"Submitting an Abstract","path":"/guides/speaking/submitting/","category":"Guides","tags":null,"date":null,"image":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}