{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"e5f63c1e-7ac5-5d0f-933f-a4c9094048a6","html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>As a freelance developer, it can be hard to justify the time and energy required to speak at conferences, but for George Mandis, the experience is well worth it. Like many speakers, George is an experienced software developer who’s passionate about mentoring and teaching newcomers to the field. In this week’s interview, hear more about how speaking at over 20 conferences so far has helped take George’s career to the next level.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://georgemandis.s3.amazonaws.com/holyjs-piter-2017/me-holy-js.jpg\" class=\"right\">\n<p>My name is <a href=\"https://george.mand.is/\">George Mandis</a>. I’m currently a full stack, independent web developer at <a href=\"https://snaptortoise.com/\">SnapTortoise</a> based out of Portland, Oregon, though I wear quite a few other hats. I’ve been freelancing for 13 years, but over the past 4 or 5 years I’ve gravitated towards mentorship roles. Teaching classes, workshops, leading bootcamps and working with junior developers one-on-one has been a rewarding experience and speaking feels like a natural extension to this.</p>\n<p>My first foray into speaking was actually at an Ignite event in Portland where I summarized, in 5 minutes, my experience <a href=\"https://www.youtube.com/watch?v=T2QC43jwPyM\">living as a digital nomad</a> for a year. I was terrified to speak in front of so many people, but it went well! After that I though I should look into conference speaking as a way to advance myself professionally, extend the aforementioned mentoring activities I mentioned and continue to travel and see the world, which is one my biggest passions.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/T2QC43jwPyM' frameborder='0' allowfullscreen></iframe></div>\n<h3>What do you like about speaking at conferences?</h3>\n<p><strong>Speaking at conferences is a really fun way to meet other developers and get outside perspectives on things — not just outside your particular industry, but outside your own country!</strong></p>\n<p>It’s always interesting to me to see one type of work or technology in-demand in one place and find it barely mentioned at all in another. It’s also nice to humanize other developers and put a face and a personality to a name. These conferences also have a tendency to be expensive and difficult to otherwise attend, as an independent developer. Being able to attend these conferences and pick the brain of people who work at some very large, influential tech companies is a wonderful opportunity.</p>\n<p>I think the process of preparing a talk and speaking in front of a large group people could benefit anyone’s career, but for mine it’s certainly opened some doors. <strong>Recently I joined the Google Developer Expert program, which is something that would have very likely not happened without my conference speaking.</strong></p>\n<p>The other benefit of speaking is I’ve found it’s a great opportunity to talk about the things you want to be doing, even if it’s not the thing you’re necessarily doing in your day-to-day. My talks tend to focus on creativity, art, hardware-dabbling and making interesting, outside-the-box projects through JavaScript. Speaking on these topics has allowed me to spend more time immersed in that world and meet other like-minded and very talented people with similar interests.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My very first “talk” was the 5-minute Ignite talk I mentioned earlier, but my first <em>technical</em> talk was at HolyJS in Russia. I remember applying to a number of conferences by that point in the year. Some had accepted me but had no budget for travel, but HolyJS was the first one where everything lined up.</p>\n<p>The idea of talking for a full hour was incredibly daunting — I’d never done that before! When I pulled up the conference website I became even more nervous — David Crockford and Lea Verou were two developers I’d read and followed for most of my career, and they were head-lining the conference! My attitude going in was, <strong>if this goes terribly, at least I’m 2000 miles from home and probably won’t ever run into any of these people again.</strong> It sounds funny, but it really took the pressure off!</p>\n<p>Fortunately it went well, and I’m happy to say I’ve seen several familiar faces from that conference at other conferences since then.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’m not sure I could put a number on the number I’ve applied to. I’ve spoken at something around 20 now, but can guarantee you <strong>my acceptance rate is in the single digits, percentage-wise.</strong> Like most opportunities, it really is a numbers game. You have to be diligent and persistent, but also mindful of how you might be able to tweak your proposals to better suit a particular conference’s theme.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>If I have time a day or two before the conference <strong>I like to walk to the venue from wherever I’m staying so that I’m not thinking too hard about finding it on the day I present.</strong> In the hours leading up to the presentation I practice saying key sentences and takeaways for specific slides as I go through the slide from beginning to end, over and over, and make sure all my demos work. Once it’s about 30-minutes or so to go I’ll put the slides away and just try to clear my head. This routine changes depending on how new the talk is and how comfortable I’m feeling with it.</p>\n<p><strong>I also try to see as many other talks as I can</strong>, though I that can be difficult sometimes when my nerves are racing and my talk is still looming. After I’ve given my talk I’m much more relaxed and find it easier to enjoy the other talks. I try to make a point of shaking hands with all the speakers I see and letting them know I really appreciated what they spoke on. Other speakers might have differing opinions on that, but I know I genuinely appreciate it when someone in the audience comes up to me just to let me know they enjoyed my talk.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>When it comes to applying <strong>it really is a numbers game.</strong></p>\n<p>Apply early and often and try not to get too down on yourself if your talk isn’t accepted. For topics, there are many schools of thought on this, but I personally feel sharing a case study or story about how you used a particular piece of technology to achieve a specific goal is a good approach for giving your talk structure. Talking about why technology X is cool in general way can be just fine, but sharing how we used X at Y to achieve Z gives the audience something more concrete to walk away with.</p>\n<p>If you’re giving a workshop you can dive more deeply into the nitty-gritty workings of a thing and keep your focus there, but in a 20-40 minutes talk it’s more about introducing an idea and making the case for why others should have interest in it.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>There are quite a few, but I’ll mention two people I met at my very first talk who I think are wonderful: <a href=\"https://twitter.com/LeaVerou\">Lea Verou</a> and <a href=\"https://twitter.com/g33konaut\">Martin Splitt</a>. The list could be much longer, but I’ll stick with those for fear of omitting someone! I feel both of them have real passion for the web as an open platform and convey their enthusiasm and knowledge very well when they speak.</p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>Next, I’ll be giving a talk called <a href=\"https://www.crowdsupply.com/teardown/portland-2019\">“Hacking Hardware with JavaScript” at Teardown 2019 in Portland, Oregon</a>.</p>\n<p>You can find out more about me, my projects, writing and where I’m speaking next on my website: <a href=\"https://george.mand.is/\">george.mand.is</a> and follow me on Twitter at <a href=\"https://twitter.com/georgeMandis\">@georgeMandis</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: George Mandis, Digital Nomad and Web Developer","path":"/blog/speakers-story-george-mandis/","category":"Speaker's Story","tags":null,"date":"2019/06/08","image":"https://georgemandis.s3.amazonaws.com/holyjs-piter-2017/me-holy-js.jpg"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}