{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"d3cff399-b9c6-5d85-9700-3803697392d6","html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>////</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p>I’m a Lead Designer at 8th Light, a custom software consultancy. I do UX and front-end development and work with various clients on designing and building their software.</p>\n<p>I was never interested in public speaking, but before I became a designer about 3 years ago I worked at an education-focused non-profit, and have a background in teaching, so I’ve always been pretty comfortable in the very small scale stage of a classroom. Before I started at 8th Light I volunteered doing a workshop about domestic violence, and part of my apprenticeship involved doing a talk for a small group of people, and I did that workshop.</p>\n<p>I got a lot of positive feedback, and eventually did a version of it at our internal company conference. A while later, a co-worker who was organizing a Ruby conference asked me to do a short talk about how developers could do quick usability testing, so that they could have good UX of features they were building when there wasn’t a designer in the room. That talk went pretty well despite the fact that I felt like I was going to pass out the entire time.</p>\n<p>I did that talk at another conference, but quickly felt a strong urge to go back to speaking about something I really cared about. I had been thinking for a long time about the ways that technology enables domestic violence, and had been collecting examples, but never felt like I was an “expert” enough to do a talk about it. It really seemed like something that other, smarter people were working on. But eventually I realized that wasn’t true, that if someone out there was already talking about this stuff, I couldn’t for the life of me find them.</p>\n<p>Right around that time, Russ Unger, who leads UX Camp in Chicago, responded to a proposal I’d submitted saying my topic wasn’t quite right, and he asked “is there anything else you’ve though about doing a talk about?” I told him about my idea for a talk about how tech enables domestic violence, and he said that would be perfect for the conference. I owe him a lot for taking the time to figure out that this talk was on my mind and giving me what I needed to finally do it. It took dozens of hours of research and stitching together stories from news articles and people who had disclosed their experiences to me to make my talk, but I finally did it, and ever since UX Camp I’ve had a lot of success with it.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I’m still pretty new on the conference scene but even so, <strong>I’ve already made a lot of connections with both people in my field and those outside of it.</strong> I think it’s a lot easier to meet people when you’re the one giving the presentation because 1) people already know a topic they can discuss with you which cuts out a lot of networking small talk and 2) people come up to you instead of you having to approach them every time – a real plus for an introvert like me.</p>\n<p>Also, I’ve found so far speaking is a great way to visit new places – I often take a couple of days before or after to explore the area outside of the conference hotel.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>It went well! I think I was surprised when I found out that people do actually care a great deal about their digital content and want to know how to make it better and more usable. The audience had a ton of questions, which was great. The whole thing is kind of addicting. You experience it once and think, “I want to do that again.”</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve spoken at about ten events so far with another four or five already scheduled for later this year.</p>\n<p>I’ve applied to a lot more than that for sure. I probably send out three applications a month and that number has been growing lately. But <strong>the more I apply and the more I speak, the more conferences are approaching me instead of the other way around and that’s a really nice feeling.</strong></p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/ATVKZdl_pEw?start=130' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Bailey Lewis at OKC Design Tech</em></p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I always try to see the space before I speak in it. That could mean swinging by the room before my presentation or trying to find a video of a presentation someone else gave in that room online. Seeing the space before my presentation lets me decide where to stand and helps me understand how the audience will be looking at my slides (one big screen? multiple screens around the room? etc).</p>\n<p>Other than that, <strong>I take a deep breath and remind myself: The audience came to see me present on this topic.</strong> They want it to go well as much as I do. And that’s a lot more helpful than imagining them in their underwear.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>If you’re brand new, it might be hard to find speaking gigs that will cover your travel and accommodations. The conference might even ask you to pay to attend even though you’re speaking (not my favorite practice but there you have it).</p>\n<p>Take a few of these gigs if you need to so you can get started and get your name out there, but as soon as someone offers to cover your travel/accommodations, demand it every time you speak afterward. Even better if you can throw a speaker stipend into the mix. That will probably mean saying no to conferences you’d really like to speak at, which can be painful. But once you reach certain level in your speaking career, you shouldn’t be digging in your own pockets when you’re the one providing the presentation content that will sell conference tickets and make the event successful.</p>\n<p>By the way, <strong>I love that CFP Land lists which “perks” each conference offers (travel/hotel/stipend), if any. It means I don’t have to get all the way to have my paper accepted just to realize that I’m expected to fork over a couple of grand for the privilege of presenting.</strong></p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I’m not sure about specific conference speakers (although there are presentations I’ve really enjoyed), but my father is a trial attorney and, among other speaking-related lessons, he taught me the art of giving a presentation without swaying or fidgeting. He would record me giving a presentation and then have me watch it back – it was extremely effective for getting rid of the fidgets.</p>\n<h3>Where can readers find more about you?</h3>\n<p>Find me at <a href=\"https://truematter.com/baileylewis\">truematter.com/baileylewis</a>. You can see my speaking schedule, bio, and articles I’ve written about usability and content strategy.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Eva PenzeyMoog, Designer Helping Stamp Out Domestic Abuse","path":"/blog/speakers-eva-penzeymoog/","category":"Speaker's Story","tags":null,"date":"2019/07/26","image":"https://i.imgur.com/l6UnYFz.jpg"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}