{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"ec5f5a22-107d-5a5e-9d64-e17db02a9d45","html":"<p><em>TL;DR: Back in 2017, I made a personal goal to get accepted to speak at 4\nconferences. <a href=\"https://www.karllhughes.com/posts/one-year-conference-summary\">I made\nit</a> 🎉 and used\nthe experience to launch <a href=\"https://www.cfpland.com/\">CFP Land, a free tool to help conference speakers\nkeep up with CFPs (Calls for Proposals</a>) 📣</em></p>\n<!--more-->\n<p>In 2017, I set myself a goal to <strong>get accepted to speak at 4 technical\nconferences.</strong></p>\n<p>I’m a big goals person — every month I reassess my list of personal goals,\nrecord my progress, and make adjustments as necessary — so when I set out to do\nsomething, I <em>usually</em> figure out a way to make it happen.</p>\n<img src=\"https://cdn-images-1.medium.com/max/1200/1*8lIHyJIsYF9Ci31_DOWYgg.png\" class=\"left\">\n<p>I had done enough presenting, teaching, singing and acting in my life to feel\npretty comfortable on a stage, but I had never tried to break into the tech\nconference scene. Like many software developers, <strong>I felt that I didn’t really\nhave that much to talk about, that my experience was not unique, and that\nsomeone in the audience would call me out for being a fraud.</strong></p>\n<h3>Overcoming the Fear</h3>\n<p>Grappling with the fear of inadequacy is a lifelong pursuit for many of us. I’m\nfortunate to not be crippled by it, but it still took me years to put myself out\nthere and give a technical talk.</p>\n<p>The way I overcame this fear was to <strong>start small</strong>. As I came up with talk\nideas I pitched them to local meetups and code bootcamps. After giving some of\nthese talks, I realized that the audience isn’t as scary as I thought. <em>These\nare just other developers who genuinely want to learn something, and I’m lucky\nenough to be helping them!</em></p>\n<h3>Setting the Goal</h3>\n<p>Four conferences was arbitrary. It felt like enough that I would be able to call\nmyself a “real” conference speaker, but not so many that I would have to travel\nall the time. I love traveling, but with a wife and puppy at home, I have\npractical limits.</p>\n<p>So, I settled on four, and started forming a plan for making it happen.</p>\n<h3>Making a Plan</h3>\n<p>When I create a personal goal, I don’t just write it down and check on it. The\nimportant part to goal-setting is making measurable milestones that you believe\nwill help you achieve that goal. In this case, I started by making a sub-goal:</p>\n<h4>Sub-Goal: Get Accepted to Speak at One Conference</h4>\n<ul>\n<li>✅ Write 2 conference talk proposals</li>\n<li>✅ Create slides for the proposed talks</li>\n<li>✅ Find 40+ conference CFPs</li>\n<li>✅ Submit 2 proposals to 3+ conferences per week until I get accepted</li>\n</ul>\n<p>As I worked my way through the checklist (it probably took about 12 weeks in\nall), I learned a lot about how to write a good proposal and what conferences\nusually looked for. I was very careful to read the conference’s CFP page, but\nI’ll admit that I sometimes submitted proposals that weren’t an ideal fit\nanyway.</p>\n<p>Within a few weeks, <a href=\"https://www.karllhughes.com/posts/api-strat-2017-presentation\">I had gotten my first\nacceptance</a>! Now\nI knew what it would take to get a talk accepted, and I felt like I had some\nmomentum.</p>\n<h3>Oh Yeah, I Still Have to Prepare</h3>\n<p>With one conference booked, I started refining and practicing my proposed talk.\nThe very first time I went through the slides it took me 25 minutes…for a 45\nminute speaking slot…whoops!</p>\n<p>This is where the meetups came in. After I had practiced about 12 times on my\nown, I gave my talk to the local <a href=\"https://www.karllhughes.com/posts/testing-layers-js-chicago\">Chicago Javascript\nmeetup</a>. I\npracticed solo several more times before giving it at the conference.</p>\n<img src=\"https://cdn-images-1.medium.com/max/2400/1*Va0ug0QDjguymVqLGXvU-g.png\" class=\"center\">\n<p>But while I was preparing, I was surprised to see acceptances continue rolling\nin. I ended up getting 7 accepts in the first few months of pitching my talk.</p>\n<h3>It Doesn’t Always Work Out</h3>\n<p>I was excited, but started to run into some tough decisions. One conference in\nRomania was the same weekend as a family obligation and two conferences were on\nthe exact same day, so I turned down the second one that accepted me. In another\nunexpected turn, one conference couldn’t get the attendance they needed, so it\nwas cancelled outright.</p>\n<p>That took my total for 2017/2018 down to four. A manageable number, and even\nbetter, I had hit my goal for the year! 🎉</p>\n<h3>The takeaway: CFPs seem hard, but they don’t have to be</h3>\n<p><a href=\"https://www.karllhughes.com/posts/one-year-conference-summary\">I learned a lot in that first year\nspeaking</a>, and\nwhile I’ve dialed back the number of applications I submit, I’m still actively\nengaged in the speaking community, and submitting a few CFPs per month.</p>\n<p>The whole experience has showed me that speaking isn’t as scary as it seems, and\nsubmitting winning CFPs isn’t a black art. It inspired me to create something\nthat would help other speakers — new and experienced — improve their odds of\nsuccess and become better, more prolific speakers, and thus <a href=\"https://www.cfpland.com/\">CFP Land was\nborn</a>.</p>\n<img src=\"https://i.imgur.com/IANh995.jpg\" class=\"center\">\n<h3>CFP Land: Never Miss a Call for Proposals Again</h3>\n<p><strong>One of the most frustrating things for me was when I’d discover a great\nconference in a fantastic location just a few days or weeks too late.</strong> Once the\nCFP closes, you have to wait a whole year to get back in the mix, and keeping up\nwith dozens of conferences is a lot of work.</p>\n<p>Initially, I used <a href=\"https://airtable.com/invite/r/4EaSmQNr\">Airtable</a> to store\nall the conferences I could find. Each week, I’d manually check on them and\nupdate CFP dates and links as needed. It took valuable time away from the real\nwork of writing proposals and practicing my talk, so I thought this problem\nneeded a better solution.</p>\n<p>Fortunately, other conference aggregators and CFP websites already exist, but\nthe killer feature that they were missing was a single weekly reminder of all\nupcoming CFPs.</p>\n<p>This seems obvious, but I wouldn’t have thought of it if I hadn’t spent months\napplying for CFPs. <strong>As a speaker, I don’t want a huge list of conferences or a\nbunch of noise — I just want a focused, weekly reminder of all the CFPs that\nwould be right for me.</strong></p>\n<h3>The Present and the Future</h3>\n<p>In its current iteration, <a href=\"https://www.cfpland.com/\">CFP Land</a> is an email\nnewsletter with all the upcoming CFPs listed in chronological order. <a href=\"https://twitter.com/cfp_land\">I also\nTweet each CFP</a> when it’s due in 30 days so\nfollowers have plenty of time to submit.</p>\n<p>As speakers have joined, I’ve gotten some great feedback, and am working on\nimprovements already. In the coming months, you’ll be able to filter CFPs by\nlocation, category, and whether or not travel/hotel costs are covered. I’m also\nworking to get more data from more sources so speakers are really sure to never\nmiss a CFP again.</p>\n<p>Of course, I can’t continue improving CFP Land without input from other\nspeakers! If you’re a technology conference speaker and you’ve got feedback,\nemail me at <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> or sign up below to start getting the weekly\nnewsletter 💌.</p>","frontmatter":{"layout":"post","title":"43 Conferences, 7 Offers, 4 Talks: How CFP Land Came to be","path":"/blog/how-cfpland-came-to-be/","category":"Updates","tags":null,"date":"2019/03/07","image":"https://i.imgur.com/IANh995.jpg"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}