{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"2b77b89b-d532-5451-8680-cb45eec9654b","html":"<p>With <a href=\"https://gotochgo.com/2020/\">GOTO Chicago</a> coming up in a few weeks, I wanted to highlight some of the many great speakers who\nwill be on stage this year. I’m very excited to bring you Dean Wampler’s speaker story today.</p>\n<p>Dean works in Developer Relations at Anyscale, and he’s been speaking at conferences for over 15 years. Hopefully some of his experience\nand advice can help you on your speaker’s journey, and don’t forget to check out his talk at <a href=\"https://gotochgo.com/2020/speakers/1247/dean-wampler\">GOTO Chicago in April</a>.</p>\n<!--more-->\n<h3>Tell me about yourself. What’s your job and how did you get into speaking?</h3>\n<img src=\"https://drive.google.com/uc?id=1yyA2nhTlljFPRekzmVd_zjywJuhKRUYo\" class=\"right\">\n<p>I run developer relations at a startup spun out of U.C. Berkeley, called <a href=\"https://anyscale.io/\">Anyscale</a>. We’re developing the open-source <a href=\"https://ray.io/\">Ray</a> system for distribution of Python tasks from single machines to clusters, specifically to optimize compute scenarios in reinforcement learning, hyper parameter tuning, model serving, and other compute-intensive Python applications.</p>\n<p>I started speaking at conferences over a decade ago when I first did consulting. I’ve worked in a range of roles, from engineer to VP-level management, to evangelism, and in different industries, from embedded systems and medical electronics to Internet and Big Data startups.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I enjoy public speaking, defining and delivering the arc of a story about a particular software development. I also show off my personal photography in my slides. ;)</p>\n<p><strong>It has been a huge boost to my career, both for establishing name recognition and expertise in the areas I’ve worked, as well the useful things you learn meeting a diverse range of people facing a broad list of challenges.</strong> It has been an important part of my job for most of the last 15 years or so. </p>\n<h3>What makes scaling distributed systems (and Ray in particular) such an interesting topic for you?</h3>\n<p>What attracted me to Ray is the thought that went into its design to provide a very accessible API for developers, which is easy to use, yet frees the developer from having to understand a lot of details about distributed systems. Behind that API is a very performant implementation that scales extremely well for a variety of workloads. I’m also very interested in ML approaches like reinforcement learning, so I’m learning a lot about them, as well.</p>\n<h3>Do you remember your first conference talk?</h3>\n<p>It was “Panel on the future of Aspect Oriented Programming” (with a few other speakers) at JBossTwo Conference, June 2003, San Francisco. I think it was recorded, but I believe it’s long since disappeared. I was nervous at the time, but really enjoyed the opportunity.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Easily over 30 or so.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/oCW5y4_8uGU' frameborder='0' allowfullscreen></iframe></div>\n<p><em>[Fast Data Architectures for Streaming Applications](’<a href=\"https://www.youtube.com/watch?v=oCW5y4\">https://www.youtube.com/watch?v=oCW5y4</a></em>8uGU’) by Dean Wampler_</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I’ve done it so much that I don’t get nervous very often anymore. I mostly just make sure I’m well rested, well hydrated, and I’ve reviewed the slides beforehand so the sequence of them is familiar and I’m comfortable with the phrasing I want to use for each slide.</p>\n<h3>What advice do you have for new speakers?</h3>\n<ul>\n<li>Pick a topic you are really interested in, so you’re motivated to work hard to make your talk the best it can be.</li>\n<li>Recognize that we’re all learning to one degree or another; be honest about what you know and don’t know.</li>\n<li>People enjoy hearing war stories and your quest to learn the subject, etc. </li>\n<li>When writing CFPs, the most important thing is to put yourself in the mind set of an audience member. What will attract them to your talk? What’s there for them to learn? I’ve <a href=\"https://medium.com/@deanwampler/tips-for-effective-conference-proposals-5997c9d40005\">written a whole blog post</a> about this subject. </li>\n<li>Finally, practice your talk and remove stuff so you have plenty of time and don’t overwhelm your audience with wordy, busy slides that you rush through!</li>\n</ul>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>Recently <a href=\"https://twitter.com/randyshoup\">Randy Shoup</a> has given clear, inspiring talks about “peopleware”, inspiring people from tech history, etc. When I hear a <a href=\"https://twitter.com/CatSwetel\">Cat Swetel</a> talk, I learn a lot of new ideas about project management and team processes. Those are two of many.</p>\n<p>Learn more about <a href=\"https://gotochgo.com/2020/speakers/1247/dean-wampler\">Dean Wampler and his upcoming talk at GOTO Chicago here</a>.</p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Dean Wampler, Head of Developer Relations at Anyscale","path":"/blog/speaker-dean-wampler/","category":"Speaker's Story","tags":null,"date":"2020/03/05","image":"https://drive.google.com/uc?id=1yyA2nhTlljFPRekzmVd_zjywJuhKRUYo"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}