{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"6a3d4535-a361-57d7-b57e-8d55d43b6adb","html":"<p>If you’re considering submitting a conference talk, but you’re not sure if it’s really worth it, read on. In this section, I’ve collected the most common reasons people cite for wanting to speak at conferences. </p>\n<h2>1. Developer Advocates: Professional Technical Speakers</h2>\n<p>I didn’t realize this was a job until I started speaking at conferences and met a few people who did this. “Developer Advocates” (sometimes called DevRels or Developer Evangelists) are paid to get their company’s name out into the public. It’s a lot like marketing, but with a decidedly technical bent.</p>\n<p>Most Developer Advocates still write code, help support the products they work on, and are involved in coming up with and testing new features. Because their job is to be in the public eye, many of them are very prolific speakers. </p>\n<blockquote>\n<p>During my first year [in Developer Relations] at Okta…I spoke 37 times, at 20 conferences, in 10 different countries.\n<em><a href=\"https://developer.okta.com/blog/2019/01/28/developer-relations-pro-tips\">Matt Raible</a></em></p>\n</blockquote>\n<p>While an element of their job may require speaking, many also do it for other reasons you’ll read about below.</p>\n<h2>2. Promote a Business or Project</h2>\n<blockquote>\n<p>“Speaking at conferences is a good way to boost my career prospects as a technology consultant.”\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-jason-swett/\">Jason Swett</a></em></p>\n</blockquote>\n<p>Small business owners and consultants are always looking for an edge, and for many getting recognition by speaking at conferences is a great opportunity. Not only do they get to make a name for themselves, they may meet people in the audience who actually want to hire them.</p>\n<blockquote>\n<p>“Some of the connections I’ve made at conferences and meetups have definitely helped me land further speaking gigs and new clients.”\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-keanan-koppenhaver/\">Keanan Koppenhaver</a></em></p>\n</blockquote>\n<p>Some developers also use speaking as an excuse to plug open source products they want to support.</p>\n<blockquote>\n<p>“I try to contribute to some [open source] libraries also, but promoting them on stage feels like the best thing that I’m capable of doing. If something makes my life better, and some people invest their efforts and share it for free — I want to help them to gain exposure.”\n<em><a href=\"https://medium.com/@tryshchenko/why-am-i-doing-public-speaking-at-tech-events-the-honest-answer-a75d80f85cfd\">Oleksandr Tryshchenko</a></em></p>\n</blockquote>\n<h2>3. Help Others</h2>\n<blockquote>\n<p>“What I like about public speaking is that it puts me in a new place to help other people. I am thrilled that I’m providing content that people want to hear, and content that they can take something from to apply to their lives.”\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-rhia-dixon/\">Rhia Dixon</a></em></p>\n</blockquote>\n<p>One of the most common answers I hear from people about why they got into public speaking is their desire to help others. Speaking is rarely a financially lucrative gig, so it’s a good thing that people find fulfillment just by spreading their knowledge. </p>\n<blockquote>\n<p>“I try as much as possible to help other people get into tech, or get better at tech. Knowing I helped at least one person by being on stage and sharing my knowledge makes me feel a bit better about that.”\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-alex-lakatos/\">Alex Lakatos</a></em></p>\n</blockquote>\n<p>Even if a topic has been spoken about before, there are always new people coming into the industry who need to learn about it. Many speakers realize that their unique spin on something might shed new light on it.</p>\n<blockquote>\n<p>“It’s really cool that the way I present something or specifically explain something can help make whatever I’m talking about click with someone in a way that it hasn’t before.”\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-kara-luton/\">Kara Luton</a></em></p>\n</blockquote>\n<p>While there are plenty of other ways to help others out, it is nice to be able to do it en masse.</p>\n<blockquote>\n<p>“I enjoy being able to share my advice with a lot of people at once. It is like mentoring or giving advice on steroids.”\n<em><a href=\"https://www.cfpland.com/blog/speaker-molly-struve/\">Molly Struve</a></em></p>\n</blockquote>\n<h2>4. Meet People</h2>\n<blockquote>\n<p>“It’s great to be able to speak about the thing you’re interested in in front of a lot of people, because it means for the rest of the conference the other people who share your passion will come up and talk to you.”\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-nicola-rushton/\">Nicola Rushton</a></em></p>\n</blockquote>\n<p>I never really started meeting people at conferences until I started speaking at them. Like many software engineers, I get intimidated by large groups of new people, but after speaking, attendees would come up to me and introduce themselves. It took a ton of the pressure off of meeting new people.</p>\n<blockquote>\n<p>“I think it’s a lot easier to meet people when you’re the one giving the presentation because 1) people already know a topic they can discuss with you which cuts out a lot of networking small talk and 2) people come up to you instead of you having to approach them every time”\n<em><a href=\"https://www.cfpland.com/blog/speakers-bailey-lewis/\">Bailey Lewis</a></em></p>\n</blockquote>\n<p>Local meetups are great for seeing friends and meeting people too, but at a conference, you can meet people from around the world. There’s nothing like it.</p>\n<blockquote>\n<p>“Speaking at conferences is a really fun way to meet other developers and get outside perspectives on things — not just outside your particular industry, but outside your own country!”\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-george-mandis/\">George Mandis</a></em></p>\n</blockquote>\n<p>If you do start speaking at conferences, don’t miss out on the chance to meet new people. Even if it’s just a few of the other speakers, take advantage of the connections you can make at conferences.</p>\n<blockquote>\n<p>“Too many speakers finish their talk and then rush off to catch a plane, or hole themselves up in a hotel room to get back on top of email. If you do this, you’re missing out on one of the most valuable aspects of an event: the networking.”\n<em><a href=\"https://blog.prezi.com/speaking-at-a-conference-here-are-10-things-the-organizer-wants-you-to-keep-in-mind/\"></a></em></p>\n</blockquote>\n<h2>Recognition</h2>\n<ul>\n<li>“There’s something impressive about going to a city for the first time, and have people walk up and introduce themselves to me, mentioning past talks or blog posts.” - <a href=\"https://www.cfpland.com/blog/speakers-story-gant-laborde/\">https://www.cfpland.com/blog/speakers-story-gant-laborde/</a></li>\n<li>People came up to me after my talk, “you were the washing machine, guy, right?”</li>\n<li>“Some people have a bunch of Twitter followers and YouTube views, and this seems to make them happy. Building your public brand by speaking at conferences can be a way to work towards this.” - <a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0</a></li>\n</ul>\n<h2>Travel</h2>\n<ul>\n<li>\n<p>“I’ve found so far speaking is a great way to visit new places – I often take a couple of days before or after to explore the area outside of the conference hotel.” - <a href=\"https://www.cfpland.com/blog/speakers-bailey-lewis/\">https://www.cfpland.com/blog/speakers-bailey-lewis/</a></p>\n</li>\n</ul>\n<h2>Personal growth</h2>\n<ul>\n<li>“I’ve been incredibly fortunate to get to meet and become friends with some of my heroes in the industry as a result of speaking at conferences. That’s probably the biggest benefit for me.” - <a href=\"https://www.cfpland.com/blog/speakers-story-joe-mastey/\">Joe Mastey</a></li>\n<li>“Speaking also establishes your authority in your subject area, and it gives you the chance to genuinely help people learn something new. This teaching aspect is especially important to me.” - <a href=\"https://www.cfpland.com/blog/speakers-story-laura-janusek/\">Laura Janusek</a></li>\n<li>“I was given the opportunity to create a course for Lynda.com because I met Lynda.com staff author Ray Villalobos after we both spoke at a conference. It turned out that we were both speaking at another conference a few months later, so he made a point to check out my talk at that conference. He enjoyed it so he recommended me as a course author. Prior to that I had not even considered authoring a course, and after he sold me on the idea, it because a reality that never would have been had I not met Ray.” - <a href=\"https://www.cfpland.com/blog/speakers-story-john-riviello/\">John Riviello</a></li>\n<li>“Recently I joined the Google Developer Expert program, which is something that would have very likely not happened without my conference speaking.” - <a href=\"https://www.cfpland.com/blog/speakers-story-george-mandis/\">George Mandis</a></li>\n<li>“I grew up with a fatal sickness (that I still have) where I couldn’t do much and I often felt like I’d never amount to much, so in some ways, I guess I’ve been drawn to public speaking to overcompensate.” - <a href=\"https://www.cfpland.com/blog/speakers-story-tejas-kumar/\">https://www.cfpland.com/blog/speakers-story-tejas-kumar/</a></li>\n<li>“The more I present the more confident I become in my abilities to do so. This has helped with my social anxiety and with my ability to interact with clients or potential clients.” - <a href=\"https://www.cfpland.com/blog/speakers-mike-miles/\">https://www.cfpland.com/blog/speakers-mike-miles/</a></li>\n<li>“Speaking at conferences has definitely helped to improve my presentation skills. I am more confident in speaking in front of groups of people who I don’t know whereas before I would get nervous and my anxiety levels would go through the roof.” - <a href=\"https://www.cfpland.com/blog/speakers-rizwan-javaid/\">https://www.cfpland.com/blog/speakers-rizwan-javaid/</a></li>\n<li>“you can be introverted, awkward, and socially anxious, and still be a great conference speaker and get a ton of benefit from doing it.” - <a href=\"https://www.cfpland.com/blog/speakers-eva-penzeymoog/\">https://www.cfpland.com/blog/speakers-eva-penzeymoog/</a></li>\n</ul>\n<h2>Finding jobs</h2>\n<ul>\n<li>”[Meetups] can also be a great way to learn more about companies in your area, or to get a leg up in your next local job search.” - <a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0</a></li>\n<li>“During job interviews, I’ve had interviewers tell me how much they loved my talks!” - <a href=\"https://www.cfpland.com/blog/speaker-anjuan-simmons/\">https://www.cfpland.com/blog/speaker-anjuan-simmons/</a></li>\n</ul>\n<h2>Thrilling</h2>\n<ul>\n<li>“Public speaking is very energizing, probably similar to drugs, but with no bad side-effects!” - <a href=\"https://www.cfpland.com/blog/speaker-nicolas-frankel/\">https://www.cfpland.com/blog/speaker-nicolas-frankel/</a></li>\n</ul>\n<h2>Passion</h2>\n<ul>\n<li>“These are real people who are being controlled, beaten, and murdered - and we in tech have a role to play in preventing it from happening.” - <a href=\"https://www.cfpland.com/blog/speakers-eva-penzeymoog/\">https://www.cfpland.com/blog/speakers-eva-penzeymoog/</a></li>\n<li>“I’ve always been fascinated by the ability of human speech to change the world, and I hope that my public speaking is a small brick in the enormous wall of humanity’s ongoing attempt to make ourselves better.” - <a href=\"https://www.cfpland.com/blog/speaker-anjuan-simmons/\">https://www.cfpland.com/blog/speaker-anjuan-simmons/</a></li>\n</ul>\n<h2>Learn new things</h2>\n<ul>\n<li>“it’s an excuse to learn and play with new technology. I wouldn’t have become passionate about the OpenAPI spec if a conference hadn’t given me a chance to speak on it for example. And because my day job tends to focus more on boring tech that works, giving conference talks lets me experiment with stuff I know we wouldn’t touch at work.” - <a href=\"https://www.cfpland.com/blog/speakers-story-matthew-trask/\">https://www.cfpland.com/blog/speakers-story-matthew-trask/</a></li>\n<li>“When I submit a talk proposal it’s usually on a topic that I am not an expert on, but one that I am interested in learning more about. I then have a motivator to deep dive into the topic to learn about it.” - <a href=\"https://www.cfpland.com/blog/speakers-mike-miles/\">https://www.cfpland.com/blog/speakers-mike-miles/</a></li>\n<li>\n<p>“Building demos can really help you with learning the ins and outs on a topic and you never know what you may uncover.” - <a href=\"https://www.cfpland.com/blog/speaker-taelur-alexis/\">https://www.cfpland.com/blog/speaker-taelur-alexis/</a></p>\n<ul>\n<li>“While writing talks are a huge time commitment, there is nothing quite like explaining a concept to others to help crystalize it in your mind.” - <a href=\"https://www.cfpland.com/blog/speakers-story-laurie-barth/\">Laurie Barth</a></li>\n</ul>\n</li>\n</ul>","frontmatter":{"layout":"post","title":"Why Speak? The Reasons People Get on Stage","path":"/guides/speaking/why-speak/","category":"Guides","tags":null,"date":null,"image":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}