{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"0c1845b4-4056-5a23-91e6-6c4c99ef3b99","html":"<!--more-->\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/9HuvC1ME68I' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Anjuan Simmons at The Lead Dev Austin</em></p>\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/tChR2X7.png\" class=\"left\">\n<p>Other than being married to Liron and a father to Yaara and Yuval, I’m also working at Nielsen, the data and measurement company. I work for a division called Nielsen Marketing Cloud, as the tech lead of the big data group (sometimes people confuse “tech lead” with “team lead”, so I wrote a <a href=\"https://medium.com/nmc-techblog/tech-lead-dont-you-mean-team-lead-c8bde92e38ab\">short post</a> to explain what I see as a tech lead 😃).</p>\n<p>In addition to that, I’m also a co-founder and a core team member of the Israeli chapter of <a href=\"https://www.womeninbigdata.org/\">Women in Big Data</a>.</p>\n<p>I actually got into public speaking more than 10 years ago, when I was invited to give a talk about Mainframes to a group of young soldiers during their basic programming course in the army. I really enjoyed it, and since then I’ve had the chance to talk about various topics in several different forums, ranging from internal sessions, through local meetups, all the way to international conferences.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>While speaking at conferences is not part of my job per se, I’m sure it’s beneficial for my career in the long run, but that’s definitely not the main reason for me to do it.\nThe main reason is actually the fact that it gives me an opportunity to meet a lot of smart people and share my knowledge with them - I absolutely love it!\nThere are two added bonuses for speaking at conferences:\nI get to attend other talks and learn from others as well.\nAfter I give a talk, people come up to me and ask questions, which always leads to very interesting conversations.\nBottom line - speaking at conferences is an awesome experience!</p>\n<h3>What topics do you typically speak about?</h3>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<h3>Do you have a pre-talk routine?</h3>\n<h3>What advice do you have for new speakers?</h3>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<h3>Where can readers find more about you?</h3>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Itai Yaffe, Big Data Tech Lead and Conference Speaker","path":"/blog/speaker-itai-yaffe/","category":"Speaker's Story","tags":null,"date":"2019/09/23","image":"https://i.imgur.com/tChR2X7.png"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}