{"pageContext":{"isCreatedByStatefulCreatePages":false,"group":[{"post":{"html":"<p>Leading up to <a href=\"https://gotochgo.com/2020/\">GOTO Chicago</a>, I decided to reach out to some of the speakers who I\nwas most excited to see this year. I’m really glad Danielle Pollard - a fellow Chicagoan - got back to me to share\nher story.</p>\n<p>In addition to her professional work as an Agile Lead, Danielle has a passion for lifting up those in the community\nwho most need help. While she’s relatively new at speaking at conferences, Danielle has been winning speaking competitions\nsince grade school, so read on to hear some of her candid and helpful advice.</p>\n<!--more-->\n<h3>Tell me about yourself.</h3>\n<img src=\"https://drive.google.com/uc?id=1fPEc4sWvfbW3_Gu2gkuu5nhfr9ki_4l0\" class=\"right\">\n<p>I’m currently an Agile Coach for Spot Hero in Chicago. SpotHero is a digital parking reservation service that connects drivers looking to reserve and pay for parking spaces with parking lots, parking garages and valet services.</p>\n<p>I believe that trust is hands down the #1 force multiplier for high performance, and I’ve used that belief to create results as a project management consultant and Lean/Agile transformation coach for best in class companies like UPS, Kohler, Blue Cross Blue Shield, Yellow-Roadway, RR Donnelley, Allstate, Apartments.com, US Foods.</p>\n<p>I’m also working closely with <a href=\"http://fchnwecare.com/\">FCHN</a>, a Soup Kitchen on the south side of Chicago focused on feeding, clothing and helping the needy. FCHN has been serving the community with hot meals 6 days a week for over 32 years. They are struggling to keep the lights on and I’m determined to turn things around for them.</p>\n<p>I’ve been able to impact the lives of hundreds of inner city youth and aspiring women entrepreneurs through nonprofits I work with, and in my non-existent “spare time” you can find me reading, eating some juicy carnivorous meal (scotch included) or being a personal barber for my two boys.</p>\n<h3>How did you get into public speaking?</h3>\n<p>In 4th grade my teacher was fed-up with my antics and inability to remain quiet and stay in my seat during class so she encouraged me to participate in the upcoming Speech Contest. I did. I won. And won and won and won until I became the 2nd Place winner in the Chicago-Wide Oratory competition.</p>\n<p>Never looked back.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I love speaking at conferences because I get a chance to meet some pretty awesome like-minded professionals, learn from them and share my ideas. Mostly for the love of helping and inspiring others and that has definitely enhanced my work as an Agile Coach without a doubt!</p>\n<h3>What makes Agile team leadership such an interesting topic to you?</h3>\n<p>It’s exciting for me because I love building resilient and learning teams that are able to handle anything that comes their way with top notch skill, professionalism and an unwavering focus on delivering value to both the business and the customer. Change is the only constant and I help teams and companies embrace and leverage it as a competitive advantage.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>It was for the Agile Professional Learning Network’s annual conference. It went a whole lot better than I thought. I didn’t know what to expect but I showed up and did my best and people seemed to like that.</p>\n<p>What I remember most is that my mom came and sat right in the front. She was supposed to record it for me but ended up getting so caught up in the presentation she completely forgot.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>My pre-talk routine includes prayer and for some reason I always get one more brilliant idea that I try to add in at the last minute…I don’t know what that’s about.</p>\n<p><strong>I also use lots of positive self-talk because I get extremely nervous.</strong> I remind myself to focus on the message and not me.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>The best advice I can give is just sharing four things that I always try to remember for myself:</p>\n<ol>\n<li>A seasoned speaker once told me, “the audience is actually rooting for you, because they’re thinking about if it were them and how unnerved they would be. They want you to do well.”</li>\n<li>If you didn’t belong here, you wouldn’t be here. So relax.</li>\n<li>Proper Preparation Prevents Piss Poor Performance…being prepared and practiced helps eliminate fear and build confidence.</li>\n<li>Be yourself. Authenticity goes a long way.</li>\n</ol>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>Locally, I love to hear <a href=\"https://twitter.com/zacharylbeer\">Zachary Beer</a> speak. He is smart, funny, and authentic as f*ck!</p>\n<p>Learn more about <a href=\"https://gotochgo.com/2020/speakers/1281/danielle-pollard\">Danielle’s talk at GOTO Chicago 2020 and how you can contact her here</a>.</p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Danielle Pollard, Agile Coach and Community Supporter","path":"/blog/speaker-danielle-pollard/","category":"Speaker's Story","tags":null,"date":"2020/03/02","image":"https://drive.google.com/uc?id=1fPEc4sWvfbW3_Gu2gkuu5nhfr9ki_4l0"}}},{"post":{"html":"<p><a href=\"https://gotochgo.com/2020/\">GOTO Chicago 2020</a> is coming up in just a few weeks, so I’m featuring some of the wonderful\nlineup of speakers that I’ll hopefully get to meet in person. Today, I’m happy to bring you Avdi Grimm,\na Ruby developer and professional paired programmer who will be giving a talk on programming and philosophy (I love these kind\nof talks).</p>\n<p>In this interview, Avdi shares some of his thoughts on how code is used as a model for life and the benefits he’s seen\nfrom 10 years of public speaking.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://drive.google.com/uc?id=1Yke3jpFDhT96A8qM5vGn1zAHS2bUBDSW\" class=\"right\">\n<p>I’m a developer who spends most of his time coaching and educating other developers these days. My primary source of income is <a href=\"https://www.rubytapas.com/\">RubyTapas.com</a>, a subscription screencast site I created for developers nine years ago. I specialize in making frequent, short, tightly-edited videos that introduce developers to one new and useful idea at a time.</p>\n<p>I got started speaking around 2010. <strong>I think my biggest reason was that back then I was under the misapprehension that I was an introvert, and speaking seemed like a handy socialization hack.</strong> The idea was, if I give a talk, people will introduce themselves to me!</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I love public speaking for its own sake, and I also very much enjoy traveling and meeting people. Speaking is interesting because on the one hand, it has been instrumental to my career. But on the other hand, it’s hard to trace the individual strands of causality. <strong>Many of my most delightful opportunities have stemmed from friends I made at a conference years earlier.</strong></p>\n<h3>What makes the intersection of philosophy and software such an interesting topic to you?</h3>\n<p>I honestly believe that <strong>programming is fundamentally the practice applied philosophy.</strong> We use code to model ways of thinking about the world we live in. And when our code is used by large numbers of people, it impacts how they see the world.</p>\n<p>That’s a lot of power, and a lot of responsibility. It’s also an opportunity: learning to think critically and intentionally about the philosophical nature of our work can reveal new ways to bring our values and our work into alignment.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I think my first-ever talk was at an open-source conference in Harrisburg, Pennsylvania. It was about tools for remote work, and it was not well-attended 😅</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I used to meditate a bit to calm myself down, with limited success. These days my favorite way to get ready is to be distracted by a conversation with an attendee until the moment comes to go on stage.</p>\n<h3>What advice do you have for new speakers?</h3>\n<ul>\n<li>Submit early, submit often.</li>\n<li>It’s OK to submit an abstract on a topic you want to understand better: getting accepted will give you a great excuse to learn about it!</li>\n<li>In both proposals and the talks themselves, lead with a problem, not with information. What is your ideal audience-member worried about or frustrated with?</li>\n<li>Don’t agonize over long articles about all the things you need to remember in order to give a good talk. Give yourself permission to suck at every aspect of doing your talk except one. E.g. maybe you’ll suck at slides, pacing, narrative arc, delivery… BUT you’ll have some really funny stories! Then, in later talks, pick ONE new aspect to do be better at each time.</li>\n</ul>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/k-Q_dXVQM1c' frameborder='0' allowfullscreen></iframe></div>\n<p><em>”[No Return: Moving beyond transactions in software and in life](<a href=\"https://www.youtube.com/watch?v=k-Q\">https://www.youtube.com/watch?v=k-Q</a></em>dXVQM1c)” by Avdi Grimm_</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>Too many to list. These days I’m most inspired by slam poets: the way someone like <a href=\"https://www.youtube.com/watch?v=yfJG4Etbt4Y\">Buddy Wakefield</a> can hold a room spellbound with words is amazing.</p>\n<p>Learn more about <a href=\"https://gotochgo.com/2020/speakers/1288/avdi-grimm\">Avdi’s talk at GOTO Chicago 2020 and how you can contact him here</a>.</p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Avdi Grimm, Software Developer and Screencaster","path":"/blog/speaker-avdi-grimm/","category":"Speaker's Story","tags":null,"date":"2020/02/28","image":"https://drive.google.com/uc?id=1Yke3jpFDhT96A8qM5vGn1zAHS2bUBDSW"}}},{"post":{"html":"<p>In preparation for <a href=\"https://gotochgo.com/2020/\">GOTO Chicago 2020</a>, I am talking to some of the conference’s speakers about\nhow they got into speaking and what their advice is for new speakers. This week, I’m featuring my interview with Denise Yu, a\nSenior Software Engineer at GitHub who has found speaking to be a great springboard for her career in tech.</p>\n<p>Like many speakers I’ve talked to over the past year, Denise comes from a nontraditional background, and is deeply passionate about helping\nother speakers get their starts. She also included some great recommendations for other speakers to watch, so be sure\nto look for that section towards the end.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p>I’m about to start a job as a Senior Software Engineer at GitHub, working on the Community &#x26; Safety team. I previously worked at Pivotal in their Cloud R&#x26;D business, where I wrote lots of YAML and pair-programmed everyday.</p>\n<p>I make tech art — mostly, doodling things quickly when I’m watching people speak at conferences, but also cat-related doodles of technical concepts, at <a href=\"https://deniseyu.io/art/\">deniseyu.io/art</a>. I started public speaking when I was about 12 years old, because at that time I thought I wanted to grow up and become a lawyer. I joined my school’s debate club, and spent about the next 12 years participating, judging, teaching, and facilitating competitive debate, Model UN, Mock Trial, and lots of other speaking-related extracurricular activities.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>For me, technical speaking has been a pretty significant career accelerator. I’ve met gracious and talented engineers who I consider to be mentors and sponsors, and <strong>I’ve been able to network my way into every single job I’ve taken, after my first job in tech, either as a direct or indirect result of my participation in public speaking at meetups and conferences. There’s no such thing as being too junior when you’re brave enough to get up in front of an audience and share what you know.</strong></p>\n<p>Speaking has never officially been part of my job, but I’ve been lucky to have had employers who supported my speaking endeavors by granting me paid time off to travel to conferences.</p>\n<h3>What makes distributed systems such an interesting topic for you?</h3>\n<p>I career-switched and didn’t study computer science in undergrad, so I have a persistent sense of imposter syndrome around missing out on foundational knowledge.</p>\n<p>I started becoming interested in the mechanics of distributed computing while debugging RabbitMQ issues in production a few years ago. I can’t remember the specifics now, but a customer experienced a network partition, and the RabbitMQ cluster nodes came back to life in an unexpected order, which caused a host of unexpected side effects.</p>\n<p>I had such poor understanding of the design decisions for partition recovery strategies, that I decided to start doing my own research, and uncovered a world of deep, deep academic research into resilience engineering for distributed systems. For someone with no computer science background, I found the reading material out there to be targeted at advanced practitioners, and it was so difficult to me to get started on learning about distsys, so I did the reasonable thing, which was to submit a talk proposal to DevOpsDays London promising to compare partition recovery strategies between a few popular open-source databases. (Side note: This was not a reasonable thing to do.)</p>\n<p>While I was writing this talk, I was also reading Martin Kleppmann’s book “Designing Data-Intensive Applications”, and I realized that before I could even talk about network partition recovery strategies, I had to spend a significant amount of time laying groundwork around why these strategies even needed to exist in the first place. The talk evolved from “RabbitMQ vs. Kafka vs. Cassandra” into a more general discussion of why distributed systems are so hard to understand, operate, and maintain. I think that as this talk has further iterated and evolved, the constant thread has been that distributed systems are difficult to learn about, and there is always space to revisit the fundamentals.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>The first conference I spoke at was SwanseaCon in 2017. I delivered a talk titled “Building Empowered Teams at Scale”. I am not sure if it was recorded, but <a href=\"https://deniseyu.io/talks\">the slides are available on my website</a>.</p>\n<p>I pitched the talk because in my first few months at Pivotal, I saw that the product teams were so much more empowered to make their own decisions, than previous teams I’d worked on, and I thought that some pieces of our philosophy around building and managing teams would be interesting to share with the world.</p>\n<p><strong>I was terrified - not about presenting in public, but specifically about speaking to a room full of engineers who knew a lot more about software and organizations than I did.</strong> I remember being so nervous about the talk that I started writing it seven months in advance. My manager helped me connect with people in leadership within the org to interview about their perspectives — which actually ended up being a really cool way to build rapport with very senior-level folks that I didn’t have day-to-day contact with.</p>\n<p>I think the talk went well - to be honest, my brain completely blurs out the exact memories of being on stage usually - but I was proud that I had pushed myself to pitch, create, and deliver a full-length conference talk, about 2.5 years into my career in tech so far.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I think I’ve spoken at upwards of 20 conferences. I’ve applied to more - I think I applied to 10 conferences last year and got accepted to 7. This year I’ve been recycling talks and being less ambitious about submitting, because I’m switching jobs and want to invest my energy in getting ramped up.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>When I develop a new talk, I spend a lot of time doing research. I actually <a href=\"https://deniseyu.io/2018/09/24/writing-tech-talks.html\">blogged about my process here</a>!</p>\n<p>As a former debate kid, <strong>the key thing that’s always worked for me is practicing in front of diverse test audiences before the big day.</strong> When I lived in London and was developing new talks regularly, I had a crew of tech friends who didn’t work with me at Pivotal, and I’d invite them over, cook them dinner, feed them wine and beer, and run my talk for them and ask for feedback. This always caught “Pivotal-isms” that I subconsciously put in, and it’d be a good way to level-set about whether my talk made sense to people who didn’t work on the same types of software that I did.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>I also have decks on this! I sometimes help local meetups with training new speaker and drumming up talk submissions for CFPs. <a href=\"https://deniseyu.io/techtalks\">Here’s the 15-minute deck that I usually run</a>.</p>\n<p>For new speakers, particularly folks with non-linear trajectories into the tech industry like myself, I always tell them this: <strong>Your story is interesting. You have a unique voice and set of experiences, and someone out there wants to hear your story.</strong></p>\n<p>It’s great to get started with smaller and lower-pressure speaking environments like meetups and possibly even presenting to bootcamp students or university student groups.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/RQrNOMO7UDk' frameborder='0' allowfullscreen></iframe></div>\n<p><em>”<a href=\"https://www.youtube.com/watch?v=RQrNOMO7UDk\">How to Tech Talk</a>” by Denise Yu</em></p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>Loads! I aspire to give talks as badass as the ones by <a href=\"https://www.youtube.com/watch?v=1xQeXOz0Ncs\">Nick Means</a> one day. <a href=\"https://www.youtube.com/watch?v=r2BFTXBundQ\">Elisabeth Hendrickson</a> is such an open and warm storyteller, the fearlessness of <a href=\"https://www.lizrice.com/talks-archive\">Liz Rice’s live demos</a> make my FitBit think I’m doing cardio, I don’t know how <a href=\"https://www.youtube.com/watch?v=8bZh5LMaSmE\">Sandi Metz</a> holds and communicates so many parallel threads of thought so clearly.</p>\n<p>Also can’t not mention <a href=\"https://www.youtube.com/watch?v=KClAPipnKqw\">Tanya Reilly</a>, Laura Nolan, <a href=\"https://www.youtube.com/watch?v=-X0hfrnbULs\">Liz Fong-Jones</a>, and <a href=\"https://www.youtube.com/watch?v=vpsrow58s0E\">Liz Keogh</a>. There are so, so many people I look up to, that I’m trying to learn from, while developing my own style.</p>\n<p>Learn more about <a href=\"https://gotochgo.com/2020/speakers/1312/denise-yu\">Denise’s talk at GOTO Chicago 2020 and how you can contact her here</a>.</p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Denise Yu, Tech Artist and Software Engineer","path":"/blog/speaker-denise-yu/","category":"Speaker's Story","tags":null,"date":"2020/02/25","image":"https://drive.google.com/uc?id=1FGh0fH-Cn9lABXYu1PvqIDkUjp5gh7v-"}}},{"post":{"html":"<p>This year, I’ll be attending <a href=\"https://gotochgo.com/2020/\">GOTO Chicago</a>, so leading up to the event, I wanted to highlight some of the\nspeakers who will be presenting. I was really excited to hear from Bruce Lawson because HTML is such a core piece of technology for\nthe web, but so many of us take it for granted. As a member of the W3C’s HTML5.3 specification team and writer on the topic, I knew\nBruce would make for an interesting speaker to feature here.</p>\n<p>Read on to hear about Bruce’s wide-ranging experience from music to acting to accessibility, and some of his tips for new speakers.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p>I’m an accessibility and web standards consultant (<a href=\"https://www.brucelawson.co.uk/\">you can hire me!</a>). Side projects are music: <a href=\"https://www.brucelawson.co.uk/category/my-music/\">writing and recording</a> and developing a new product called <a href=\"https://twitter.com/swordcello\">SwordCello</a>, which isn’t released yet. I got into public speaking as a kid, when I was an actor.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>It used to be an integral part of my job in Developer Relations for Opera, now it’s for fun - it’s a good way of seeing old friends or visiting a new city. It’s definitely benefited my career, and hopefully helped my audience’s careers, too.</p>\n<h3>What makes HTML such an interesting topic for you?</h3>\n<p>HTML is the foundational language of the web: the greatest store of knowledge (and bullshit) ever. It’s forwards and backwards compatible. It’s developed to be accessible, work with any human language or script and to be secure. What’s not to love?</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/f6As5HEkG5E' frameborder='0' allowfullscreen></iframe></div>\n<p><em>”<a href=\"https://www.youtube.com/watch?v=f6As5HEkG5E\">Ensuring a High Performing Web for the Next Billion People</a>” by Bruce Lawson at Velocity Amsterdam</em></p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>It was a 15 minute talk about accessibility in the Netherlands. It went OK, as I remember. But it was very dry.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Ooh, about 150 I think. I probably only applied to about 10; the rest were invitations from the conference organiser.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>Safety pee; check zip is up; make sure you have water (not sparkling, else you might burp down the mic). Go through your slides one last time.</p>\n<h3>What advice do you have for new speakers?</h3>\n<ul>\n<li>Even if you think your subject has been spoken about before, you’re bringing your own unique slant to it.</li>\n<li>Make sure you tell a story - you have a beginning, middle and end.</li>\n<li>Don’t spend ages introducing yourself.</li>\n<li>Never claim something is easy or obvious, just because it is to you.</li>\n<li>Put in a few jokes.</li>\n<li>Relax. If you dry up and can’t remember the next bit, take a sip of water so you don’t feel like a deer in the headlights.</li>\n<li>Don’t take questions; tell the audience that you’ll be around the venue and they are more than welcome to approach you and ask you questions.</li>\n</ul>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p><a href=\"https://twitter.com/SaraSoueidan\">Sara Soueidan</a> for her energy and passion; <a href=\"https://twitter.com/mathias\">Mathias Bynens</a> for his geekery and humour; <a href=\"https://twitter.com/jaffathecake\">Jake Archibald</a> for his knowledge and wit; <a href=\"https://twitter.com/sarah_edo\">Sarah Drasner</a> for her enthusiasm and knowledge. However, I learn from almost every talk I attend.</p>\n<p>Learn more about <a href=\"https://gotochgo.com/2020/speakers/1263/bruce-lawson\">Bruce’s talk at GOTO Chicago 2020 and how you can contact him here</a>.</p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Bruce Lawson, HTML5 Spec Editor and Musician","path":"/blog/speaker-bruce-lawson/","category":"Speaker's Story","tags":null,"date":"2020/02/20","image":"https://drive.google.com/uc?id=1F2ECoS80xRLABMFLcBOgPZhZWAgX6D65"}}},{"post":{"html":"<p>I launched <a href=\"/members/\">CFP Land Pro</a> back in 2019. After gathering feedback from hundreds of technology conference speakers, I realized that like me, many of them struggled to find and keep up with which CFPs were available and which ones they had applied to. Additionally, I wanted to find a way to make sure CFP Land was self-sustaining, so CFP Land Pro was born.</p>\n<p>If you’re considering a <a href=\"/members/\">Pro Membership</a>, read on to learn more about everything that’s included. Don’t hesitate to <a href=\"mailto:info@cfpland.com\">email me</a> if you have questions about how CFP Land can help you be a more successful speaker.</p>\n<!--more-->\n<h2><span id=\"early-access\">1. Early Access to CFPs</span></h2>\n<p>The weekly CFP Land newsletter and <a href=\"/conferences/\">our free conference listings</a> show all CFPs that close in the next 21 days. Usually this is plenty of time to apply, but many conferences review applicants on a rolling basis. In those cases, <strong>applying as early as possible is advantageous</strong>.</p>\n<p>One of the most popular features among Pro Members is the early access to CFPs. If you’re not a Pro Member already, you won’t see any conferences tagged <code class=\"language-text\">⬆️ Pro</code> in your feed, but if you sign up for a Pro Membership, here’s what it looks like:</p>\n<p><a href=\"/members/\"><img src=\"/img/posts/pro-early-access.png\" alt=\"Pro Members get access to CFPs 21 days before free members\"></a></p>\n<p>As a Pro Member, you can see all the CFPs in our database that are closing in the next <strong>42 days</strong>, meaning you’ll be able to apply much earlier than free users.</p>\n<h2><span id=\"save-cfps\">2. Save CFPs</span></h2>\n<p><a href=\"/members/\"><img src=\"/img/posts/save-cfps-1.gif\" class=\"right\" alt=\"Save conferences to be reminded before they close\"></a></p>\n<p>It’s easy to lose track of which CFPs you want to submit when there are hundreds each month on CFP Land alone. <strong>Saving CFPs is a great way to keep up with the conferences that you care about most.</strong></p>\n<p>Once you save a CFP to your Pro account, you’ll get email reminders 21, 7, and 3 days before it closes. This is great if you’re browsing CFPs on mobile, but you don’t want to forget to submit to them when you’re back at your computer.</p>\n<p>Another useful reason to save CFPs is to personalize your feed of upcoming Calls for Proposals. By default, there may be 50 to 100 open CFPs on the “All” page, so saving CFPs will ensure you don’t have to wade through quite as many irrelevant conferences.</p>\n<h2><span id=\"export-cfps\">3. Export CFPs to Your Personal Calendar</span></h2>\n<p><a href=\"/members/\"><img src=\"/img/posts/export-cfps-2.gif\" alt=\"Using CFP Land Pro to export conferences to your calendar\"></a></p>\n<p>You don’t have to track your CFPs in CFP Land. Pro Members also get a calendar export tool that allows you to save CFPs to Google Calendar, Apple Calendar, or Outlook.</p>\n<p>This is helpful if you want to create custom reminders or use your own calendar notifications rather than the CFP Land emails.</p>\n<h2><span id=\"search-alerts\">4. Custom Search Alerts</span></h2>\n<p><a href=\"/members/\"><img src=\"/img/posts/saved-search-2.gif\" alt=\"Saving searches with your CFP Land Pro Membership\"></a></p>\n<p>All CFP Land users can use filters to search for conferences that match their preferences, but if you’re a free user, you will need to check the site periodically to make sure you don’t miss any new opportunities. In order to make your life a little easier, <strong>CFP Land Pro Members can save their searches to get an email alert when new CFPs are found that match their filters.</strong></p>\n<p><a href=\"/members/\"><img src=\"/img/posts/saved-search-3.png\" class=\"right\" alt=\"Email alert when results from a saved search are found\" /></a></p>\n<p>When a new conference CFP is found that matches one of your saved searches, you’ll get an email about it, letting you know that you can either <a href=\"/blog/pro-saving-cfps/\">Save the CFP</a> or apply right away.</p>\n<p>Hopefully you’ll never miss another great CFP once you set up your searches on <a href=\"/members/\">CFP Land Pro</a>.</p>\n<h2><span id=\"abstracts\">5. Save Your Abstracts</span></h2>\n<p><a href=\"/members/\"><img src=\"/img/posts/abstracts.png\" alt=\"Abstracts on CFP Land Pro\"></a></p>\n<p>Most experienced speakers have a pool of abstracts that they could submit depending on the audience and conference focus. CFP Land Pro Members can save those Abstracts to their CFP Land account so that they can tie them to each CFP they submit.</p>\n<p>This is a great way to see which of your abstracts is the most successful and to remember which Abstract you submitted to which conference.</p>\n<h2><span id=\"track\">6. Track Your Submissions</span></h2>\n<p><a href=\"/members/\"><img src=\"/img/posts/track.gif\" alt=\"Track submissions on CFP Land Pro\"></a></p>\n<p>Finally, if you submit dozens of Abstracts per year, it can be hard to keep up with all of them. In my first year of speaking, I used a giant spreadsheet to track over 50 submissions, and it got to be a huge mess.</p>\n<p>CFP Land Pro Members can track the conferences they’ve applied to, been accepted at, and been rejected from in addition to attaching their Abstracts to each submission.</p>\n<hr>\n<p>Much more will be coming soon, so if you’re interested, <a href=\"/members/\">your CFP Land Pro Membership is just a few clicks away</a>!</p>","frontmatter":{"layout":"post","title":"Pro Members Only: A Complete List of All the Features CFP Land Pro Members Get","path":"/blog/pro-features/","category":"Updates","tags":["Pro Features"],"date":"2020/02/07","image":"/img/posts/pro-early-access.png"}}},{"post":{"html":"<p>Last year, I heard about a new conference called <a href=\"https://www.developer-first.com/conference\">Developer First</a> specifically for technology\nleaders. There are not a ton of conferences that focus on the people and leadership side of technology, so I was really excited to\napply, and even more honored to be selected for their first year. I also wanted to get to know the conference’s organizer a little better,\nso I reached out to Kate Wardin about doing an interview for CFP Land.</p>\n<p>Kate strikes me as one of those people who is a natural leader, but like many speakers, she started off terrified of getting up in front\nof an audience. Read on to hear her speaker’s story and her tips for new speakers.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://drive.google.com/uc?id=1cuCV5BH66UNiamgKS4EyAPZgD8Vpiro-\" class=\"right\">\n<p>I am currently a Senior Engineering Manager at Target Corp in Minneapolis, MN. I lead a team of amazing Engineers who build tools for our global supply chain users. Outside of my day job, I founded a company called Developer First to help organizations around the world build strong Engineering teams which I believe starts with developing confident, purposeful and inspiring leaders.</p>\n<p>I was absolutely terrified of public speaking throughout college and into the first couple years of my professional career. I avoided it at all costs and was a terrible speaker in front of an audience of any size. I eventually realized that I couldn’t continue avoiding public speaking and joined my organization’s Toastmaster’s club. I was thrilled to discover a safe and comfortable environment to practice my new skills and overcome my fears. I spent a couple years as a practicing member before being elected President of my local chapter.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>Speaking at conferences is not a requirement of my role, but I enjoy the opportunity to connect with leaders outside of my organization and feel like I am inspiring and influencing others to reflect and potentially shift their mindsets on technical leadership.</p>\n<p><strong>My favorite experiences of speaking at conferences are the conversations I have with folks who approach me after my talk.</strong> It is very rewarding to hear how my ideas resonated with them and even more enjoyable when they share new ideas that I hadn’t thought of!</p>\n<h3>What topics do you typically speak about?</h3>\n<p>I speak about a variety of topics related to the unique challenges of being an engineering leader: people first leadership, time management, prioritization, effective communication, coaching developers, diversity &#x26; inclusion, effective on boarding programs, etc.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first conference talk was part of an executive track at an engineering conference in NYC. I talked so fast that I finished my 45 minute talk in 20 minutes. I remember arriving to the speaker staging room 90 minutes early because I was so nervous that I would be late or not find the location. My confidence and skills were definitely lacking. However, I don’t regret any of it! I was passionate about the topic and strongly believe that you have to start somewhere. No video footage exists (thank goodness).</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Applied: hundreds</p>\n<p>Spoken at: ~25</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/Ut7jEkIf1ac' frameborder='0' allowfullscreen></iframe></div>\n<p><em>”<a href=\"https://www.youtube.com/watch?v=Ut7jEkIf1ac\">Developer First Leadership</a>” by Kate Wardin at React Boston</em></p>\n<h3>What advice do you have for new speakers?</h3>\n<p>I usually run through the slides about an hour before my talk. <strong>The more familiar the ideas are, the more comfortable I am.</strong> After that, I try to relax and maybe go introduce myself to other attendees during the break before my talk.</p>\n<p>Another tip: make sure you check what type of projector or input is needed before you arrive to speak!</p>\n<h3>What advice do you have for new speakers?</h3>\n<ol>\n<li><strong>DON’T WAIT. START WITH ANYTHING.</strong> Submit topics that you feel even somewhat confident to present on, and then invest the time to fully research, compile content, and practice(!!). It is amazing how your idea will flourish and grow the longer you have to reflect on the topic, gather feedback, and learn through other experiences. You just need to start with something - anything that you are passionate about. If you have an idea swirling in your head for longer than a couple weeks, take some time to start drafting an abstract and outline.</li>\n<li>Make sure you propose a topic that you are passionate about. There is nothing worse than a dull speaker who isn’t personally energized by the topic.</li>\n<li>READING THE ROOM: <strong>Nothing kills confidence faster than making eye contact with members of the audience who seem skeptical or not engaged.</strong> I like to find the person (or people) that actively shows feedback (nods, smiles) and focus my attention on them throughout my talk. As for those skeptics, I have found that it is dangerous to interpret the non-verbals of humans that you don’t personally know. In fact, on several occasions, some of those “skeptics” (or so I thought) approached me after my talk and expressed gratitude and shared that they loved my topic.</li>\n<li>Join a frequent flyer/hotel chain rewards program. Admittedly, I also got into conference speaking because I wanted an excuse to travel more and rack up those airline/hotel points. Check and check.</li>\n</ol>\n<h3>Where can readers find more about you?</h3>\n<ul>\n<li><a href=\"https://www.developer-first.com/\">Website</a></li>\n<li><a href=\"https://www.linkedin.com/in/kate-wardin/\">LinkedIn</a></li>\n<li><a href=\"https://twitter.com/developer_first\">Twitter</a></li>\n</ul>\n<p>Upcoming talks: NoFluffJustStuff US tour, StretchCon Budapest, &#x26; Developer First Tech Leadership Conference</p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Kate Wardin, Helping Organizations Build Strong Engineering Teams","path":"/blog/speaker-kate-wardin/","category":"Speaker's Story","tags":null,"date":"2020/02/06","image":"https://drive.google.com/uc?id=1cuCV5BH66UNiamgKS4EyAPZgD8Vpiro-"}}},{"post":{"html":"<p>I really enjoy getting to meet speakers all over the world. There’s something unifying about knowing that technologists from every corner of the globe can meet together to offer their tips and thoughts to others, and Vincenzo mentioned a similar appreciation in his interview here. As a speaker, he’s gotten to travel across the world to give talks on a variety of topics. Vincenzo’s approach to coming up with new talk ideas is also really interesting.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/G2DRaCN.jpg\" class=\"right\">\n<p>My name is Vincenzo Chianese, I am an Italian Software Developer that’s been working for the last 5 years in the WebAPIs space, providing tools for API Developers. I mostly code in TypeScript/JavaScript these days, but previously I’ve worked with C#, C++ and VB6. I am an Auth0 Ambassador and a Google Developer Expert in WebTechnologies and I’ve been living in Prague, Madrid and (starting in January) in Austin, TX.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>The ability to travel and see new places. I think I’ve been able to go on all the continents just because of the speaking engagements I had, which would have been impossible otherwise.</p>\n<p>Second? Networking with speakers; <strong>I met some of my best contacts I have in the space because of the conferences,</strong> and I even ended up organising a conference because of some people I met in Paris last year. You never know who you’re talking to — and you can be surprised. Curiously enough, the content is really the last reason I’d go to a conference.</p>\n<h3>What topics do you typically speak about?</h3>\n<p>I have always refused to present basic-level stuff that you can easily find on the web (tutorials and documentation) or even worse marked products for the company I work for. <strong>So every 8-10 months I do kind of a retrospective of what I’ve been working on and if I see a fit for an interesting talk (such as something that you don’t exactly do everyday, something that has never been treated elsewhere)</strong> — I put up an abstract and a title and try to submit it around.</p>\n<p>Sometimes the topic is appreciated, but most of the times it is not. My point is — I want to share experiences, not technical documents in an oral form.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I totally remember it. It was in 2015 at the mDevCamp and I was asked to replace a colleague that couldn’t make it. I was in an horrible condition (I had fever) and it was at the very last moment. I didn’t want to leave the company unrepresented to I took the bet and had the presentation anyway.</p>\n<p>I must say, my English has improved since then, I promise.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/hYvsept0oio' frameborder='0' allowfullscreen></iframe></div>\n<p><em>”<a href=\"https://slideslive.com/38894088/building-resilient-api-client\">Building resilient API client</a>” by Vincenzo Chianese at mDevCamp</em></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>In general, I apply to everything that makes sense, no matter the location or the timing of the year; that’s something I prefer to figure out later. Although I had a lot of speaking engagements, I still get rejected by default by most of the events. Some conference organisers that I met personally saw that I usually bring solid topics and so they were kind enough to invite me back. Anyway, I think my ratio is 1/5 (every 5 submissions, one goes through and gets accepted). You can do the math.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>I found myself in the world of the conferences accidentally and I had basically no training. Here are some things I wish I would have done before doing this serially and seriously:</p>\n<ol>\n<li>\n<p>Find a local Meetup in your native language. You need to get confident in front of the crowd and the meet-ups are perfect: low expectations, willingness to listen from the audience and the “even-if-everything-fails-nothing-happens” guarantee that will make you feel comfortable. Rinse and repeat 2-3 times.</p>\n</li>\n<li>\n<p>Find a meetup in English, and try the same talk. You will probably have to pay for your own flight (although a lot of meetups in Europe give talks in English anyway), but it’s an investment, so totally worth it.</p>\n</li>\n<li>\n<p>Time to apply to a conference.</p>\n</li>\n</ol>\n<p>I’ve also wrote a small essay on what to keep in mind when sending a CFP to a conference, <a href=\"https://dev.to/vncz/a-reviewer-s-perspective-on-getting-your-conference-proposal-accepted-1e6p\">sharing some thoughts as an organiser</a>. I organised <a href=\"https://apidays.co/barcelona\">the API Days Barcelona conference</a>.</p>\n<h3>Where can readers find more about you?</h3>\n<p>Twitter: <a href=\"https://twitter.com/d3dvincent\">@d3dvincent</a></p>\n<p>Website: <a href=\"https://vncz.codes\">https://vncz.codes</a></p>\n<p>LinkedIn: <a href=\"https://linkedin.com/in/vncz\">https://linkedin.com/in/vncz</a></p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Vincenzo Chianese, API Tool Builder and Google Developer Expert","path":"/blog/speaker-vincenzo-chianese/","category":"Speaker's Story","tags":null,"date":"2019/12/01","image":"https://drive.google.com/uc?id=1hC6t8QUeMt-iRNf-ENJ7VEerzmiegbBb"}}},{"post":{"html":"<p>As I’ve been getting into speaking, I’ve been keeping an eye out for interesting podcasts on the topic, and Tanay’s was one of the many good ones I found. Every episode, he interviews someone working in Developer Relations or who speaks or organizes conferences to learn from them and help pass on their knowledge. It’s a lot like the interviews I do here on CFP Land!</p>\n<p>So, I’m very excited to bring you Tanay’s speaker story today. His experience moving from casual speaker, to professional Developer Advocate is a great example of how speaking at tech conferences can truly change the course of your career. He was also kind enough to include a link to his first conference talk ever so you can see how far he’s come.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/rNiq6xr.png?1\" class=\"right\">\n<p>I am a Developer Advocate at <a href=\"https://crate.io/\">Crate.io</a> which means I am working closely with the community of engineers using CrateDB. I am speaking at a lot at conferences, holding webinars, writing tutorials and articles. I got into public speaking after joining a program called <a href=\"https://events.mozilla.org/techspeakers\">Mozilla Tech Speakers</a>. I gave my first talk in 2016 in Russia.</p>\n<p>I have been going to conferences for a while now and I have met some truly amazing speakers from whom I have learnt a lot. I thought, why not record our conversations and make them available as a podcast so that a lot more people can benefit from it? This is a side project that is very dear to me on which I am concentrating on these days. It is called <a href=\"https://soundcloud.com/technicallytrue\">Technically True</a> and I chat with inspiring people in the industry to gain insights on topics related to public speaking and developer relations.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>Initially, one of the strongest incentives was travelling to new places. Over time, the thing I liked the most about this was meeting new developer communities, engaging with them and of course, speaking and sharing what I have been working on.</p>\n<p>Speaking at conferences helped me gain more exposure and until the end of 2018, it was something that I did just for fun. Then I realised that I used up almost all of my vacation days for speaking at conferences and that now maybe it is time that I should do this full-time. That is when I decided to quit my job and join Crate.io this year as a full-time Developer Advocate. It’s been almost a year that speaking has been a part of my daily work and I’m lovin’ it!</p>\n<h3>What topics do you typically speak about?</h3>\n<p>These days, I have been speaking a lot about databases, industry 4.0, machine and time-series data. I especially enjoy talking about case-studies related to IoT that we do with our clients. I also speak on WebXR with A-Frame and building multiplayer games with that.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>Sure, I remember it like it was yesterday. I was very thrilled about it but got very nervous the day before I had to give the talk. I experienced a cocktail of feelings like impostor syndrome, adrenaline rush and anxiety. Once I started speaking, I realised that I was really enjoying it and all the fear melted away. The talk went well, I had a lot of questions and the feedback was good. I watched the recorded video later on and identified a lot of things that I had to fix like filler words and so on. It’s not easy to watch a video of your talk but trust me, it can be the best way to improve your speaking skills. I even have a video of <a href=\"https://www.youtube.com/watch?v=uZTJOhz6INQ\">my first talk on YouTube</a>, it helps me realize how far I have come and how far I still have to go.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/uZTJOhz6INQ' frameborder='0' allowfullscreen></iframe></div>\n<p><em>“Getting Started With Web Based Virtual Reality” by Tanay Pant (his first conference talk)</em></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Applied to? Hundreds! Spoken at? I think it is probably close to twenty-five.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>One of the things that is the most important for me is putting my Slack, laptop and mobile on do not disturb. I always take off my watch before going on the stage - loose watches can create a distraction for both the speakers and the audience by going up and down the wrist. Smartwatches on the other hand can light up with hand movements. I use an app called HiddenMe for hiding all the icons, files and folders from my Desktop, especially if I have to give a demo and need to exit Powerpoint. I think that it’s important to have a bottle of water on the stage especially for longer talks.</p>\n<p>I recently talked about pre-talk rituals with Niels Leenheer and you can hear stories from us about the things we do and why we do them <a href=\"https://soundcloud.com/technicallytrue\">in the episode coming out on December 1</a>.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>Well, there’s SO many things. Let’s go through a speaker’s journey from picking a topic to chatting with the audience at the end of the talk.</p>\n<p>First of all, topic selection. It’s most important to choose something really interesting to you, something that you are passionate about. That plays a huge factor in how much confidence and enthusiasm you have when you are up on the stage. If you’d like to know more about CFPs and how conferences select talks, I can highly recommend following <a href=\"https://soundcloud.com/technicallytrue/talk-selection-in-conferences-with-kristina-schneider\">Kristina Schneider’s advice</a> on the topic (she organises CSSConfEU).</p>\n<p>Once your talk is ready, make sure to practice it well but also beware of over-rehearsing. Practising your talk a couple of times helps you to further tailor your talks and make them leaner. It also helps you with your confidence on stage in case something goes sideways.</p>\n<p>If something doesn’t go exactly as you wanted to on the stage or if the demo fails, make a joke about it and move on. Make sure that you have a video that you can show in its place. Don’t let it affect the rest of your talk and your morale. Things go wrong, it’s okay. This happens to everybody.</p>\n<p>Make sure you stick around after you talk to answer the questions from the audience and help them in any way you can. <strong>Never forget that the audience is the most important group in that room and always be humble.</strong> I can go on about this topic for hours, if you have more questions DO reach out to me.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>One of the talks that have inspired me the most was given by <a href=\"https://twitter.com/Mio_Loclair\">Christian Mio Loclair</a> in Berlin about <a href=\"https://vimeo.com/273373088\">Narciss</a> back in 2018. Having said that, there are a countless number of people who have inspired me and I usually end up inviting them to my podcast. 😅</p>\n<h3>Where can readers find more about you?</h3>\n<p>I am most active on <a href=\"https://twitter.com/tanay1337\">Twitter</a> but I can also be found on <a href=\"https://www.linkedin.com/in/tanay1337\">LinkedIn</a>. If you’d like to check out the resources that I have created or talks that I have given, you can easily find them on Google or YouTube.</p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Tanay Pant, Developer Advocate, Mozilla Tech Speaker, and Podcast Host","path":"/blog/speaker-tanay-pant/","category":"Speaker's Story","tags":null,"date":"2019/11/24","image":"https://drive.google.com/uc?id=17CkKTCWXp6sLDobTgNlKJywHpp1hFka9"}}},{"post":{"html":"<p>If you’re not happy and fulfilled in your work, you should try to change it, and that’s exactly how Nicolas Fränkel started his career as a Developer Advocate. While many tech conference speakers do it for their own personal development, some are specifically hired to speak, travel, and be a face for the community. That’s what Nicolas does now, but like all speakers, it’s taken a journey to get there. In today’s Speaker Story, we hear how Nicolas got started as well as some of his tips for new conference speakers.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p>I’m Nicolas Fränkel, a Developer Advocate at <a href=\"https://hazelcast.org/\">Hazelcast</a>. My main job is to speak at conferences, so that people know about Hazelcast the In-Memory-Data-Grid and <a href=\"https://jet.hazelcast.org/\">Jet</a>. I’m also the point of contact for the community.</p>\n<p>I’ve been a teacher for more than 20 years, given that the best way to learn is to teach. However, some subjects are not relevant in academia. I discovered the <a href=\"https://vaadin.com/\">Vaadin web framework</a>, and I was so enthralled by it that I wanted to show it to the members of my local Java User Group. That was 7 years ago.</p>\n<img src=\"https://i.imgur.com/EOLCiAD.jpg\" class=\"center\">\n<h3>What do you like about speaking at conferences?</h3>\n<p>Public speaking is very energizing, probably similar to drugs, but with no bad side-effects! For example, last summer, I was feeling a bit down with so much travelling around. I arrived at my hotel just a couple of hours before a talk. I wasn’t happy to be there, but I went to give the talk. After that, I felt really better, all bad feelings had been washed away.</p>\n<p>As I mentioned above, I started public speaking at my Java user group one evening. Soon afterwards, when I travelled for work, I started to propose local user groups to host my talk. Then, I took vacations to speak at international conferences. I did more and more of them. <strong>But at one point, I realized that was pretty dumb to be paid to do a dull job (consulting on development/architecture) while taking vacations to do something that I really liked.</strong> One year ago, I steered my career toward Developer Advocacy, which includes a large part of public speaking.</p>\n<h3>What topics do you typically speak about?</h3>\n<p>I’m a tech guy, so in general I stick to technical subjects. They include Java - it has been my bread and butter for years, Kotlin, Spring and Spring Boot, DevOps, Kubernetes and of course, Hazelcast IMDG and Jet.</p>\n<p>I once did a motivational talk, but it was quite hard for me. I might do more organizational/management-related talks in the future, as I already wrote some related blog posts already. But it means going far out of my comfort zone.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I remember my first talk at my local user group very vividly.</p>\n<p>As I mentioned, I was used to teach, but to talk in front of your peers is very different. <strong>When teaching, you speak from a position of power; when speaking in front of your peers, they will judge you - in a good or a bad way, and it will have a lasting effect.</strong> For this reason, I had asked some good friends to come, and they did. The room was overflowing with people, with some sitting on the stairs. I was very nervous before the talk, and in the first few minutes. Then, just like when coding, I focused on the subject at hand and went “into the zone”. I don’t remember the specifics afterwards, it was just “business as usual”.</p>\n<p>I believe the talk went pretty well, as I remember people clapping, and thus it was a great experience that helped me apply to speak again.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I don’t keep the count of the number of conferences I’ve submitted to, but to give you a rough idea, this year, I’ll speak at a total of 68 conferences.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I don’t have routine per se, but I like to be at my place and prepared far in advance (at least 20 minutes). Being early was useful for a conference at the earlier this year, when I noticed very early that the projector didn’t work, and I had to run to find someone to help me.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>Wow, answering this question could easily fill a book!</p>\n<p>Regarding impostor syndrome, the main advice would be the following: I often hear great and skilled people not submitting talks because they’re afraid they have nothing new to say. Well, if that would be the case, not many people would do public speaking. I believe on the opposite that <strong>most people have a unique experience and bring a unique viewpoint, even to subjects that have been spoken about a lot.</strong></p>\n<p>For finding conferences, I use <a href=\"https://www.papercall.io/\">papercall.io</a> and <a href=\"https://sessionize.com/\">sessionize.com</a>. They also allow to write your bio and abstract once, find your conferences, and then submit them at a click of a button.</p>\n<p>For the rest, I already wrote a post named <a href=\"https://blog.frankel.ch/advices-junior-conference-speakers/\">Advices for junior conference speakers</a> that might be of interest. Expect more to come in the future.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I became exposed to the world of Developer Advocacy through <a href=\"https://twitter.com/jbaruch\">Baruch Sadogursky</a>. He was the one that made me understand by his behavior that public speaking could be a job - or at least a part thereof.</p>\n<p>For the sheer number of talks, I need to mention <a href=\"https://twitter.com/starbuxman\">Josh Long</a> and <a href=\"https://twitter.com/venkat_s\">Venkat Subramaniam</a>. As the latter told when he introduced himself during a panel is: “I’m Venkat, I live in a plane”. And then he passed the mic.</p>\n<h3>Where can readers find more about you?</h3>\n<p>I have a <a href=\"https://blog.frankel.ch/\">blog where I publish a weekly post</a>. This is also where you can find <a href=\"https://blog.frankel.ch/speaking/\">my list of talks</a>, present and future. For videos, I keep a <a href=\"https://www.youtube.com/playlist?list=PL0EuBuKK-s1EL-K3okpYwR0QZbAPRVmEG\">list on Youtube</a>. Finally, if you’re into Twitter, you’re welcome to follow me <a href=\"https://twitter.com/nicolas_frankel\">@nicolas_frankel</a>.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/sIuVbVbjZcw' frameborder='0' allowfullscreen></iframe></div>\n<p><em>“Securing the JVM” at Goto 2019 by Nicolas Fränkel</em></p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Nicolas Fränkel, Community Manager and Teacher","path":"/blog/speaker-nicolas-frankel/","category":"Speaker's Story","tags":null,"date":"2019/11/07","image":"https://drive.google.com/uc?id=1Nz2sw0SBWWZByKZ9A-StbkJsRn5Yesl4"}}},{"post":{"html":"<p>Itai Yaffe has seen a lot of changes in technology in his career. His first experience public speaking was talking about mainframes with a group of soldiers, and now he speaks regularly about cutting edge technology used in big data applications. Itai is in a great spot to speak on these topics too - his employer <a href=\"https://www.nielsen.com/\">Nielsen</a> has some truly large-scale data needs, which I imagine make for some interesting engineering problems.</p>\n<p>That said, the parts about speaking he enjoys most are the conversations and opportunities to learn from others. Read on to hear more about how Itai got into speaking and some of his tips for people considering giving their first talk.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/tChR2X7.png\" class=\"left\">\n<p>Other than being married to Liron and a father to Yaara and Yuval, I’m also working at Nielsen, the data and measurement company. I work for a division called Nielsen Marketing Cloud, as the tech lead of the big data group (sometimes people confuse “tech lead” with “team lead”, so I wrote a <a href=\"https://medium.com/nmc-techblog/tech-lead-dont-you-mean-team-lead-c8bde92e38ab\">short post</a> to explain what I see as a tech lead 😃).</p>\n<p>In addition to that, I’m also a co-founder and a core team member of the Israeli chapter of <a href=\"https://www.womeninbigdata.org/\">Women in Big Data</a>.</p>\n<p>I actually got into public speaking more than 10 years ago, when I was invited to give a talk about Mainframes to a group of young soldiers during their basic programming course in the army. I really enjoyed it, and since then I’ve had the chance to talk about various topics in several different forums, ranging from internal sessions, through local meetups, all the way to international conferences.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>While speaking at conferences is not part of my job per se, I’m sure it’s beneficial for my career in the long run, but that’s definitely not the main reason for me to do it. The main reason is actually the fact that it gives me an opportunity to meet a lot of smart people and share my knowledge with them - I absolutely love it!</p>\n<p>There are two added bonuses for speaking at conferences:</p>\n<ol>\n<li>I get to attend other talks and learn from others as well.</li>\n<li>After I give a talk, people come up to me and ask questions, which always leads to very interesting conversations.</li>\n</ol>\n<p>Bottom line - speaking at conferences is an awesome experience.</p>\n<h3>What topics do you typically speak about?</h3>\n<p>In the last 7 years or so, I’ve been a big data developer and tech lead, so naturally I cover big data related topics, usually frameworks and tools such as Apache Spark, Apache Kafka and Apache Druid.</p>\n<p>I’ve worked on data-centric systems since the early days of my career, and it’s funny how sometimes the terminology is similar, while the underlying technology has significantly evolved (e.g Mainframe batch jobs vs a Spark batch jobs). As a data engineer, it’s exciting to be able to use cutting-edge tools to process the ever-increasing amounts of data, and so is the opportunity to share with others how we actually use those tools.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>Yes, I definitely remember that talk! It was a local conference about 2.5 years ago, where my colleague, Yakir Buskilla (who’s now our VP R&#x26;D), and I spoke about how we use Druid for interactive count-distinct queries at scale.</p>\n<p>It was the first time I gave a talk to such a large audience (about 400 people), and I was excited (and a bit nervous of course…). We got great feedback after the talk, so I guess you can say it went well.</p>\n<p>You can check out the video recording of that talk below (my part starts at 12:01 minutes):</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/cOIJEBIVFDY' frameborder='0' allowfullscreen></iframe></div>\n<p><em>“Using Druid for Interactive Count Distinct Queries at Scale” with Yakir Buskilla and Itai Yaffe</em></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Since I joined Nielsen, over 5 years ago, I applied to around 10 conferences, and was accepted to about 7 of them. 2019 has been extremely successful for me as a speaker, presenting and co-presenting at 5 different conferences throughout the year. I also speak at meetups and other forums quite often.</p>\n<p>And, I’ve already started working on my applications for next year’s conferences.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I arrive a few minutes earlier to the location I’m going to talk at, and make sure everything is set-up properly. I also keep a bottle of water close by (just in case). Last but not least, it’s always helpful to pick a positive thought or idea that can lift your spirit and energize you right before getting on stage. I sometimes use <a href=\"https://www.youtube.com/watch?v=HgzGwKwLmgM\">Queen’s “Don’t Stop Me Now”</a> (apparently, this is even <a href=\"https://loudwire.com/queen-dont-stop-me-now-worlds-most-uplifting-song/\">backed by a scientific study</a>).</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>The best advice I can give, is to[read my blog post about <a href=\"https://medium.com/nmc-techblog/how-to-present-at-meetups-and-survive-and-what-does-freddie-mercury-have-to-do-with-it-614b22a7fa9b\">How to present at meetups and survive (and what does Freddie Mercury have to do with it?)</a> 😃</p>\n<p>But to summarize the tips from that post:</p>\n<ul>\n<li>Success doesn’t (usually) happen overnight, it takes a lot of work.</li>\n<li>Try to make your talk a story worth telling - people always want to hear real-life stories about how others have dealt with common challenges.</li>\n<li>Practice makes perfect - conduct a lot of dry-runs and get early feedback.</li>\n<li>Don’t let criticism get you down.</li>\n<li>Don’t let yourself get you down.</li>\n<li>Don’t forget to enjoy!</li>\n</ul>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I’ve been to several conferences and seen many great speakers, but I really look up to <a href=\"https://twitter.com/holdenkarau\">Holden Karau</a> - her talks are always awesome, funny and insightful!</p>\n<p>She’s involved in quite a few open-source projects, and it’s really impressive she’s able to contribute to the open-source community both in terms of coding and in terms of sharing her knowledge.</p>\n<h3>Where can readers find more about you?</h3>\n<p>I’d love to meet you at <a href=\"https://databricks.com/sparkaisummit/europe\">Spark+AI Summit Europe</a> on October 15-17 in Amsterdam, where I’ll be talking about <a href=\"https://databricks.com/session_eu19/stream-stream-stream-different-streaming-methods-with-apache-spark-and-kafka\">different streaming methods with Spark and Kafka</a>. Or, if you prefer London, you can join me at <a href=\"https://bigdataldn.com\">Big Data LDN</a> on November 13-14, where my VP R&#x26;D and I will be talking about <a href=\"https://bigdataldn.com/seminar-schedule/counting-unique-users-in-real-time-heres-a-challenge-for-you/\">how we use Druid for counting unique users in real-time</a>.</p>\n<p>If you happen to be based in Israel, you’re more than welcome to join our <a href=\"https://www.meetup.com/The-Big-Web-Theory/\">R&#x26;D’s meetup group</a> and <a href=\"https://www.meetup.com/Women-in-Big-Data-Israel/\">the Israeli chapter of Women in Big Data meetup group</a> (which is open to everyone, regardless of gender!).</p>\n<p>And last but not least, I invite you to connect via <a href=\"https://www.linkedin.com/in/itaiy/\">LinkedIn</a>, <a href=\"https://twitter.com/ItaiYaffe\">Twitter</a> or follow me on <a href=\"https://medium.com/@itai.yaffe\">Medium</a>.</p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Itai Yaffe, Big Data Tech Lead and Conference Speaker","path":"/blog/speaker-itai-yaffe/","category":"Speaker's Story","tags":null,"date":"2019/09/23","image":"https://drive.google.com/uc?id=1YprpBylBuImWjpZ7DuF09Z7nwn1kaT9H"}}}],"pathPrefix":"blog","first":true,"last":false,"index":1,"pageCount":5,"additionalContext":{}}}