{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"cb56e44f-911b-5afb-bdf3-d696b2d74b22","html":"<p><a href=\"https://gotochgo.com/2020/\">GOTO Chicago 2020</a> is coming up in just a few weeks, so I’m featuring some of the wonderful\nlineup of speakers that I’ll hopefully get to meet in person. Today, I’m happy to bring you Avdi Grimm,\na Ruby developer and professional paired programmer who will be giving a talk on programming and philosophy (I love these kind\nof talks).</p>\n<p>In this interview, Avdi shares some of his thoughts on how code is used as a model for life and the benefits he’s seen\nfrom 10 years of public speaking.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://drive.google.com/uc?id=1Yke3jpFDhT96A8qM5vGn1zAHS2bUBDSW\" class=\"right\">\n<p>I’m a developer who spends most of his time coaching and educating other developers these days. My primary source of income is <a href=\"https://www.rubytapas.com/\">RubyTapas.com</a>, a subscription screencast site I created for developers nine years ago. I specialize in making frequent, short, tightly-edited videos that introduce developers to one new and useful idea at a time.</p>\n<p>I got started speaking around 2010. <strong>I think my biggest reason was that back then I was under the misapprehension that I was an introvert, and speaking seemed like a handy socialization hack.</strong> The idea was, if I give a talk, people will introduce themselves to me!</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I love public speaking for its own sake, and I also very much enjoy traveling and meeting people. Speaking is interesting because on the one hand, it has been instrumental to my career. But on the other hand, it’s hard to trace the individual strands of causality. <strong>Many of my most delightful opportunities have stemmed from friends I made at a conference years earlier.</strong></p>\n<h3>What makes the intersection of philosophy and software such an interesting topic to you?</h3>\n<p>I honestly believe that <strong>programming is fundamentally the practice applied philosophy.</strong> We use code to model ways of thinking about the world we live in. And when our code is used by large numbers of people, it impacts how they see the world.</p>\n<p>That’s a lot of power, and a lot of responsibility. It’s also an opportunity: learning to think critically and intentionally about the philosophical nature of our work can reveal new ways to bring our values and our work into alignment.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I think my first-ever talk was at an open-source conference in Harrisburg, Pennsylvania. It was about tools for remote work, and it was not well-attended 😅</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I used to meditate a bit to calm myself down, with limited success. These days my favorite way to get ready is to be distracted by a conversation with an attendee until the moment comes to go on stage.</p>\n<h3>What advice do you have for new speakers?</h3>\n<ul>\n<li>Submit early, submit often.</li>\n<li>It’s OK to submit an abstract on a topic you want to understand better: getting accepted will give you a great excuse to learn about it!</li>\n<li>In both proposals and the talks themselves, lead with a problem, not with information. What is your ideal audience-member worried about or frustrated with?</li>\n<li>Don’t agonize over long articles about all the things you need to remember in order to give a good talk. Give yourself permission to suck at every aspect of doing your talk except one. E.g. maybe you’ll suck at slides, pacing, narrative arc, delivery… BUT you’ll have some really funny stories! Then, in later talks, pick ONE new aspect to do be better at each time.</li>\n</ul>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/k-Q_dXVQM1c' frameborder='0' allowfullscreen></iframe></div>\n<p><em>”[No Return: Moving beyond transactions in software and in life](<a href=\"https://www.youtube.com/watch?v=k-Q\">https://www.youtube.com/watch?v=k-Q</a></em>dXVQM1c)” by Avdi Grimm_</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>Too many to list. These days I’m most inspired by slam poets: the way someone like <a href=\"https://www.youtube.com/watch?v=yfJG4Etbt4Y\">Buddy Wakefield</a> can hold a room spellbound with words is amazing.</p>\n<p>Learn more about <a href=\"https://gotochgo.com/2020/speakers/1288/avdi-grimm\">Avdi’s talk at GOTO Chicago 2020 and how you can contact him here</a>.</p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Avdi Grimm, Software Developer and Screencaster","path":"/blog/speaker-avdi-grimm/","category":"Speaker's Story","tags":null,"date":"2020/02/28","image":"https://drive.google.com/uc?id=1Yke3jpFDhT96A8qM5vGn1zAHS2bUBDSW"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}