{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"c1c30b80-5c8a-5c65-836c-d2fffdbc3399","html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<!--more-->\n<h3>Tell me about yourself? How did you get into public speaking?</h3>\n<p>I’m Laurie and I’m a software engineer. I got into speaking for a couple of\nreasons. In my former life I was an active member of the debate team and did a\nlot of musical theatre, so audiences don’t scare me. I decided I wanted to be\ninvolved in technical speaking in part because I wanted to see more diversity\nrepresented on the stage.</p>\n<img src=\"https://cdn-images-1.medium.com/max/1200/1*fM3yLcP58eVXUsdeHAnVdA.jpeg\" class=\"left\">\n<h3>What do you like about speaking at conferences?</h3>\n<p>There is so much to love about speaking.</p>\n<p>I like thinking up the talk subject and coming up with something I think is new\nor interesting that will benefit attendees. While writing talks are a huge time\ncommitment, there is nothing quite like explaining a concept to others to help\ncrystalize it in your mind.</p>\n<p>And, speaking is an incredible way to connect with other people outside of your\ntech silo and/or geographic area. It has also opened up additional career\nopportunities for me, and has resulted in growing in different directions as\nwell, like writing blog posts and answering interview questions!</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I do! It was a local first year conference. I think the talk was meant to be 20\nminutes or so and I was overly concerned about running short.</p>\n<p>It went pretty well, and people laughed at my jokes, but I was far more nervous\nthan I’d expected to be. If you want to judge for yourself <a href=\"https://www.youtube.com/watch?v=eS8tO3Z6E7U&#x26;t=579s\">the video is\nonline</a>. I really should\nretool this talk and give it again.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed//eS8tO3Z6E7U' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Laurie Barth’s first ever conference talk at DC Full Stack Web Summit, 2017</em></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I looked at my Trello board, and I’ve applied to around 35 conferences over the\ncourse of 3 years. I’ve been accepted at 12 and spoken at 9–10 of those.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I try to arrive in the room as early as I can after the previous speaker, and\nnormally I run the talk through without notes while getting ready that morning.\nAs long as I know I have the cues in my head I’m not worried about any further\nmemorization.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>My biggest piece of advice is about content.</p>\n<p>The talks that are most engaging to me include stories of failure, they talk\nabout learning something you don’t know and falling down along the way, or\nthey’re a new perspective from an outsider on a specific topic.</p>\n<p>This isn’t a hard and fast rule, but I think it’s a great way to think about\npotential topics and to feel confident being honest with your audience. You’ll\nbe more memorable.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>So so many! I really couldn’t pick so I’ll try and talk about speakers with\ntotally different types of talks.</p>\n<p>I love <a href=\"https://twitter.com/nmeans\">Nicholas Means</a> who takes you through\nincredibly real stories about disasters and almost disasters and what we can\nlearn from them.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed//099cHWSbAL8' frameborder='0' allowfullscreen></iframe></div>\n<p>I love <a href=\"https://twitter.com/editingemily\">Emily Freeman</a> who talks about how the\nhuman reactions of all of us manifest themselves in our work and how that can\nhelp us be more cognizant of our actions.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed//dbKjzxd-f70' frameborder='0' allowfullscreen></iframe></div>\n<p>I’ve recently discovered some amazing speakers through youtube videos like\n<a href=\"https://twitter.com/philip_roberts\">Philip Roberts</a> who did a great talk on the\njavascript event loop:</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed//8aGhZQkoFbQ' frameborder='0' allowfullscreen></iframe></div>\n<h3>Where can readers find out more about you?</h3>\n<p>I have a website: <a href=\"http://laurieontech.com/\">laurieontech.com</a> (pardon the lack\nof responsive design, I just migrated to a new framework and it’s a work in\nprogress). I also tweet a fair amount\n@<a href=\"https://twitter.com/laurieontech?lang=en\">laurieontech</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email karl@cfpland.com to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Laurie Barth, Software Engineer and Conference Speaker","path":"/blog/speakers-story-laurie-barth/","category":"Speaker's Story","tags":null,"date":"2019/03/17","image":"https://cdn-images-1.medium.com/max/1200/1*fM3yLcP58eVXUsdeHAnVdA.jpeg"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}