{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"5ad4bf18-27d7-55b7-8e1d-069060ca8d04","html":"<p>Writing and submitting an abstract for a conference CFP (Call for Proposals) is a skill just like actually getting up on stage to speak is a skill. In fact, some great speakers struggle with abstracts more than they do with actually delivering their talk.</p>\n<p>Composing a great abstract takes practice, writing skills, and an attention to detail that may or may not come naturally to you, but hopefully this section will help you on your journey.</p>\n<h2>Choosing Topics</h2>\n<blockquote>\n<p>You do NOT need to have the talk written before you write a proposal for that talk to apply to conferences with.\n<em><a href=\"https://www.cfpland.com/blog/speakers-eva-penzeymoog/\">Eva PenzeyMoog</a></em></p>\n</blockquote>\n<p>While you don’t have to have your entire presentation ready before you submit to a CFP, you should have some idea what you might want to talk about. Be sure your topic is something you really want to speak, answer questions, and learn everything you possibly can about.</p>\n<p>Here are some things to consider when choosing a topic:</p>\n<h3>1. Does it fit the conference?</h3>\n<blockquote>\n<p>Think carefully about what your audience is interested in as opposed to what you are. What problems do they want to solve? What are the gaps in their experience? Where do they need guidance. You need to serve a need and purpose, and if you can map your presentation more commonly to these needs, you are more likely to get picked.\n<em><a href=\"https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/\">Jono Bacon</a></em></p>\n</blockquote>\n<p>Matching your talk with the conference’s area of focus is one of the best ways to get more talks accepted. Not only should the talk fit the conference’s broad area, but you should also look at the individual “tracks” the conference will be offering and make sure your abstract fits into one of them.</p>\n<p>For example, you’re never going to get a PHP-focused talk accepted at a Python conference, but if you have a Javascript talk, you might find lots of conferences with a “frontend” track that is appropriate for your topic.</p>\n<h3>2. Does is get you excited?</h3>\n<blockquote>\n<p>DO NOT propose a topic that you think will get you on stage but doesn’t actually excite you at all.\n<em><a href=\"https://rckbt.me/2014/01/conference-proposals/\">Raquel Vélez</a></em></p>\n</blockquote>\n<p>One of the hardest things you will ever have to do as a speaker is stand up on stage for an hour talking about something you’re not really interested in. That’s why you need to pick a topic that gets you excited, but keep in mind that your interests will change over time. Sometimes a topic you cared about 2 years ago will no stop be interesting.</p>\n<blockquote>\n<p>Pick a topic that you wouldn’t mind speaking about for hours and make it interesting for the version of you that would benefit from the talk.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-rhia-dixon/\">Rhia Dixon</a></em></p>\n</blockquote>\n<p>Your interest level and passion for the topic will come across in your presentation. It’s really hard to fake genuine excitement, and having that positive energy will make you a much more confident and effective speaker. Audiences want to listen to speakers who are excited about their topic, and conference committees will notice that in your application.</p>\n<blockquote>\n<p>When you speak about something that you are passionate about; you will actually be pretty excited to speak instead of being nervous. And your energy will be reflected when you present. It will boost your confidence and you will enjoy speaking!\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-drishti-jain/\">Drishti Jain</a></em></p>\n</blockquote>\n<p>Finally, talks that get you excited are easy to prepare for. You probably choose to spend time learning about the topic already, so channeling that knowledge into a talk you can share with others is just the logical next step.</p>\n<blockquote>\n<p>You know you’re passionate about a topic if you’re already spending a lot of time reading about it, thinking about it, and debating it with people on Twitter. Wrap your talks around your passions.\n<em><a href=\"https://www.cfpland.com/blog/speaker-anjuan-simmons/\">Anjuan Simmons</a></em></p>\n</blockquote>\n<h3>3. Something You Know Well</h3>\n<blockquote>\n<p>Pick a topic you are passionate about but also already knowledgeable about. Don’t experiment on new topics until you start getting accepted to speak. No need to add pressure on top of everything else.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-matthew-trask/\">Matthew Trask</a></em></p>\n</blockquote>\n<p>Just being excited about a topic isn’t enough on its own. You also have to be (or become) very knowledgeable about it. While you may have lots of time to learn about the topic between when your talk gets accepted and when you first present it, don’t underestimate the amount of time it takes to prepare a really strong conference presentation.</p>\n<p>New speakers may want to stick to topic areas they know already to minimize the amount of after-hours work they have to put in.</p>\n<blockquote>\n<p>“Think of something you’ve been successful at professionally, and then think of what advice you’d give to others on that topic. Can you come up with 5–10 tips to make your audience better at X? A coding language, a new tool, even a soft skill? Then you’ve got enough to respond to a CFP.”\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-laura-janusek/\">Laura Janusek</a></em></p>\n</blockquote>\n<p>Using things you’ve learned at work or on a side project are usually a good direction. If you collaborated with others, you can also get their thoughts on the topic and integrate that into your talk as well.</p>\n<h3>4. Sufficiently Unique</h3>\n<blockquote>\n<p>“Talks that can be summarized as an ‘Intro to (Tool)’ are often lazily conceived, poorly designed, and delivered mechanically. Great talks, meanwhile, dive deeper and are eager to explore fundamental issues, even if they use a tool as the catalyst for discussion.”\n<em><a href=\"http://jumpstartlab.com/news/archives/2014/02/15/prototypical-conference-talks\">Justin Searls</a></em></p>\n</blockquote>\n<p>The best conferences are looking for speakers who can do really unique and deep dives into a topic. Surface-level “intro to X” talks aren’t likely to get accepted at the most competitive international events.</p>\n<p>That said, smaller regional conferences might be interested in this kind of talk. Some of my most highly accepted talks are introductory-level talks on Docker and Testing because lots of attendees are actually interested in learning about those topics, and can use them as a reason to get their companies to send them to the conference.</p>\n<blockquote>\n<p>“ANY topic is fair game even if people have talked about it before. You can always bring a new perspective to a topic.”\n<em><a href=\"https://www.cfpland.com/blog/speaker-molly-struve/\">Molly Struve</a></em></p>\n</blockquote>\n<p>While you should try to make your talk unique, you don’t <em>have</em> to be the only person in the world giving talks on a particular topic to get accepted to speak about it. </p>\n<h3>5. Does it make the world a better place?</h3>\n<p>One of the things that <a href=\"../why-speak/\">motivates many speakers</a> is a desire to improve the world around them, and this comes across in their choice of topics. Even technical topics can make the world a better place because they’re spreading knowledge that you have to others.</p>\n<blockquote>\n<p>Talk about topics that make the world a better place; in particular accessibility, diversity, ethics, etc. I [try] to go beyond just technical issues and spread good ideas I believe in.\n<em><a href=\"https://medium.com/@tryshchenko/why-am-i-doing-public-speaking-at-tech-events-the-honest-answer-a75d80f85cfd\">Oleksandr Tryshchenko</a></em></p>\n</blockquote>\n<p>Try to think about how your talk will improve the audience members’ lives. If you can convey that in the talk description or abstract, you’ll make a big impression on the organizing committee.</p>\n<h3>6. Is it genuine?</h3>\n<blockquote>\n<p>Submit sessions that are interesting, engaging, and challenging, but don’t resort to clickbait titles and topics. Break the mold of what people normally talk about and how they discuss it, but stay classy.\n<em><a href=\"https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/\">Jono Bacon</a></em></p>\n</blockquote>\n<p>Some speakers are tempted to take speaking as an opportunity to push the limits of what can be said on stage. This might work, but it’s a risky tactic for a new conference speaker. Selection committees can see through cheap laughs and hackneyed titles, so keep your topics clear and intentions genuine.</p>\n<blockquote>\n<p>The talks that are most engaging to me include stories of failure, they talk about learning something you don’t know and falling down along the way, or they’re a new perspective from an outsider on a specific topic.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-laurie-barth/\">Laurie Barth</a></em></p>\n</blockquote>\n<p>Being genuine can also mean sharing a story about how you failed in the past. This is a great topic because nobody succeeds every time they attempt something, so your audience will probably resonate with the description of challenges you’ve failed to reach.</p>\n<h3>7. Actionable</h3>\n<blockquote>\n<p>“Talking about why technology X is cool in general way can be just fine, but sharing how we used X at Y to achieve Z gives the audience something more concrete to walk away with.”\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-george-mandis/\">George Mandis</a></em></p>\n</blockquote>\n<p>Thinking about topics that are actually useful to your audience is surprisingly hard. A lot of new technology is interesting, but practically useless, so try to center around real problems that can be solved by your area of focus.</p>\n<blockquote>\n<p>“OK talks are about the topic. Good talks are about the speaker/presentation. Great talks are about the audience.”\n<em><a href=\"https://twitter.com/getify/status/804018344412217344\">Kyle Simpson</a></em></p>\n</blockquote>\n<p>Another way of thinking about this is by thinking about your audience and what they hope to take away from your talk. Keeping your takeaways succinct and clear will help you in this effort. Your slides shouldn’t be bullet points, but there’s no reason your abstract shouldn’t be use a list of key learnings for readers.</p>\n<blockquote>\n<p>“Your talk should have a point. When someone walks away from your talk they might only take away 2-3 things with them. Those things should be in your proposal”\n<em><a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">Richard Schneeman</a></em> </p>\n</blockquote>\n<h2>Writing an Abstract</h2>\n<p>Now that you have some tips for picking a topic, most CFPs will require you to submit an abstract, description, and other information…</p>\n<ul>\n<li>“Start off with a bang, if your first sentence isn’t good they won’t read the rest.” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n<li>\n<p>Customize to each CFP</p>\n<ul>\n<li>“at least 30% of ~2,500 proposals I’ve ever read violated the predefined rules for talk abstracts and submissions that have been set.” “no matter how adept in speaking you are do read the instructions carefully before submitting and ensure the proposal is following them.” - <a href=\"https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32\">https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32</a></li>\n</ul>\n</li>\n<li>\n<p>Not too wordy</p>\n<ul>\n<li>“Most of JSConfs receive an average of 500 proposals, assuming a very strict 1-minute reading time per submission it’s still a full workday of reading…A good rule of thumb is two to three paragraphs clearly expressing your idea.” - <a href=\"https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32\">https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32</a></li>\n</ul>\n</li>\n<li>\n<p>Multiple per conf</p>\n<ul>\n<li>“one thing that started really getting me more speaking opportunities is submitting multiple talks to each CFP. Conference organizers sometimes have an agenda of the talks they’re looking to accept and if you submit more talks, you give them more chances to fit you into the schedule they’re looking to craft. (However, some conferences specifically say to not submit more than X talks, so definitely abide by that.)” - <a href=\"https://www.cfpland.com/blog/speakers-story-keanan-koppenhaver/\">Keanan Koppenhaver</a></li>\n</ul>\n</li>\n<li>\n<p>Persistence</p>\n<ul>\n<li>“If getting a talk proposal accepted seems like an unattainable goal, just keep sending in proposals and you’ll probably eventually get something accepted.” - <a href=\"https://www.cfpland.com/blog/speakers-story-jason-swett/\">Jason Swett</a></li>\n</ul>\n</li>\n<li>\n<p>Specific</p>\n<ul>\n<li>“make it easy for a reviewer to get excited about your talk. Be specific and get into the details about what you’re point of view is.” - <a href=\"https://medium.com/uxrblog/uxrconf-2020-a-few-tips-for-crafting-a-great-speaker-application-b295e3f61260\">https://medium.com/uxrblog/uxrconf-2020-a-few-tips-for-crafting-a-great-speaker-application-b295e3f61260</a></li>\n</ul>\n</li>\n<li>\n<p>Proof reading</p>\n<ul>\n<li>“Find people from varying backgrounds to read your abstracts — I have a speaker in tech, a speaker not in tech, and a non-speaker in tech review all of my abstracts to tell me what they think the point is, what they would expect to learn, and offer alternative titles. I’ve found this particularly helpful for tweaking my abstracts and tailoring my talks.” - <a href=\"https://www.cfpland.com/blog/speakers-story-rhia-dixon/\">https://www.cfpland.com/blog/speakers-story-rhia-dixon/</a></li>\n<li>“Try not to make overt typos in anything you submit. They stick out like a sore thumb in otherwise potentially well written submissions. It seems trivial, but when your talk comes up as the 70th submission that a reviewer is looking at that day it might break their brain and hurt your chances. If you’re not a native English speaker or you’re awful with grammar like me, ask a friend for a review.” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n<li>“don’t immediately submit your abstract. Write it, and then talk a walk, get away from it, and come back after an hour and see how you feel about it. You may see things you can do better.” - <a href=\"https://www.cfpland.com/blog/speakers-story-matthew-trask/\">https://www.cfpland.com/blog/speakers-story-matthew-trask/</a></li>\n</ul>\n</li>\n<li>“Don’t use cliches, everyone use’s cliches and it makes your proposal blend in. If you feel the pull of using a phrase everyone has heard “a million times”, ask yourself if it adds to what you’re trying to convey.” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n<li>“Use short sentences. Short sentences are concise. Short sentences are rich. Short sentences are powerful. Short. Sentences.” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n<li>\n<p>Get Creative</p>\n<ul>\n<li>“one thing I found helps in my abstract creative process, is to make word clouds. Given a topic like “security” or “performance” I write down as many other words come to mind. I then stack rank them based on which are the most interesting. I write about 10-20 different intro sentences. About 3-4 different copies of the “takeaway” sentences, and about 5-10 outro sentences. I then mix them up until they feel right.” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n<li>“It’s fairly easy for anyone to step in, read available materials and prepare a mediocre presentation. Don’t get me wrong, I’ve done it too, which now makes me able to see why we can do better. Trust me, we’ve all seen the Angular 2 talks already. Don’t copy your predecessors. Interesting angle on React Native? Experimental usage of Rails to build a realtime app? Your own personal experiences and unexpected solutions? Yes please.” - <a href=\"https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32\">https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32</a></li>\n<li>“Conferences are generally looking for novelty when choosing talks.” - <a href=\"https://medium.com/uxrblog/uxrconf-2020-a-few-tips-for-crafting-a-great-speaker-application-b295e3f61260\">https://medium.com/uxrblog/uxrconf-2020-a-few-tips-for-crafting-a-great-speaker-application-b295e3f61260</a></li>\n</ul>\n</li>\n<li>\n<p>Titles</p>\n<ul>\n<li>“A good title is reasonably short, self-descriptive, contains the appropriate buzzwords for your topic (and no others), and has enough of a “hook” to make someone want to read further (or attend).” - <a href=\"https://www.garfieldtech.com/blog/3-paragraph-pitch\">https://www.garfieldtech.com/blog/3-paragraph-pitch</a></li>\n<li>“set a timer for 3 minutes, write as many titles as you can. Pick your favorite, then write the rest of your submission. When you’re done go back and throw away the title and re-write it.” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n<li>“Try to use descriptive words or action statements in the title.” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n<li>“Don’t alienate your audience through jargon. Your title should say something about your talk. If it’s an “in” joke or an acronym don’t use it.” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n</ul>\n</li>\n<li>\n<p>Closing:</p>\n<ul>\n<li>“make the last sentence in your abstract somewhat memorable, preferably short, even better if it’s actionable.” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n</ul>\n</li>\n<li>\n<p>Inclusive language, avoid ablism</p>\n<ul>\n<li>“Common examples of ableist language are words like, “lame,” “dumb,” “retarded,” “blind,” “deaf,” “idiot,” “imbecile,’ “nuts,” “psycho,” and “spaz.” These terms can be associated with a person’s identity or their challenges, and because of that, can be interpreted as insulting or hurtful. And every time people use them, they reinforce the idea that people with disabilities are somehow inferior.” - <a href=\"https://deareverybody.hollandbloorview.ca/learn/tips-and-tools/how-to-avoid-using-ableist-language/#.XcXTqJJKigQ\">https://deareverybody.hollandbloorview.ca/learn/tips-and-tools/how-to-avoid-using-ableist-language/#.XcXTqJJKigQ</a></li>\n</ul>\n</li>\n<li>\n<p>Two speakers?</p>\n<ul>\n<li>“double the speakers means double the cost. To be transparent, we do hold applications with multiple speakers to a higher standard during our evaluation.” - <a href=\"https://medium.com/uxrblog/uxrconf-2020-a-few-tips-for-crafting-a-great-speaker-application-b295e3f61260\">https://medium.com/uxrblog/uxrconf-2020-a-few-tips-for-crafting-a-great-speaker-application-b295e3f61260</a></li>\n</ul>\n</li>\n<li>\n<p>Format:</p>\n<ul>\n<li>“There’s no one right way to write a session pitch, but I’ve found the 3-part pitch works well for me. A 3-part pitch has (you’ll be amazed to hear) three key points, in order:\nState the problem\nTease the solution\nExplain how you’ll provide the rest of the solution in the session” - <a href=\"https://www.garfieldtech.com/blog/3-paragraph-pitch\">https://www.garfieldtech.com/blog/3-paragraph-pitch</a></li>\n</ul>\n</li>\n</ul>\n<blockquote>\n<p>“A typical conference selection team will be reading dozens or hundreds of session proposals…That means conference organizers are going to skim, they’re going to skip over anything that doesn’t catch their attention early on, they’re going to skip based on the title, and many if not most will automatically discount anything with obvious typographical and grammar mistakes.” - <a href=\"https://www.garfieldtech.com/blog/3-paragraph-pitch\">https://www.garfieldtech.com/blog/3-paragraph-pitch</a></p>\n</blockquote>\n<h2>Submitting Your Talks</h2>\n<ul>\n<li>Submit lots of them</li>\n<li>\n<p>Start with 2-3 talks - some conferences like more than 1 per speaker</p>\n<ul>\n<li>“No matter how confident you are, never bet the farm on one idea—brainstorm and prepare several talks.” - <a href=\"https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32\">https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32</a></li>\n</ul>\n</li>\n<li>Relevant - tweak if necessary</li>\n<li>\n<p>Consider a workshop</p>\n<ul>\n<li>“workshops require a lot of preparation time that not every speaker has. You can improve your chances of being accepted by submitting such a workshop.” - <a href=\"https://blog.frankel.ch/advices-junior-conference-speakers/\">https://blog.frankel.ch/advices-junior-conference-speakers/</a></li>\n</ul>\n</li>\n<li>\n<p>Audience level</p>\n<ul>\n<li>“But if a conference was only filled with super-advanced talks, they would lose a huge part of their audience. So, even if you just learned something, you can teach it and many attendees will welcome your perspective as a relatively-recent beginner. Since you just went through it all for the first time yourself, you know and remember all the roadblocks that someone getting started will have and can help them learn even quicker.” - <a href=\"https://www.cfpland.com/blog/speakers-story-keanan-koppenhaver/\">Keanan Koppenhaver</a></li>\n</ul>\n</li>\n</ul>","frontmatter":{"layout":"post","title":"Submitting Abstracts","path":"/guides/speaking/submitting/","category":"Guides","tags":null,"date":null,"image":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}