{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"64d0d329-8c82-5ca9-8230-71fd9b7bf864","html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Jaime and I shared the stage once at <a href=\"https://theleaddeveloper.com/\">The Lead Dev</a>, and since then I’ve gotten to know Jaime a bit more on Twitter and by following his podcast, <a href=\"https://mtjc.fireside.fm/\">More Than Just Code</a>. Jaime has spoken at a lot of conferences, but like many of us, he’s applied at an order of magnitude more. Read on to learn more about his process and some of his suggestions for new speakers.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/ozbikNQ.png\" class=\"left\">\n<p>I’m Jaime Lopez Jr and I’m a software developer by day and a podcaster by night.</p>\n<p>I got into public speaking because I wanted to reach a new audience where I could share my knowledge, experiences, and stories. I’ve co-hosted a podcast (<a href=\"https://mtjc.fireside.fm/\">More Than Just Code</a>) for the past 4-5 years, so public speaking was a natural extension of that experience.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I like being able to share things that I have learned because I hope that my experiences can be helpful to others who encounter the same struggles that I have encountered.</p>\n<p>Speaking at conferences has benefited my career by providing an opportunity to meet other people in the industry that I wouldn’t ordinarily get a chance to meet!</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I do remember my first conference talk. I co-presented a talk at 360iDev in Denver, Colorado with <a href=\"https://twitter.com/timmitra\">Tim Mitra</a> (my friend and a co-host of More Than Just Code).</p>\n<p>The talk went very well from what I recall. The topic was about the way that hosting a technical podcast can help developers in their careers, which plays to our strengths as experienced podcasters. Of course it also helped that we had a few die-hard fans in the audience!</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Looking at my Google Sheets spreadsheet where I track this, I’ve applied to about <strong>115 conferences in the past three years or so</strong>. I’ve been accepted by 14 conferences and have spoken at (or am scheduled to speak at) 9 of those conferences.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I like to find a quiet place to collect my thoughts about an hour prior to when I give my presentation. It certainly helps when there is a dedicated room for speakers to do this! Also, if possible I try to check out the room where I’ll be speaking so I can get a sense of the acoustics as well as how the audience will experience the presentation.</p>\n<p><strong>I generally try not to memorize my talks because it causes me to become robotic when speaking</strong>. Instead, I walk through the main points (generally a single word) that I want to mention related to my slides or code that I’m sharing.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>There is one main piece of advice that I can give new speakers:</p>\n<p><strong>It is usually difficult to get started as a conference speaker in terms of getting your CFP submissions accepted. This is totally okay and you don’t need to worry about it!</strong></p>\n<p>I subscribed to the (now-defunct) <a href=\"https://techspeak.email/\">Technically Speaking newsletter</a> that was put together by Chiu-Ki Chan and Cate Huston. The content in that newsletter (which is still available online) helped me craft my CFP submissions so that there is a better chance of being accepted. As well, the Technically Speaking newsletter helped me feel better about CFP acceptance rates (which if I recall they said was somewhere about 10%).</p>\n<p>If I’ve learned anything over the past few years of submitting to CFPs, <strong>it’s that it is better to submit to many conferences that you think would benefit from your talk than it is to be fixated on any particular conference</strong> (which puts all of your hopes and dreams on a single CFP).</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>There are two speakers that come to mind.</p>\n<p>First is <a href=\"https://twitter.com/savinola\">Laura Savino</a>. The way she gives technical presentations makes the audience feel as if they’re going along on a shared journey. Each step of the way seems like a friend is sharing their favorite locations in an unfamiliar city.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/vkb9z68nhyo' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Readable Code - Laura Savino - DDD Europe 2018</em></p>\n<p>Second is <a href=\"https://twitter.com/nmeans\">Nickolas Means</a>. I’ve been impressed with the way that he can smoothly deliver stories that involve a lot of technical detail. The way he presents the topics at hand leaves the audience on the edge of their seat.</p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>I have a website: <a href=\"http://www.devwiththehair.com/\">http://www.devwiththehair.com/</a></p>\n<p>I co-host <a href=\"https://mtjc.fireside.fm/\">the More Than Just Code podcast</a></p>\n<p>I’m on Twitter: <a href=\"https://twitter.com/DevWithTheHair\">@DevWithTheHair</a></p>\n<p>My upcoming and previous conference talks <a href=\"https://github.com/DevWithTheHair/Conference-Talks\">can be found on GitHub</a></p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Jaime Lopez, the Dev With the Hair","path":"/blog/speakers-story-jaime-lopez-jr/","category":"Speaker's Story","tags":null,"date":"2019/05/17","image":"https://i.imgur.com/ozbikNQ.png"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}