{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"500731a2-cfad-5fdc-a33b-0630135fb114","html":"<p>Hundreds of technology conferences take place around the world every year. We catalog <a href=\"/blog/data\">about 400 per year at CFP Land</a>, but there are probably many more that we don’t find for one reason or another. As you might suspect, these conferences vary greatly in size, topic focus, cost, and competitiveness for speakers.</p>\n<p>Let’s take a look at a few of the dimensions you might use to compare technology conferences:</p>\n<h2>Breadth and Depth</h2>\n<p>Very narrow (regional, language-specific cons) to very broad (international tech cons)</p>\n<h2>Attendees</h2>\n<p>Small (&#x3C;100 people to huge >1000)</p>\n<h2>Tracks</h2>\n<blockquote>\n<p>“Single-track conferences can be nice because you’re guaranteed the maximum audience size. However, it also means that there may be people in the audience who don’t care about your talk. With a multi-track conference, the people who do attend your talk will be more interested in what you have to say. But this also brings anxiety or disappointment when not as many people choose your talk as you’d like, and you have to give your talk to an awkwardly small crowd.” - <a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0</a></p>\n</blockquote>\n<h2>Corporate vs. Community Run</h2>\n<h2>Frequency</h2>\n<h2>Location</h2>\n<p>Virtual? Large city? Small city? Boat?</p>\n<h2>Profit</h2>\n<blockquote>\n<p>“Some conferences are for-profit. Others make little to no money for the organizers, and are largely a labor of love for the community. Some for-profit conferences will masquerade as the latter. Make sure you know what the conference is and if you’re comfortable with it before you accept.” - <a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0</a></p>\n</blockquote>\n<h3>Economics of Tech Conferences</h3>\n<ul>\n<li>\n<p>Economics: Speakers, sponsors, and attendees</p>\n<ul>\n<li><a href=\"https://2019.jsconf.eu/news/the-jsconf-cssconf-eu-finances/\">https://2019.jsconf.eu/news/the-jsconf-cssconf-eu-finances/</a></li>\n<li>Sponsors and attendees generally pay</li>\n<li>Speakers rarely paid, but usually get free ticket. Sometimes other perks (travel + hotel): “Most speakers do not receive compensation for speaking, aside from a free conference ticket. Some conferences will reimburse travel expenses, although most will happily allow the speaker’s employer to pay instead.” - <a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0</a></li>\n<li>Costs: venue, food, swag, staff, equipment</li>\n</ul>\n</li>\n</ul>\n<h2>Why Attend?</h2>\n<p>Plenty of experienced technology professionals never go to or speak at a conference. They can be expensive, take away time from focused work, and awkward - especially if you don’t know anyone there. That said, there are some great reasons to try attending a tech conference sometime:</p>\n<h3>Learning</h3>\n<p>The tools available to technology professionals is changing rapidly, and it can be hard to keep up. Newsletters, blogs, and local usergroups are all a great place to turn, but so are conferences.</p>\n<blockquote>\n<p>“Conferences are prime place for learning about new or obscure libraries and packages that you haven’t used before. If it’s been done before, then someone somewhere will eventually give a talk about it.”\n<em><a href=\"https://opensource.com/life/16/2/attending-technical-conferences-whats-big-deal\">Deb Nicholson</a></em></p>\n</blockquote>\n<h3>Meeting New People</h3>\n<p>While attending talks is an obvious way to learn new things at a conference, you may also pick up some new ideas from your fellow attendees. Meeting people at conferences is also a great way to find a job or look for job candidates.</p>\n<blockquote>\n<p>“I like meeting like-minded people with the profession in common…I like the positive energy conferences have and regardless of where you work or the number of years of experience one has all of the participants are there to learn and share the experience.”\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-geshan-manandhar/\">Geshan Manandhar</a></em></p>\n</blockquote>\n<h3>Inspiration</h3>\n<p>Great speakers can motivate you; ignite your passions; inspire you to do something you woudn’t have. Not every tech conference has room for a ton of inspirational talks, but many conferences try to include some of these in their keynote slots.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/dYlT4lU5pb4' frameborder='0' allowfullscreen></iframe></div>\n<p><em>“A Tinker Story” by dina Amin</em></p>\n<h3>Fun</h3>\n<p>Finally, attending a tech conference can be really fun. Last time I went to <a href=\"\">Codemash</a>, I got to visit the NASA facilities in Sandusky, Ohio, see the indoor water park, and play virtual reality </p>","frontmatter":{"layout":"post","title":"An Introduction to Technology Conferences","path":"/guides/speaking/introduction/","category":"Guides","tags":null,"date":null,"image":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}