{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"30d4d885-8163-5f41-aa63-ed36bf0cd3b8","html":"<p>After being accepted to give your first conference talk, the next big step is to create your presentation. Even if you’ve given the talk before, you should revisit it each time you deliver it to make sure it’s appropriate for the specific audience and time allotted.</p>\n<p>While your presentation should fulfill the expectations you <a href=\"../submitting/\">set forth in your abstract</a>, there’s a big difference between writing a one-paragraph outline and creating a 60-slide deck to fill an hour of stage time! In this section, I’ll cover some tips for creating a great presentation for a technology conference.</p>\n<h2>Formats</h2>\n<p>Before you start creating slides, it might help to determine a format that will work for your presentation. Your talk may not fit perfectly into any one of these archetypes, but it’s helpful to start off with one of these formats and then branch out as your talk matures.</p>\n<h3>1. A novel solution to common problem</h3>\n<blockquote>\n<p>When a new framework becomes popular, there’s often a variety of opinions about the best way to do automated testing for code that uses it. Even if your solution isn’t the best, it can become a standard if you’re the first with a conference video.\n<em><a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">Nick Heiner</a></em></p>\n</blockquote>\n<p>One of the fun things about working in technology today is that there are always new and (arguably) better solutions coming out for various problems. Most new solutions are viable candidates for a conference talk, so this format is pretty common.</p>\n<p>While the specifics vary, a typical presentation of this format might start off by introducing a problem, then talk about existing solutions, and finally give the audience a new (and again arguably better) solution.</p>\n<p>In the talk below, Pete Hunt introduces React by walking through several of the problems that the framework aims to solve. While an introductory talk on React probably won’t get much interest at a conference now, in 2013 React was brand new, so this talk was very popular.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/x7cQ3mrcKaY' frameborder='0' allowfullscreen></iframe></div>\n<p><em>React: Rethinking best practices by Pete Hunt</em></p>\n<h3>2. The hero’s journey</h3>\n<blockquote>\n<p>They learn that hey, this is hard, and it’s ok to struggle. This person, who must be smart because they’re up there on the stage, makes mistakes. I make mistakes too, so we’re kind of similar. They conquered their problem, so maybe I can conquer mine.\n<em><a href=\"http://jumpstartlab.com/news/archives/2014/02/15/prototypical-conference-talks\">Jeff Casimir</a></em></p>\n</blockquote>\n<p>A common pattern for storytelling is <a href=\"https://en.wikipedia.org/wiki/Hero%27s_journey\">the hero’s journey</a>. You may not have heard this term, but you’ve definitely seen it played out in hundreds of movies, TV shows, and books. The way it works in a conference talk is:</p>\n<ol>\n<li>You introduce yourself in a happy initial state,</li>\n<li>Something happens that upsets your initial state,</li>\n<li>You reluctantly start a journey to resolve the conflict,</li>\n<li>You reach a low point when your initial assumption fails, </li>\n<li>And finally, you emerge victorious by solving the problem.</li>\n</ol>\n<p>There are variations on this theme, but if your talk is meant to be more personal or story-driven, this is a good format to use.</p>\n<p>Hero’s Journey Illustration: <a href=\"https://i.imgur.com/Bv2Quqe.png\">https://i.imgur.com/Bv2Quqe.png</a></p>\n<p>In the talk below, TJ VanToll walks the audience through his process of changing his mind about Typescript. Along the way, we learn about the language and why it’s ultimately superior in some cases.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/w6rdLx2LYz8' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Why I Was Wrong About TypeScript by TJ VanToll</em></p>\n<h3>3. The tech-heavy deep dive</h3>\n<blockquote>\n<p>These talks focus on something that’s cool but that not many engineers get to work with on a day to day basis.\n<a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">Nick Heiner</a></p>\n</blockquote>\n<p>A lot of tech people like technical deep dives because they’re inspiring. Most of us don’t use all the cutting edge technology available day-to-day, so we appreciate hearing from those who do.</p>\n<p>Additionally, this structure of talk can show people how to use things better that they may already know at a surface level. </p>\n<blockquote>\n<p>One of my favorite forms is the deep dive. This is what I might call the Pat Shaughnessy talk. It’s been a long time since I studied undergrad Computer Science, and I didn’t understand a lot of it the first time around.\n<em><a href=\"http://jumpstartlab.com/news/archives/2014/02/15/prototypical-conference-talks\">Jeff Casimir</a></em></p>\n</blockquote>\n<p>Here’s one of Pat Shaughnessy’s talks - a deep dive into ActiveRecord. While most Ruby on Rails developers at the conference have used ActiveRecord, most of them probably don’t know exactly how it works under the hood, so they get a lot of value out of learning these mysterious internals.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/rnLnRPZZ1Q4' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Twenty Thousand Leagues Under ActiveRecord by Pat Shaughnessy</em></p>\n<h3>4. The live demo</h3>\n<p>Live demos are among the most impressive (when they work) and the most underwhelming (when they don’t) talks I’ve ever seen at a conference.</p>\n<p>On the one hand, live coding a working application and showing the audience the results is a great way to illustrate how easy a new framework or tool can be. It’s inspiring and impressive to watch, and you’ll get some big “oohs” and “ahhs” when it goes perfectly.</p>\n<p>On the other hand, it rarely goes perfectly.</p>\n<blockquote>\n<p>“Have backups. If your demo breaks on stage, revert to showing the video of the same thing in action.”\n<em><a href=\"https://dev.to/tlakomy/what-i-wished-someone-told-me-about-speaking-at-tech-conferences-3opp\">Tomasz Lakomy</a></em></p>\n</blockquote>\n<p>I saw one live coding talk where the presenter accidentally deleted his whole template and all his notes just minutes before the talk. He was so flustered that he had to bow out early and apologize for being ill-prepared. That’s probably the worst case scenario.</p>\n<p>If you do choose to attempt a live demo have a robust backup plan, practice a ton, and make sure you can test it out on the same equipment you’ll use for the actual presentation.</p>\n<p>In this example, Andrew Sorensen live codes a concert for his audience. While he’s working, he explains what’s happening and never drops a note. Best of all, he keeps the whole show to a tight 10-minute time slot. This is really impressive, and I can’t imagine how much preparation has gone into it.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/yY1FSsUV-8c' frameborder='0' allowfullscreen></iframe></div>\n<p><em>The Concert Programmer by Andrew Sorensen</em></p>\n<h2>Conference Presentation Tools</h2>\n<p>Once you land on a format for your talk, you’ll need to decide which tools you want to use to give the presentation. I’d recommend using the tools you’re most familiar with until you get really comfortable speaking on stage. Once you’ve done this a few times, you can try to get creative, but don’t buck the system your first time.</p>\n<h3>Slides</h3>\n<p>Most talks center around a slideshow. Power Point and Google Slides are probably the most common options, but <a href=\"https://prezi.com/\">Prezi</a> and <a href=\"https://revealjs.com/#/\">Reveal</a> are also good choices. Again, start with the tools you’re most comfortable with and experiment later.  </p>\n<h3>Audio-Visual Aids</h3>\n<p>Some speakers like to show short video clips during their presentation. If you do this, be very certain you know the audio will work once it’s up on the big screen. There’s nothing worse that trying to put the microphone near your tiny laptop speakers to amplify the sound.</p>\n<h3>Microphone</h3>\n<p>Generally the conference will provide a microphone if it’s necessary, but I’ve met a few speakers who bring their own because they want to be sure it’s a device they’re used to. The downside to this is that you’ll have to coordinate with the conference’s AV team, and some conferences may not make special accommodations like this.</p>\n<h3>Remote</h3>\n<p>I like to walk around while I’m on stage, so when possible, I bring a remote to advance my slides. You can get one for cheap online, or you could try to use a wireless mouse in a pinch. Most conferences don’t provide this for you.</p>\n<h3>Laptop</h3>\n<p>Finally, you’ll likely need a device to present from. While occasionally conferences will provide one, most prefer you to come connect your own before you speak. Be sure your battery will last for the duration of your talk, and don’t count on a charger being available.</p>\n<p>I mention all these accessories here because you probably want to practice with the same devices you use for the real thing.</p>\n<h2>Building Your Presentation</h2>\n<p>Much of the same advice that applies to <a href=\"../submitting/\">writing your abstract</a> also applies when creating your presentation, but I’d like to point out a few key tips for creating your slide deck and delivering your presentation.</p>\n<h3>Mix stories and information</h3>\n<blockquote>\n<p>Stories, metaphors, examples, jokes, pictures, videos and other props are all excellent ways to keep things interesting, but make sure that they clearly relate to your core takeaways.\n<em><a href=\"https://blog.prezi.com/speaking-at-a-conference-here-are-10-things-the-organizer-wants-you-to-keep-in-mind/\">Mark Walker</a></em></p>\n</blockquote>\n<p>No matter what format you use for your presentation, the best ones are a mix of stories and factual guidance or information. The most common weakness that technology speakers present is not including any interesting anecdotes to help capture their audience’s attention.</p>\n<p>Every speaker and talk is different, but as you build your presentation, make sure that you’re weaving in stories that illustrate your points.</p>\n<h3>Use slides for illustrations</h3>\n<blockquote>\n<p>People can only process one inbound message at a time. They will either listen to you or read your slides; they cannot do both.\n<em><a href=\"https://www.duarte.com/wean-yourself-from-presentation-slides/\">Mark Duarte</a></em></p>\n</blockquote>\n<p>Another common mistake speakers make is to fill every slide with bullet points. Because your audience can only listen <em>or</em> read, you should be very careful with the amount of text you cram into a slide.</p>\n<p>This can be a hard habit to break, but it might help to set up speaker notes so that you can look at your bullet points while your audience can actually listen to you or look at an image that frames your topic on the screen.</p>\n<blockquote>\n<p>Your slides only really serve three good purposes: entertainment, illustration, and roadmap. Anything else is distracting your audience from listening to you.\n<em><a href=\"https://hackernoon.com/dressing-for-the-stage-theatre-rules-apply-90a29614ad67\">Cassie Kozyrkov</a></em></p>\n</blockquote>\n<h3>First and last slides</h3>\n<blockquote>\n<p>I always set the conference logo on the cover slide. The people behind the conference have put a lot of effort into the organization, it’s only fair play to promote their brand by doing so. Plus, they generally provide logos, so it’s a no-brainer.\n<em><a href=\"https://blog.frankel.ch/advices-junior-conference-speakers/\">Nicolas Fränkel</a></em></p>\n</blockquote>\n<p>Your cover slide will spend a little time on screen while you get set up and your audience gets settled. For that reason, you should probably include the title of your talk (that way people will know they’re in the right place), your name, and the name or logo of the conference you’re speaking at. If the talk is being recorded this is especially important as it will serve to introduce future online viewers as well.</p>\n<p>Your last slide should probably include contact information (if you want to provide it) and a link to your slides or notes so that anyone who wants more detail can go find it. This last slide will probably be up for Q&#x26;A and until the next speaker is ready to take the stage.</p>\n<h3>Humor</h3>\n<blockquote>\n<p>Keep politics and religion out of your sessions. Also, avoid sexualized imagery, and try not to be an asshole about other people to make a point.\n<em><a href=\"https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/\">Jono Bacon</a></em></p>\n</blockquote>\n<p>While you want to be an entertaining speaker, you were not invited to this conference as a standup comedian. Making a programming joke or two during a technical talk is probably okay, but anything that could be considered “dark”, “edgy”, or “controversial” should probably not be included.</p>\n<p>If you are unsure, practice your jokes with a trusted friend or colleague first. Everyone likes a funny speaker, but you don’t want to be remembered as the speaker who offended half the room by going too far.</p>\n<h3>Practice</h3>\n<blockquote>\n<p>Stand up and practice out loud. If you screw something up, do not stop. You won’t get to repeat the whole talk on stage so having those prep sessions at home will make you well prepared to any mishap that might happen on stage.\n<em><a href=\"https://dev.to/tlakomy/what-i-wished-someone-told-me-about-speaking-at-tech-conferences-3opp\">Tomasz Łakomy</a></em></p>\n</blockquote>\n<p>I’ve met a few speakers who know their subject matter so well that they don’t really practice anymore, but this is rare. Almost all of the best speakers I’ve talked with practice a lot, especially with a new talk. I typically run through my talk at least 25 times before I give it on stage at a conference.</p>\n<p>At the same time, you don’t want to sound robotic, so don’t memorize a speech word-for-word. Instead, work of bullet points or notes to give you a good idea of which stories and information come at what times. The only things you might want to rehearse to the point of memorization are your opening line, your closing line, and key transition points.</p>\n<blockquote>\n<p>Local user group meetups are always looking for speakers so if you approach them you will rarely hear a, ‘no.’\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-geshan-manandhar/\">Geshan Manandhar</a></em></p>\n</blockquote>\n<p>Practicing alone in front of a mirror is step 1, but most speakers recommend also getting some practice in front of a real group of people. Invite a few of your coworkers to a lunch-and-learn or submit your talk to a Meetup group. As the organizer of a Meetup in Chicago, I can tell you that we always like getting talks submitted by the community.</p>\n<h3>Smile and look like you’re having fun</h3>\n<blockquote>\n<p>Enjoy being on the stage and sharing your learnings and experience. Smile! Tell a joke. Be human, and you’ll notice the audience respond to you.\n<em><a href=\"https://blog.prezi.com/speaking-at-a-conference-here-are-10-things-the-organizer-wants-you-to-keep-in-mind/\">Mark Walker</a></em></p>\n</blockquote>\n<p>Finally, as you practice the transitions and mechanics of your talk, remember to smile and convey enthusiasm. Even if you’re actually a nervous wreck underneath, people in the audience can rarely tell if you put on a brave face. Faking enthusiasm and calm usually helps keep you that way, so it’s okay if this doesn’t feel natural at first.</p>\n<p>Creating a presentation for a conference talk is a never-ending job. You’ll probably refine your talks each time you give them, customize them based on the time slot and audience, and learn new things to add every year. As you do, keep in mind the presentation tips above.</p>\n<p>Now that you’ve started preparing your presentation, it’s time to get ready for the conference itself. In the next section, we’ll talk about the pre-conference and pre-talk logistics and best practices you should know about as a new speaker.</p>\n<p><a class=\"text-left d-block\" href=\"../success-rejection/\">Previous: Dealing with Success or Rejection</a>\n<a class=\"text-right d-block\" href=\"../pre-conference/\">Next: Preparing for the Conference</a></p>","frontmatter":{"layout":"post","title":"Preparing a Presentation","path":"/guides/speaking/presentation/","category":"Guides","tags":null,"date":null,"image":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}