{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"9957cf84-b1ea-5cdf-bb31-108a40c0b4d1","html":"<p>I first saw Anjuan speak at <a href=\"https://www.youtube.com/watch?v=9HuvC1ME68I\">The Lead Dev</a> in Austin, TX. I really love when technology speakers draw parallels to events and characters outside of our industry, so his talk on leadership lessons learned through the underground railroad was right up my alley. Anjuan is a prolific and talented speaker who’s taken the stage internationally, so I’m very excited to bring his story to you here today. In this interview, Anjuan outlines some of the topics he’s passionate about and lessons he’s learned in his speaker’s journey.</p>\n<!--more-->\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/9HuvC1ME68I' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Anjuan Simmons at The Lead Dev Austin</em></p>\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/CXHhfJH.jpg\" class=\"right\">\n<p>I’m an Engineering Coach at Help Scout, and my daily job is to make sure that the engineers on my team are successful and that we’re shipping features that our customers love.</p>\n<p>I got into public speaking at a young age. I did one-act plays in high school, and I also competed in <a href=\"https://www.uiltexas.org/speech/oral-interp/2019-20-uil-poetry-categories\">UIL poetry interpretation</a>. I’ve always been fascinated by the ability of human speech to change the world, and I hope that my public speaking is a small brick in the enormous wall of humanity’s ongoing attempt to make ourselves better.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I love speaking at conferences!</p>\n<p>I give my talks because I believe that I have something to say that will help the attendees be better at the work they do. So, speaking is a way that I can help people, and helpfulness is one of my core values. There’s nothing better than the feeling I get when people come up to me after my talk (or sometimes weeks/months later) and tell me how it changed the way they thought about the topic. It’s even better when they share how it changed their behavior!</p>\n<p>Speaking isn’t part of my job, but it has greatly benefited my career. During job interviews, I’ve had interviewers tell me how much they loved my talks! While giving great talks alone wouldn’t have gotten me the offer, being qualified and a good speaker has been an incredible combination!</p>\n<h3>What topics do you typically speak about?</h3>\n<p>My two primary topics are technology leadership and diversity and inclusion. My technology leadership talks draw on core principles as well as historical examples.</p>\n<p>My <a href=\"https://anjuansimmons.com/talks/leadership-lessons-from-the-agile-manifesto/\">Leadership Lessons from the Agile Manifesto</a> talk takes the values of the <a href=\"https://agilemanifesto.org/\">Manifesto for Agile Software Development</a> and distills lessons for engineering managers and technical leads. I give easy to understand guidelines for making the tough decisions that leaders have to make when guiding engineering teams.</p>\n<p>My Technical Leadership Through the Underground Railroad talk uses the story of the daring John P. Parker who was a Conductor on the legendary Underground Railroad. I use his experience helping a group of enslaved people in 19th Century America escape from the Slave States to freedom.</p>\n<p>I give a talk with my wife, Dr. Aneika Simmons, called Managing the Burnout Burndown, and we use the burndown chart used my many Agile teams as a metaphor for burning down stress. We describe how protecting your health, forming strong relationships, and removing distractions can help you avoid burn out.</p>\n<p>My Lending Privilege talk describes how everyone has privilege and can use it to create a more diverse and inclusive technology industry. We can all help those who lack our privileges be more visible, have their voices heard, and get a chance to contribute their expertise to the software development process at our companies.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I do remember my first talk. It was in the Vienna JS meetup, and I talked about a new library my team and I built at my current company. The idea was to share the library and promote it as open-source so anyone could use it. I was extremely nervous before going onto the stage, but the fact that my audience were developers too allowed me to relax a bit. At the end it went very well and smoothly. I got some very interesting questions after the talk and the people liked it.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/tJXzyHHh4pc' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Adrián Bolonio at ViennaJS</em></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve applied to around 15 international conferences so far. In the last 2 years I’ve been accepted to 4 conferences and several meetups.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/yKYA-7tczuk' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Adrián Bolonio on Accessibility at DevFest Vienna, 2018</em></p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>At the beginning I was nervous and my only routine was trying to calm down. Now I’m a bit more experienced, so I check that my computer has enough battery or I have a charger that works. I check that all my other applications are closed and my notifications are muted. I check that the microphone works properly and the screen where the presentation is shown is readable from any point in the venue.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>I think the best and more difficult advice is “calm down”.</p>\n<p>It’s ok to be a bit nervous, but try to understand that if you have been chosen to give a talk at a conference or at a local meetup it’s because you’re an expert in that field, so you know what you’re talking about. Just calm down, enjoy the talk, and accept any feedback.</p>\n<p>It needs to be fun for you, you don’t have to suffer, so please enjoy the process.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>Since I’m very focused now on Web Accessibility I follow a lot of experts, but some of them are <a href=\"https://twitter.com/mmatuzo\">Manuel Matuzovic</a>, <a href=\"https://twitter.com/_sergeikriger\">Sergei Kriger</a> and <a href=\"https://twitter.com/marcysutton\">Marcy Sutton</a>.</p>\n<h3>Where can readers find more about you?</h3>\n<p>My next speaker appearance in a conference will be at the <a href=\"https://jsconf.co/\">JSConf Colombia</a> on October 18th &#x26; 19th, 2019. You can follow me in <a href=\"https://twitter.com/bolonio\">Twitter</a> or <a href=\"https://www.instagram.com/bolonio/\">Instagram</a>, and check <a href=\"https://speakerdeck.com/bolonio/\">my latest talk slides on my deck</a> as well as my repositories in <a href=\"https://github.com/bolonio\">GitHub</a>.</p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Anjuan Simmons, Engineering Coach and Inclusive Technology Speaker","path":"/blog/speaker-anjuan-simmons/","category":"Speaker's Story","tags":null,"date":"2019/09/18","image":"https://i.imgur.com/CXHhfJH.jpg"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}