{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"0abdaa8d-f08e-5ce3-9b85-8d5d26f34653","html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Keanan Koppenhaver and I met through the <a href=\"https://www.meetup.com/Chicago-PHP-User-Group/\">Chicago PHP Usergroup</a> last year,\nand since we’ve been fortunate enough to share the stage at Midwest PHP, and share a meal in the airport on the way home.\nSpeaking is always a good chance to meet other people, but it’s also a fast way to learn new skills. I’ve seen several of\nKeanan’s talks including one about Alexa and another about serverless functions in PHP. Keanan also has an entrepreneurial\nspirit, which I appreciate, so it was great to learn more about his experience speaking.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/Mcsi3b6.jpg\" class=\"left\">\n<p>Hi I’m Keanan and I’m a developer-turned-CTO and I co-founded <a href=\"https://alphaparticle.com/\">Alpha Particle</a>, a digital consultancy in Chicago. I got into public speaking at one of my previous jobs when we decided that our company should get more involved in the development community. So I started reading up on exactly how conferences decided on talks and started submitting to CFPs!</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I really enjoy all the people I’ve been able to meet as a result of the speaking that I’ve done. <strong>I especially enjoy chatting with people at the speaker dinners or other informal events surrounding the conference.</strong> As far as benefits to my career, some of these connections I’ve made at conferences and meetups have definitely helped me land further speaking gigs, new clients and even (arguably) this interview.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first conference talk was at WordCamp Nashville in 2016. The <a href=\"https://wordpress.tv/2017/03/17/keanan-koppenhaver-take-wp-admin-to-the-next-level-with-advanced-custom-fields/\">video is actually online</a>, though I cringe watching it. It was a 20 minute “lightning talk” and I remember having to follow an awesome speaker who had the audience on the edge of their seat the entire time. The majority of my talk actually went well, but near the end (~14:00) you can see my heart jump up into my throat when one of my demos didn’t work correctly! Luckily, I was able to fix it and finish the talk, and <strong>this definitely wasn’t the last time demos didn’t work exactly right</strong>.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Between conferences and meetups, I’ve probably spoken at between 20-30 and applied to probably twice that many. I don’t really apply to conferences that I don’t feel like I’d be a great fit for, but even then sometimes they just really can’t take everybody.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p><em>Cue Eye of the Tiger montage…</em></p>\n<p>But seriously, I usually just try to get into the room I’ll be speaking in before I have to give my talk (either by getting to the conference early in the morning or during lunch) and make sure my computer can interface with the projector and that the fonts on my slides are readable even in the back of the room.</p>\n<p><strong>I always try to attend the talk before mine in the same room</strong>, just so I can start setting up and doing a final check of everything as soon as the last presenter is done with their talk.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>I think there’s definitely lots of feelings from new speakers around not being knowledgeable enough to start speaking. <strong>But if a conference was only filled with super-advanced talks, they would lose a huge part of their audience.</strong> So, even if you just learned something, you can teach it and many attendees will welcome your perspective as a relatively-recent beginner. <strong>Since you just went through it all for the first time yourself, you know and remember all the roadblocks that someone getting started will have and can help them learn even quicker.</strong></p>\n<p>In addition to that, the one thing that started really getting me more speaking opportunities is <strong>submitting multiple talks to each CFP</strong>. Conference organizers sometimes have an agenda of the talks they’re looking to accept and if you submit more talks, you give them more chances to fit you into the schedule they’re looking to craft. (However, some conferences specifically say to not submit more than X talks, so definitely abide by that.)</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I really enjoy <a href=\"https://twitter.com/garybernhardt\">Gary Bernhardt</a>, specifically <a href=\"https://www.destroyallsoftware.com/talks/the-birth-and-death-of-javascript\">Wat and The Birth and Death of Javascript</a> just because he manages to inject lots of humor into his talks while still keeping them super informative. I also loved <a href=\"https://www.ted.com/talks/tim_urban_inside_the_mind_of_a_master_procrastinator?language=en\">Tim Urban on Procrastination</a> just because of both his graphics and the way he walks the audience through his talk.</p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>More info about me is at <a href=\"https://keanan.dev\">keanan.dev</a> but most of the writing I do is on our company site at <a href=\"https://alphaparticle.com\">alphaparticle.com</a>.</p>\n<p>I’m speaking at a few meetups here in Chicago in the coming months, so I hope to see some familiar faces there!</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Keanan Koppenhaver, Software Developer and Entrepreneur","path":"/blog/speakers-story-keanan-koppenhaver/","category":"Speaker's Story","tags":null,"date":"2019/05/05","image":"https://i.imgur.com/Mcsi3b6.jpg"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}