{"pageContext":{"isCreatedByStatefulCreatePages":false,"group":[{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>While Bailey has been practicing public speaking her whole life, she was drawn to speak at tech conferences after seeing so many design and development teams struggle to put their message online. One thing I love about speaking is getting to attend conferences and hear other talks - especially from subject-matter experts who are truly passionate about their craft. Bailey is one of those passionate people, and I’m excited to bring you her story here today.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p>I’m director of content strategy at usability consulting firm <a href=\"https://truematter.com/\">truematter</a> out of Columbia, South Carolina. I’m a user experience content strategist which means I plan, organize, and write the words people use to interact with websites, applications, and software products. I’ve been involved in public speaking throughout my life, especially when I was younger.</p>\n<p>Recently, I felt a call to pick it up again for many reasons but one in particular: design and development teams must change their approach to words online. Many, many organizations (including those that should know better) still write their online content the same way they would for traditional media. That approach drags down their product’s user experience, makes it harder for customers to engage with them online, and has a large negative impact on the success of their digital products. I set out to speak out about this widespread problem and how we should fix it.</p>\n<img src=\"https://i.imgur.com/l6UnYFz.jpg\" class=\"center\">\n<h3>What do you like about speaking at conferences?</h3>\n<p>I’m still pretty new on the conference scene but even so, <strong>I’ve already made a lot of connections with both people in my field and those outside of it.</strong> I think it’s a lot easier to meet people when you’re the one giving the presentation because 1) people already know a topic they can discuss with you which cuts out a lot of networking small talk and 2) people come up to you instead of you having to approach them every time – a real plus for an introvert like me.</p>\n<p>Also, I’ve found so far speaking is a great way to visit new places – I often take a couple of days before or after to explore the area outside of the conference hotel.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>It went well! I think I was surprised when I found out that people do actually care a great deal about their digital content and want to know how to make it better and more usable. The audience had a ton of questions, which was great. The whole thing is kind of addicting. You experience it once and think, “I want to do that again.”</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve spoken at about ten events so far with another four or five already scheduled for later this year.</p>\n<p>I’ve applied to a lot more than that for sure. I probably send out three applications a month and that number has been growing lately. But <strong>the more I apply and the more I speak, the more conferences are approaching me instead of the other way around and that’s a really nice feeling.</strong></p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/ATVKZdl_pEw?start=130' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Bailey Lewis at OKC Design Tech</em></p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I always try to see the space before I speak in it. That could mean swinging by the room before my presentation or trying to find a video of a presentation someone else gave in that room online. Seeing the space before my presentation lets me decide where to stand and helps me understand how the audience will be looking at my slides (one big screen? multiple screens around the room? etc).</p>\n<p>Other than that, <strong>I take a deep breath and remind myself: The audience came to see me present on this topic.</strong> They want it to go well as much as I do. And that’s a lot more helpful than imagining them in their underwear.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>If you’re brand new, it might be hard to find speaking gigs that will cover your travel and accommodations. The conference might even ask you to pay to attend even though you’re speaking (not my favorite practice but there you have it).</p>\n<p>Take a few of these gigs if you need to so you can get started and get your name out there, but as soon as someone offers to cover your travel/accommodations, demand it every time you speak afterward. Even better if you can throw a speaker stipend into the mix. That will probably mean saying no to conferences you’d really like to speak at, which can be painful. But once you reach certain level in your speaking career, you shouldn’t be digging in your own pockets when you’re the one providing the presentation content that will sell conference tickets and make the event successful.</p>\n<p>By the way, <strong>I love that CFP Land lists which “perks” each conference offers (travel/hotel/stipend), if any. It means I don’t have to get all the way to have my paper accepted just to realize that I’m expected to fork over a couple of grand for the privilege of presenting.</strong></p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I’m not sure about specific conference speakers (although there are presentations I’ve really enjoyed), but my father is a trial attorney and, among other speaking-related lessons, he taught me the art of giving a presentation without swaying or fidgeting. He would record me giving a presentation and then have me watch it back – it was extremely effective for getting rid of the fidgets.</p>\n<h3>Where can readers find more about you?</h3>\n<p>Find me at <a href=\"https://truematter.com/baileylewis\">truematter.com/baileylewis</a>. You can see my speaking schedule, bio, and articles I’ve written about usability and content strategy.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Bailey Lewis, User Experience Strategist","path":"/blog/speakers-bailey-lewis/","category":"Speaker's Story","tags":null,"date":"2019/07/10","image":"https://drive.google.com/uc?id=1RpcWsNdVMfTW6_U0-Sl02gAI1IRUemLA"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Like many technology professionals, Gant Laborde didn’t instantly take to speaking. It took time, hard work, and lots of practice for Gant to get comfortable in front of a crowd, but fortunately he stuck with it. He’s now spoken at over 50 conferences, and made himself an integral part of the tech conference community. Keep reading to learn more about how Gant got started, what he recommends for new speakers, and some of the influencers that inspired him to continue his journey.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/fXaa5bp.png\" class=\"right\">\n<p>When I was in college, I was paralyzed by the fear of public speaking. Just the thought of talking in front of a small class would cause cold-sweats. Fortunately, I was studying for a career in Comp Sci. which usually doesn’t require much public speaking.</p>\n<p>Once my career began, I was reaffirmed, no one wants to hear a developer speak. That was fine for a few years, and then new nagging energy began. People can’t listen if you don’t speak. Quietly interjecting important points without ever taking the lead of a conversation is less effective than not speaking at all. It was time to start breaking out of my shell.</p>\n<p><strong>Though I was uncomfortable, I started speaking up more and more.</strong> I attended conferences, and I marveled at speakers. I was amazed, but sure I would never be on the other side of the 4th wall.</p>\n<p>Fortunately, I joined Toastmasters, met cooler people, and with a lot of time and energy, now people can’t shut me up. It’s always a pleasure to help my fellow speakers and aspiring speakers. The journey wasn’t comfortable, but it’s doable. Now <a href=\"http://gantlaborde.com/\">you can see I’ve been speaking actively for years</a>.</p>\n<p>I’m very fortunate that I work for the great people at <a href=\"https://infinite.red/\">Infinite Red</a> who have supported me from lightning talk to keynote speaker.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p><strong>The best thing about speaking at conferences is the networking and connection. I’ve made friends around the world.</strong> This has, directly AND indirectly, benefited my career and employer. It’s not required in my job description, but it’s valuable to everyone involved.</p>\n<p>There’s something impressive about going to a city for the first time, and have people walk up and introduce themselves to me, mentioning past talks or blog posts. I’m still an introvert, but it doesn’t matter who you are, something like that feels great. The community and positivity of it all is superb!</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>After a lot of Toastmasters, and speaking at a local meetup, my first “conference” talk was a lightning slot at RubyConf 2013.</p>\n<p>How’d it go? Well, my heart was beating through my chest. But I gave a 30-minute presentation in 5 minutes after getting over my fear of public speaking, so there was no way to fail :)</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/gJOkpP__dY4?start=4829' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Gant Laborde at RubyConf, 2013</em></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>50+ and no stopping in sight!</p>\n<img src=\"https://i.imgur.com/XfgC3IW.png\" class=\"center\">\n<h3>Do you have a pre-talk routine?</h3>\n<p>Some <a href=\"https://twitter.com/GantLaborde/status/1107007420763639808\">general rules for sure</a>:</p>\n<ol>\n<li>No dairy</li>\n<li><a href=\"https://www.ted.com/talks/amy_cuddy_your_body_language_shapes_who_you_are\">Power Pose</a></li>\n<li>Think more about your audience than yourself</li>\n<li>Realize the audience wants you to succeed, and they can’t see that you’re nervous unless you tell them.</li>\n<li>They will feel what you feel. So 😃 (smile)</li>\n</ol>\n<h3>What advice do you have for new speakers?</h3>\n<p>You’re not done and you’re not stuck. <strong>For a lot of people, level 1 was just speaking. Then it’s to speak well. Then it’s to fill a room, then get invited to speak, then keynote.</strong> The best speakers are people who have been leveling up for 20+ years, and they support and promote speakers who are just getting started. It’s not a zero-sum game, ask for help, get feedback, and improve. Then repeat. The best speakers aren’t born speakers.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I LOVE TED TALKS! <a href=\"https://medium.com/@gantlaborde/5-ted-talks-that-changed-me-4aa0cec43d79\">Here’s 5 that have made me recontextualize life</a>.</p>\n<p>As for Tech, I’d say <a href=\"https://twitter.com/jevakallio\">Jani Evakallio</a> has been amazing every talk I see. His experience (not talk, but experience) <a href=\"https://www.youtube.com/watch?v=mVcMAtaAwsA\">at RNEU was terrific for everyone in the audience</a>.</p>\n<p>Also, if you haven’t seen Charlie Chaplin’s speech in <em>The Great Dictator</em>, <a href=\"https://www.youtube.com/watch?v=w8HdOHrc3OQ\">prepare to have your mind blown</a>.</p>\n<h3>Where can readers find more about you?</h3>\n<p>All my upcoming talks are available <a href=\"http://gantlaborde.com/\">on my site</a>.</p>\n<p><a href=\"https://twitter.com/GantLaborde\">Follow me on Twitter</a> where semi-smart memes happen.</p>\n<p>And <a href=\"https://medium.com/@gantlaborde\">here’s my Medium</a>, where I can’t seem to shut up.</p>\n<p>Most importantly, say “hi” if I’m ever at a conference and you’re there.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Gant Laborde, Technology Team Leader, Speaker and Author","path":"/blog/speakers-story-gant-laborde/","category":"Speaker's Story","tags":null,"date":"2019/07/06","image":"https://drive.google.com/uc?id=1X12pOsW--LMyYgZblQnbybiz_KMHfFTF"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Tejas Kumar has dealt with haemophilia his whole life, but despite his disease preventing him from completing a traditional computer science education, he’s used his self-taught knowledge and communication skills to achieve success as a developer. Now, as a tech conference speaker, he’s giving back to other developers by passing on what he knows. Looking through Tejas’ social profiles, you’ll see that he doesn’t take himself too seriously, but his informal, casual tone is part of what makes him a unique and interesting speaker.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p>I’m Tejas. I love people and code and the conversations we have together. I’ve been a public speaker since a young age. I grew up with a fatal sickness (that I still have) where I couldn’t do much and I often felt like I’d never amount to much, so in some ways, I guess I’ve been drawn to public speaking to overcompensate. ¯\\_(ツ)_/¯</p>\n<img src=\"https://i.imgur.com/MdV43uT.png\" class=\"center\">\n<h3>What do you like about speaking at conferences?</h3>\n<p>I like encouraging the community. I often learn things and I enjoy disseminating the information from stages and then having conversations about it later. <strong>Truth be told, I enjoy the private conversations that happen after a good talk <em>a lot</em>.</strong></p>\n<p>While it has directly benefited my career with a number of job offers, visibility, Twitter followers, all kinds of glitz and glam, the real value I see from this type of engagement is the love. I get to share hope with people, combat impostor syndrome, and see careers flourish; life change from a stage. It’s all very encouraging.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I remember doing a TEDx talk like 7 years ago. It was really well received. I think there was even a standing ovation. It was fun. 🙂</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/TUIcTl9Hto4' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Tejas presenting “Papercuts Can Kill” at TEDx</em></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I think I’ve applied to like 20 and spoken at like 9? It’s a gut feeling though. I have no real idea.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p><strong>I often put myself into the mindset of “I’ve won” already before I even play.</strong> This gives me hope and like prepares me to do an amazing job. Eventually, it somehow becomes a self-fulfilling prophecy. Odd, maybe, but it works for me every time.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>You’d be surprised by how much value you can add with a talk. Our tech industry today is so full of <a href=\"https://twitter.com/TejasKumar_/status/1126096390281732097\">faux confidence and pretend knowledge</a> that one would often feel like they don’t know enough – I know I feel this way most of the time. The truth is, I actually know quite a bit <em>in my own, very specific area</em> that I can use to educate and help others who aren’t as familiar with it.</p>\n<p><strong>I’m often insecure about kubernetes, data structures and algorithms, and CS fundamentals because I personally was always too sick to get a Computer Science degree. I don’t have one. I am a prime example of impostor syndrome.</strong></p>\n<p>That said, I feel there are just as many people insecure about React, TypeScript, CSS and other areas. I rejoice at the idea of combating their impostor syndrome with my experience in these subjects. For me, this is part of the joy of public speaking along these themes.</p>\n<p>I’ve always been extremely uncomfortable with my <em>content</em> not being technical enough because I often feel like I lack technical skill, but I’ve always been confident with the delivery because it seems to come naturally to me for whatever reason. As a result, I am trying to better my technical abilities to “close the loop”.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I’ve been inspired by a lot of speakers, inside and outside of tech circles. I especially appreciate <a href=\"https://twitter.com/mweststrate\">Michel Weststrate</a> and <a href=\"https://twitter.com/LeaVerou\">Lea Verou</a>’s speaking styles as well as <a href=\"https://twitter.com/sarah_edo\">Sarah Drasner</a> and <a href=\"https://twitter.com/darcar31\">Daria Caraway</a>.</p>\n<h3>Where can readers find more about you?</h3>\n<p>I’m most active on twitter under <a href=\"https://twitter.com/tejaskumar_\">@tejaskumar_</a>. I also have a website where people can learn to code and/or troll me depending on their mood at <a href=\"https://tejaskumar.com/\">tejaskumar.com</a>.</p>\n<p>My next talk is not yet announced, but one talk coming up is at JSConf Budapest about the performance of various UI frameworks in serverless architectures.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Tejas Kumar, Lifelong Speaker and Frontend Development Lead","path":"/blog/speakers-story-tejas-kumar/","category":"Speaker's Story","tags":null,"date":"2019/06/29","image":"https://drive.google.com/uc?id=1Wsb2E7Wl1wL9UMT-aYT1XZKn2kan8tL3"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>I was fortunate enough to meet Matt in real life at Midwest PHP, 2019 as he was giving one of the keynotes there. I think our first conversation was awkward nods in the hotel gym way too early before the conference, but once that was over, we got to talk throughout the conference.</p>\n<p>In addition to speaking, Matt is an active open source maintainer, and has been giving back to the PHP community in various ways for the past several years. He also speaks on behalf of <a href=\"https://osmihelp.org/\">OSMI</a> - a great organization that helps raise awareness of mental health issues in the tech community - so I’m excited to present his journey into speaking and tips for those who are new to it.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/YjtivW4.jpg\" class=\"right\">\n<p>During the day I’m a senior software engineer at a company called MoreCommerce where we do small and medium-sized business e-commerce and market place offerings. Outside of that, I help maintain various API related OSS projects like Fractal, openapi.tools, standards.rest and a few others. I spend most of my free time doing photography or cycling.</p>\n<p>As for speaking, I got my start at my old PHP user group in Atlanta. I started with a lightning talk and moved up to a full-length talk before breaking into a conference. Im usually pretty shy and quiet, so it was weird at first but it been a lot of fun.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>One of my favorite things about speaking is <strong>it’s an excuse to learn and play with new technology</strong>. I wouldn’t have become passionate about the OpenAPI spec if a conference hadn’t given me a chance to speak on it for example. And because my day job tends to focus more on boring tech that works, <strong>giving conference talks lets me experiment with stuff I know we wouldn’t touch at work.</strong></p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>It feels so long ago, but my first talk was at a now-defunct conference called “Great Wide Open”. I submitted a talk essentially about why community is awesome and how it can help someone learn. Since it was my first talk I was incredibly nervous but somehow I pulled it off. I got good feedback for it, and felt like I could have massaged it a bit into a more full talk.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>This year I will have spoken at 5, including 2 (maybe 3) keynotes. That’s the most I’ve ever done. Last year I spoke at one conference.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p><strong>I usually put on some music, like Run The Jewels and just zone out.</strong> I tend not to sit in a talk before my slot so I can keep my thoughts going. Everyone is different, what works for me doesn’t mean it’ll work for someone else. I know some speakers will hide in their hotel room up until their talk, others just talk and socialize like its nothing. I’m also bad in that I will still be doing slides up until my talk. I should fix that.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>For your first talk, <strong>pick a topic you are passionate about but also already knowledgable about.</strong> Don’t experiment on new topics until you start getting accepted to speak. No need to add pressure on top of everything else.</p>\n<p>When you submit your CFP, check your spelling and grammar. It’s amazing how many people overlook it.</p>\n<p>Another thing is <strong>don’t immediately submit your abstract. Write it, and then talk a walk, get away from it, and come back after an hour and see how you feel about it. You may see things you can do better.</strong></p>\n<p>Finally, submit multiple submissions, it gives you better odds. When we organized <a href=\"https://twitter.com/southeastphp\">Southeast PHP</a>, people with multiple submissions had a better shot getting into our post-apocalyptic Thunderdome over someone who only gave us one thing to choose.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I’m pretty short so I look up to pretty much everyone.</p>\n<ul>\n<li>Jenna Quindica</li>\n<li>Josh Holmes</li>\n<li>Kat Zień</li>\n<li>Phil Sturgeon</li>\n<li>Ben Edmunds</li>\n<li>Cal Evans</li>\n<li>Ed Finkler</li>\n<li>Alena Holigan</li>\n<li>Sammy Kaye Powers</li>\n<li>Ian Coldwater</li>\n<li>Olivia Liddell</li>\n<li>Nic Steenhout</li>\n</ul>\n<p>And so many more I can’t remember because I cycled 24 miles tonight so I’m tired.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/QRYimzIWS84' frameborder='0' allowfullscreen></iframe></div>\n<p><em>API Pain Points by Phil Sturgeon</em></p>\n<h3>Where can readers find more about you?</h3>\n<p>I blog occasionally at <a href=\"https://matthewtrask.net/\">matthewtrask.net</a> and post silly things like pictures of my dog at <a href=\"https://twitter.com/matthewtrask\">@matthewtrask</a> on twitter.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Matthew Trask, Open Source Maintainer, Cyclist, and Speaker","path":"/blog/speakers-story-matthew-trask/","category":"Speaker's Story","tags":null,"date":"2019/06/26","image":"https://drive.google.com/uc?id=1tKPDmLLTDC9oiurc3D3tgkKrnMGVW-qy"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>I find the most interesting people are those who are passionate and devoted to a cause. Drishti is both of those things. Besides being a computer engineer and speaker, Drishti runs a non-profit in India that has already impacted 10 cities, and gotten Drishti attention in her state.</p>\n<p>While this would be impressive enough, Drishti also uses her talent for public speaking to inspire and help others learn more about technology - something that many speakers can likely identify with. I’m thrilled to bring you Drishti’s story today, and hope it inspires you to get out and do some good in the world!</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/w36pjbN.jpg?1\" class=\"left\">\n<p>Hi, I am Drishti Jain a Computer Engineer at heart and a technology enthusiast. I love to use technology to help the less fortunate. I am a social entrepreneur. I am the Co-founder and President of the non-profit organisation <a href=\"https://www.facebook.com/samyakdrishtifoundation\">Samyak Drishti Foundation</a> which works in environment, education and healthcare sectors in 10 cities across India. I have been titled <a href=\"https://www.instagram.com/theoptimistcitizen/p/BdT0mVJnMhU/\">Eco-Warrior thrice by the Government of Maharashtra, India</a>.</p>\n<p>I have been a good orator since a young age. I got into public speaking at school in grade 4; when I had to give a speech on Mahatma Gandhi Jayanti (for his birth anniversary). Ever since, I’ve loved the stage and sharing knowledge with all. Fun Fact: I also host music concerts sometimes :)</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I love speaking at conferences about things that I am passionate about. While I continue to learn new things and develop myself, I like to share my learning with others. Speaking at conferences, I am sharing with everyone about how cool a technology is or how I make the most of a feature. It gives me immense satisfaction to share my knowledge with all.</p>\n<p>I have learnt a lot speaking at conferences. I would like to share my secret weapon to effectively speaking in front large audiences.</p>\n<p><strong>My secret weapon – the 3 P paradigm: Pace, Pitch, Pause.</strong> These are three key parts of speaking effectively at conferences. Using this paradigm, I am able to more effectively deliver my knowledge.</p>\n<p>Moreover, speaking at conferences I am able to share my learning with all and give them a head start in the technology. I am believer of “Learning by sharing Knowledge” and speaking at conferences just fuels that!</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first conference talk was an exciting experience. Post deciding my topic (after a lot of brainstorming) I realized that I had just entered the long hiking trail of preparing my talk, yet to embark. There was a mountain of information I had gathered through research on the topic. And I had to create my talk in a way that I would cover maximum information and make it interesting. <strong>It all seemed overwhelming at first; but I decide to sit and create a summary of the information, that made it easy to prepare my talk.</strong></p>\n<p>On the day of the conference, I reached the venue early and checked if my laptop was compatible with the system; it was all ok and I was set to present my talk. Having reached early, I got comfortable with the environment and eagerly waited for my talk slot.</p>\n<p>I gave my talk and had a good Q and A for my talk; which gave me the assurance and satisfaction that I presented well and attendees were listening keenly.</p>\n<p>It was an amazing experience!</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Considering events, workshops, tech talks, conferences I have spoken at about 30-40; including a few virtual speaking engagements.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I attend the talk before my talk to set into the energy of the conference hall. <strong>I also do a demo practice with a friend to gain feedback.</strong></p>\n<p>I feel enthusiastic over nervous before my talk. I believe I have learned to convert my nervous energy into enthusiasm by practicing before my talk. I know it can be difficult due to packed schedules of the conference and work; but I do make sure to make time to practice. Sometimes I skim through my talk contents or rehearse the complete talk depending on the time I can make in my schedule.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>I will encourage new speakers to speak about what they are truly passionate about. <strong>When you speak about something that you are passionate about; you will actually be pretty excited to speak instead of being nervous. And your energy will be reflected when you present.</strong> It will boost your confidence and you will enjoy speaking!</p>\n<p>If you feel crunching everything you love about the topic into the 30/45 min talk is getting on to you, <strong>go outside and have fresh air. It will help you have a clear head and invoke creativity in your talk.</strong> It is very trivial to know the audience you will be presenting for. Most importantly remember to be yourself and be excited to share with the world what you like about the technology.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I got inspired by the talk by <a href=\"https://twitter.com/pranavmistry\">Pranav Mistry</a> on the Sixth-Sense technology. I liked how he presented the technology and included components in the talk that could be understood by someone new in the technology space. It has inspired me to include an overview of concepts related to my topic in the beginning of my talk for a couple of minutes, so that a participant novice to the topic understands the overall picture and doesn’t feel left out.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/YrtANPtnhyg' frameborder='0' allowfullscreen></iframe></div>\n<p><em>TEDIndia: The thrilling potential of SixthSense technology by Pranav Mistry</em></p>\n<h3>Where can readers find more about you?</h3>\n<p>I am active on Twitter at <a href=\"https://twitter.com/drishtijjain\">@drishtijjain</a>. I post about my speaking engagements, and new technology I’m learning there.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Drishti Jain, Social Entrepreneur and Technology Enthusiast","path":"/blog/speakers-story-drishti-jain/","category":"Speaker's Story","tags":null,"date":"2019/06/22","image":"https://drive.google.com/uc?id=1U68-cTVRSrITL_0eCIgzL55kKORJqsl_"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Kara Luton’s path from ballerina to public relations to software engineer may be unusual, but with more software developers coming from non-traditional backgrounds, it’s not as surprising as it used to be. What’s impressive to me is how quickly Kara has embraced her new career and been able to help others by giving talks at conferences and meetups. As Kara points out in this week’s Speaker’s Story, speaking is a great way to bolster your career and encourage others in the field.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into tech and eventually public speaking?</h3>\n<img src=\"https://i.imgur.com/zFT1aBg.jpg\" class=\"right\">\n<p>I had a weird path to tech. I pursued a career as a professional ballerina for a long time. I even moved to New York City by myself at 17 to train full-time with the Joffrey Ballet School. I really loved ballet but I realized that I’d be lucky if I could make my career last until I was 30 due to all of the strain it puts on your body.</p>\n<p>That’s when I decided to take a break from ballet, move back to my hometown of Nashville, TN, and go to college. I majored in public relations with a music business minor and was one of the lucky few to land a job in the music industry after I graduated.</p>\n<p>I absolutely loved working as a music publicist. It was a very glamorous job but also a highly stressful one and I was getting burnt out pretty quickly. I knew I needed a change and started looking into other career paths when I stumbled upon <a href=\"https://www.codecademy.com/\">CodeCademy</a>. I really enjoyed the feeling of solving an error and decided that I wanted to make the leap to tech so I enrolled in The Iron Yard’s front end engineering bootcamp. Fast forward almost three years later and I’m still loving life in the tech world. I’m currently working as an engineer on the UX team at <a href=\"https://www.crowdstrike.com/\">CrowdStrike</a>.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>Speaking at conferences has definitely benefited my career. It’s allowed me to expand my network in ways that I’ve never imagined before!</p>\n<p>I got into conference speaking first by writing blog posts which eventually led to speaking at local meetups and then conferences. I like that by speaking at conferences I can help others learn. <strong>It’s really cool that the way I present something or specifically explain something can help make whatever I’m talking about click with someone in a way that it hasn’t before.</strong></p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I gave my first conference talk not too long ago! Big shout out to CodeStock for allowing me the opportunity. I’m really happy with the way my talk turned out. I talk fast naturally and talk even faster when I’m nervous so I was worried that my 60-minute time slot would end up being closer to 20 minutes. I took my time and a couple deep breaths and managed to use up most of my allotted time though!</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’m still pretty new to the speaker circuit so I’ve only applied to around eight conferences. I’ve spoken at one so far and am currently on the waitlist for another. <strong>I really appreciate when conferences give you feedback so you can apply that to the next one you submit to. I’m learning from each rejection I get.</strong></p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I don’t like to attend a session before my talk as I like to take that time to be by myself and compose my thoughts. I’ll typically run through my slides one last time but I’ll only do a visual run through - I won’t actually practice. I also like to take a minute or two to go somewhere on my own and give myself a little pep talk!</p>\n<h3>What advice do you have for new speakers?</h3>\n<p><strong>Go for it! You can never succeed if you don’t try.</strong> Submit to conferences that seems interesting to you and don’t give up on trying again if one tells you no. Even the most experienced speakers get rejections.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I really love watching Chloe Condon’s talks. I love how she injects humor into them.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/2n3GHyWTaM8' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Chloe Condon at DevXcon, 2018</em></p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>Feel free to follow me on Twitter! My handle is <a href=\"https://twitter.com/karaluton\">@karaluton</a>. I tweet a lot about the tech world and, if I’m being completely honest, about dogs too.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Kara Luton’s Journey from Ballerina to Software Engineer to Conference Speaker","path":"/blog/speakers-story-kara-luton/","category":"Speaker's Story","tags":null,"date":"2019/06/16","image":"https://drive.google.com/uc?id=1ZqIoJcNjQuWNQrDRQJGF-pMD8l6EqU_3"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>As a freelance developer, it can be hard to justify the time and energy required to speak at conferences, but for George Mandis, the experience is well worth it. Like many speakers, George is an experienced software developer who’s passionate about mentoring and teaching newcomers to the field. In this week’s interview, hear more about how speaking at over 20 conferences so far has helped take George’s career to the next level.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://georgemandis.s3.amazonaws.com/holyjs-piter-2017/me-holy-js.jpg\" class=\"right\">\n<p>My name is <a href=\"https://george.mand.is/\">George Mandis</a>. I’m currently a full stack, independent web developer at <a href=\"https://snaptortoise.com/\">SnapTortoise</a> based out of Portland, Oregon, though I wear quite a few other hats. I’ve been freelancing for 13 years, but over the past 4 or 5 years I’ve gravitated towards mentorship roles. Teaching classes, workshops, leading bootcamps and working with junior developers one-on-one has been a rewarding experience and speaking feels like a natural extension to this.</p>\n<p>My first foray into speaking was actually at an Ignite event in Portland where I summarized, in 5 minutes, my experience <a href=\"https://www.youtube.com/watch?v=T2QC43jwPyM\">living as a digital nomad</a> for a year. I was terrified to speak in front of so many people, but it went well! After that I though I should look into conference speaking as a way to advance myself professionally, extend the aforementioned mentoring activities I mentioned and continue to travel and see the world, which is one my biggest passions.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/T2QC43jwPyM' frameborder='0' allowfullscreen></iframe></div>\n<h3>What do you like about speaking at conferences?</h3>\n<p><strong>Speaking at conferences is a really fun way to meet other developers and get outside perspectives on things — not just outside your particular industry, but outside your own country!</strong></p>\n<p>It’s always interesting to me to see one type of work or technology in-demand in one place and find it barely mentioned at all in another. It’s also nice to humanize other developers and put a face and a personality to a name. These conferences also have a tendency to be expensive and difficult to otherwise attend, as an independent developer. Being able to attend these conferences and pick the brain of people who work at some very large, influential tech companies is a wonderful opportunity.</p>\n<p>I think the process of preparing a talk and speaking in front of a large group people could benefit anyone’s career, but for mine it’s certainly opened some doors. <strong>Recently I joined the Google Developer Expert program, which is something that would have very likely not happened without my conference speaking.</strong></p>\n<p>The other benefit of speaking is I’ve found it’s a great opportunity to talk about the things you want to be doing, even if it’s not the thing you’re necessarily doing in your day-to-day. My talks tend to focus on creativity, art, hardware-dabbling and making interesting, outside-the-box projects through JavaScript. Speaking on these topics has allowed me to spend more time immersed in that world and meet other like-minded and very talented people with similar interests.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My very first “talk” was the 5-minute Ignite talk I mentioned earlier, but my first <em>technical</em> talk was at HolyJS in Russia. I remember applying to a number of conferences by that point in the year. Some had accepted me but had no budget for travel, but HolyJS was the first one where everything lined up.</p>\n<p>The idea of talking for a full hour was incredibly daunting — I’d never done that before! When I pulled up the conference website I became even more nervous — David Crockford and Lea Verou were two developers I’d read and followed for most of my career, and they were head-lining the conference! My attitude going in was, <strong>if this goes terribly, at least I’m 2000 miles from home and probably won’t ever run into any of these people again.</strong> It sounds funny, but it really took the pressure off!</p>\n<p>Fortunately it went well, and I’m happy to say I’ve seen several familiar faces from that conference at other conferences since then.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’m not sure I could put a number on the number I’ve applied to. I’ve spoken at something around 20 now, but can guarantee you <strong>my acceptance rate is in the single digits, percentage-wise.</strong> Like most opportunities, it really is a numbers game. You have to be diligent and persistent, but also mindful of how you might be able to tweak your proposals to better suit a particular conference’s theme.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>If I have time a day or two before the conference <strong>I like to walk to the venue from wherever I’m staying so that I’m not thinking too hard about finding it on the day I present.</strong> In the hours leading up to the presentation I practice saying key sentences and takeaways for specific slides as I go through the slide from beginning to end, over and over, and make sure all my demos work. Once it’s about 30-minutes or so to go I’ll put the slides away and just try to clear my head. This routine changes depending on how new the talk is and how comfortable I’m feeling with it.</p>\n<p><strong>I also try to see as many other talks as I can</strong>, though I that can be difficult sometimes when my nerves are racing and my talk is still looming. After I’ve given my talk I’m much more relaxed and find it easier to enjoy the other talks. I try to make a point of shaking hands with all the speakers I see and letting them know I really appreciated what they spoke on. Other speakers might have differing opinions on that, but I know I genuinely appreciate it when someone in the audience comes up to me just to let me know they enjoyed my talk.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>When it comes to applying <strong>it really is a numbers game.</strong></p>\n<p>Apply early and often and try not to get too down on yourself if your talk isn’t accepted. For topics, there are many schools of thought on this, but I personally feel sharing a case study or story about how you used a particular piece of technology to achieve a specific goal is a good approach for giving your talk structure. Talking about why technology X is cool in general way can be just fine, but sharing how we used X at Y to achieve Z gives the audience something more concrete to walk away with.</p>\n<p>If you’re giving a workshop you can dive more deeply into the nitty-gritty workings of a thing and keep your focus there, but in a 20-40 minutes talk it’s more about introducing an idea and making the case for why others should have interest in it.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>There are quite a few, but I’ll mention two people I met at my very first talk who I think are wonderful: <a href=\"https://twitter.com/LeaVerou\">Lea Verou</a> and <a href=\"https://twitter.com/g33konaut\">Martin Splitt</a>. The list could be much longer, but I’ll stick with those for fear of omitting someone! I feel both of them have real passion for the web as an open platform and convey their enthusiasm and knowledge very well when they speak.</p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>Next, I’ll be giving a talk called <a href=\"https://www.crowdsupply.com/teardown/portland-2019\">“Hacking Hardware with JavaScript” at Teardown 2019 in Portland, Oregon</a>.</p>\n<p>You can find out more about me, my projects, writing and where I’m speaking next on my website: <a href=\"https://george.mand.is/\">george.mand.is</a> and follow me on Twitter at <a href=\"https://twitter.com/georgeMandis\">@georgeMandis</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: George Mandis, Digital Nomad and Web Developer","path":"/blog/speakers-story-george-mandis/","category":"Speaker's Story","tags":null,"date":"2019/06/08","image":"https://georgemandis.s3.amazonaws.com/holyjs-piter-2017/me-holy-js.jpg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>This week, I interviewed Rhia Dixon, a relatively new conference speaker who’s been accepted to speak at 6 conferences in her first year on the stage! While new to speaking at conferences, Rhia obviously has a gift for communication, and sometimes beginners are actually the best people to take advice from. Read on to hear Rhia’s fresh approach to tech conference speaking and some of the fantastic women in tech who have inspired her.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/GLa6cwP.png\" class=\"right\">\n<p>I’m a software engineer from Kansas City, Missouri. I love to tech, and I love to share the cool things I’ve learned with other people.</p>\n<p>I have always enjoyed going to schools to speak to students, but I was intrigued by conference speaking. One fateful evening I told <a href=\"https://twitter.com/likeOMGitsFEDAY\">Jennifer Wadella</a>, founder of Kansas City Women in Technology, that I was interested in speaking at tech conferences. She volunteered to be my mentor, set me up with resources for writing abstracts, and she sent me links to open CFPs for various conferences for me to begin submitting those abstracts. It felt like a whirlwind of events…I was writing abstracts the first week of December 2018, submitting those to conferences within the next week, and I got my first acceptance in January!</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>What I like about public speaking is that it puts me in a new place to help other people. I am thrilled that I’m providing content that people want to hear, and content that they can take something from to apply to their lives.</p>\n<p>I do believe it has benefited my career, and it has helped me to shine a light on the things I believe are great.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first conference was DevFest KC this past February in Kansas City. <strong>I was super nervous, and I told the audience this was my first time speaking at a conference. I’m used to trying to engage small groups of teenagers, not 20-40 adults.</strong> However, I needn’t have worried so much. My audience was engaged, they asked questions, and they were eager to participate. By the end of the talk, they didn’t believe that was my first time.</p>\n\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 56.25%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <iframe src=\"https://player.vimeo.com/video/312227563\" frameborder=\"0\" allow=\"autoplay; fullscreen\" allowfullscreen style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          \n<p><a href=\"https://vimeo.com/312227563\">Rhia Dixon at the KC Women in Technology 2019 Kickoff</a></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>At the time of this response, I have applied to 28 conferences. Thus far, I have been accepted to speak at 6 of the 16 conferences that have announced their speakers (1 of which I’ve already done).</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>My pre-talk routine consists of taking one last look at my slides, a few deep breaths, and listening to whatever song that currently has my ears hostage (typically something upbeat and relatively positive with great musicality).</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>I would pass on some of the best advice I’ve received:</p>\n<ul>\n<li>Pick a topic that you wouldn’t mind speaking about for hours and make it interesting for the version of you that would benefit from the talk.</li>\n<li>Write your abstract in such a way that the reader gets a pretty good understanding of why they should be at your talk and what they will get from attending.</li>\n<li>While you may not feel like the expert on this topic, the people listening to you came to hear YOU! Remember you’ve got friends in the audience — some you may know, and some you may not know…yet.</li>\n<li>Find people from varying backgrounds to read your abstracts — <strong>I have a speaker in tech, a speaker not in tech, and a non-speaker in tech review all of my abstracts to tell me what they think the point is, what they would expect to learn, and offer alternative titles.</strong> I’ve found this particularly helpful for tweaking my abstracts and tailoring my talks.</li>\n</ul>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>Oh, I have plenty! <a href=\"https://twitter.com/likeOMGitsFEDAY\">Jennifer Wadella</a> is one of my favorites — I know her, she’s relatable, she doesn’t take herself too seriously, and she has a ball on stage sharing what she knows. I’m also inspired by <a href=\"https://twitter.com/techgirl1908\">Angie Jones</a> and <a href=\"https://twitter.com/DrShirleyDavis\">Dr. Shirley Davis</a>. I aspire to these levels of awesomeness and badassery.</p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>I’m pretty active on <a href=\"https://twitter.com/TheFakeRiRi\">Twitter (@TheFakeRiRi)</a>, and I post <a href=\"https://www.rhiadixon.com\">my upcoming conferences on my website</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Rhia Dixon, Software Engineer and Breakout Speaker","path":"/blog/speakers-story-rhia-dixon/","category":"Speaker's Story","tags":null,"date":"2019/05/31","image":"https://drive.google.com/uc?id=17xfunskFSE9KSViA-7Gi9KCJIy0NSvZP"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Like many conference speakers, John got his start speaking at local meetups. Over time, he got more comfortable in\nfront of a crowd, and has now spoken at over 20 technology conferences on a variety of topics. Now it’s become\npart of the way he helps his company, Comcast, make an impact on the technology community.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p><a data-flickr-embed=\"true\" href=\"https://www.flickr.com/photos/linuxfoundation/44425350705/in/faves-17844497@N00/\" title=\"1E6A7337_Web\"><img src=\"https://live.staticflickr.com/1958/44425350705_260783ba05_z.jpg\" width=\"427\" height=\"640\" alt=\"1E6A7337_Web\" class=\"left\"></a><script async src=\"//embedr.flickr.com/assets/client-code.js\" charset=\"utf-8\"></script></p>\n<p>I’m John Riviello and I’ve been working as a frontend web developer for over 20 years. I currently work at Comcast where I am the lead web developer for xFi. My first public presentation was at a Sass meetup in Philadelphia in 2012 where I volunteered to talk about a new open source project I was working on. From there I spoke at a few “unconferences” &#x26; “unconference tracks” at other conferences (where basically as long as you show up and there’s an open speaking slot, it’s yours) before I was first accepted to speak at a conference.</p>\n<p><em>Photo Credit: <a href=\"https://www.flickr.com/photos/linuxfoundation/44425350705/in/faves-17844497@N00/\">The Linux Foundation, some rights reserved</a></em></p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>The thing I enjoy the most is sharing my experiences, both on stage and in the conversations with attendees afterwards. It has also allowed me to travel to some fun and interesting places.</p>\n<p>There are a couple areas where it has directly benefited my career. <strong>I was given the opportunity to <a href=\"http://www.lynda.com/CSS-tutorials/CSS-Sass-Converting-Existing-Site/434463-2.html\">create a course for Lynda.com</a> because I met Lynda.com staff author <a href=\"http://www.raybo.org/\">Ray Villalobos</a> after we both spoke at a conference.</strong> It turned out that we were both speaking at another conference a few months later, so he made a point to check out my talk at that conference. He enjoyed it so he recommended me as a course author. Prior to that I had not even considered authoring a course, and after he sold me on the idea, it because a reality that never would have been had I not met Ray. In addition, at my current role at Comcast I am expected to be having an impact outside of the company, and public speaking is the path I’ve been leaning on to accomplish that.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>The first conference I was accepted to speak at via a CFP was the University of Illinois Web Conference in 2015. When I talked to folks that attended afterwards, everyone had good things to say, but given it was my first talk I essentially took that as I did not too anything terribly wrong, which was a great first step.</p>\n<p>My favorite talk I’ve given so far is “The Critical Career Path Conversation” which I premiered at The Lead Developer NYC in 2018. You can <a href=\"https://www.youtube.com/watch?list=PLBzScQzZ83I8H8_0Qete6Bs5EcW3p0kZF&#x26;v=hMz6QDURQOM\">view it on YouTube</a>, including a fun glitch about one-third of the way through for you all to enjoy watching me struggle &#x26; recover from.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/hMz6QDURQOM' frameborder='0' allowfullscreen></iframe></div>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve applied to about 70 so far and spoken at 20.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>Yes, but I wouldn’t recommend it 😜.</p>\n<p>I usually spend the hour before looking and my slide notes one last time and inevitably tweak a few things here or there. My system is to write out what I’m planning to say for each slide in the slide notes but then I rarely ever follow it directly once I start talking. It’s just a comfort feeling knowing that if I totally forget what I was going to say, the script is there.</p>\n<p>The last thing I do, which I do recommend, is to <strong>make sure you start off smiling</strong> 😃.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>There is so much I could say here but I’ll limit it to a few quick hits:</p>\n<ol>\n<li>\n<p><strong>Imposter syndrome is real and a totally normal feeling</strong>, so do not let that hold you back. Especially early on, I always had a feeling of “everyone in the audience will already know what I’m talking about.” That is not the case. If they did, they would not be there. Those that show up want to hear YOU and learn from your experiences. If it turns out there are a few people that decide to leave during the talk for whatever reason, there is nothing wrong with that.</p>\n</li>\n<li>\n<p>During the intro of your talk, let the audience know how you intend to take questions (raise your hand during the talk, hold them until the end, chat in the hallway later, email, etc.). If someone asks a question that you don’t know the answer to, it is much better to say “That is a great question. I don’t know what the answer is so let me get back to you,” than to try to make up an answer on the spot.</p>\n</li>\n<li>\n<p>My CFP acceptance rate went up when I internalized <a href=\"https://twitter.com/getify/status/804018344412217344\">this piece of advice from Fluent organizer Kyle Simpson</a>:</p>\n</li>\n</ol>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/advice?src=hash&amp;ref_src=twsrc%5Etfw\">#advice</a> <a href=\"https://twitter.com/hashtag/designingATalk?src=hash&amp;ref_src=twsrc%5Etfw\">#designingATalk</a><br><br>OK talks are about the topic.<br><br>Good talks are about the speaker/presentation.<br><br>Great talks are about the audience.</p>&mdash; getify (@getify) <a href=\"https://twitter.com/getify/status/804018344412217344?ref_src=twsrc%5Etfw\">November 30, 2016</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>There are 2 in particular that I look up to:</p>\n<p><a href=\"https://meowni.ca/\">Monica Dinculescu</a> because when it comes to technical knowledge, she does an excellent job of taking a topic and distilling it down so that the audience can understand it and apply it immediately. She is able to do it while keeping her talk entertaining with healthy doses of humor and emojis.</p>\n<p><a href=\"http://www.agiledeveloper.com/\">Venkat Subramaniam</a> is a marathon speaker that I am amazed by. He is a superhuman when it comes to learning new content and teaching it. At the last conference I spoke at, Venkat delivered a full day workshop on the first day and then gave a talk at literally every possible speaking slot over the course of the next 3 days, which totaled 13 separate 90 minute talks. The thing that amazes me even more (especially given my typical pre-talk routine) is he has no slides. He starts off each talk with some bullet point topics in a text editor and the magic happens from there.</p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>I tweet infrequently at <a href=\"https://twitter.com/johnriv?lang=en\">@JohnRiv</a>. In the middle of July I’ll be at <a href=\"https://uberconf.com\">ÜberConf</a> in Denver running a full-day workshop on Web Components and giving a couple talks in the days that follow. As the name suggests, ÜberConf covers a ton of topics related to software development, and Venkat Subramaniam will be speaking there, so if you’re not already familiar with the conference, check it out!</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: John Riviello, Frontend Web Developer","path":"/blog/speakers-story-john-riviello/","category":"Speaker's Story","tags":null,"date":"2019/05/25","image":"https://drive.google.com/uc?id=1_tg_KavLUtRf2te9DB1qu8fy1ybINI_N"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Jaime and I shared the stage once at <a href=\"https://theleaddeveloper.com/\">The Lead Dev</a>, and since then I’ve gotten to know Jaime a bit more on Twitter and by following his podcast, <a href=\"https://mtjc.fireside.fm/\">More Than Just Code</a>. Jaime has spoken at a lot of conferences, but like many of us, he’s applied at an order of magnitude more. Read on to learn more about his process and some of his suggestions for new speakers.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/ozbikNQ.png\" class=\"left\">\n<p>I’m Jaime Lopez Jr and I’m a software developer by day and a podcaster by night.</p>\n<p>I got into public speaking because I wanted to reach a new audience where I could share my knowledge, experiences, and stories. I’ve co-hosted a podcast (<a href=\"https://mtjc.fireside.fm/\">More Than Just Code</a>) for the past 4-5 years, so public speaking was a natural extension of that experience.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I like being able to share things that I have learned because I hope that my experiences can be helpful to others who encounter the same struggles that I have encountered.</p>\n<p>Speaking at conferences has benefited my career by providing an opportunity to meet other people in the industry that I wouldn’t ordinarily get a chance to meet!</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I do remember my first conference talk. I co-presented a talk at 360iDev in Denver, Colorado with <a href=\"https://twitter.com/timmitra\">Tim Mitra</a> (my friend and a co-host of More Than Just Code).</p>\n<p>The talk went very well from what I recall. The topic was about the way that hosting a technical podcast can help developers in their careers, which plays to our strengths as experienced podcasters. Of course it also helped that we had a few die-hard fans in the audience!</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Looking at my Google Sheets spreadsheet where I track this, I’ve applied to about <strong>115 conferences in the past three years or so</strong>. I’ve been accepted by 14 conferences and have spoken at (or am scheduled to speak at) 9 of those conferences.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I like to find a quiet place to collect my thoughts about an hour prior to when I give my presentation. It certainly helps when there is a dedicated room for speakers to do this! Also, if possible I try to check out the room where I’ll be speaking so I can get a sense of the acoustics as well as how the audience will experience the presentation.</p>\n<p><strong>I generally try not to memorize my talks because it causes me to become robotic when speaking</strong>. Instead, I walk through the main points (generally a single word) that I want to mention related to my slides or code that I’m sharing.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>There is one main piece of advice that I can give new speakers:</p>\n<p><strong>It is usually difficult to get started as a conference speaker in terms of getting your CFP submissions accepted. This is totally okay and you don’t need to worry about it!</strong></p>\n<p>I subscribed to the (now-defunct) <a href=\"https://techspeak.email/\">Technically Speaking newsletter</a> that was put together by Chiu-Ki Chan and Cate Huston. The content in that newsletter (which is still available online) helped me craft my CFP submissions so that there is a better chance of being accepted. As well, the Technically Speaking newsletter helped me feel better about CFP acceptance rates (which if I recall they said was somewhere about 10%).</p>\n<p>If I’ve learned anything over the past few years of submitting to CFPs, <strong>it’s that it is better to submit to many conferences that you think would benefit from your talk than it is to be fixated on any particular conference</strong> (which puts all of your hopes and dreams on a single CFP).</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>There are two speakers that come to mind.</p>\n<p>First is <a href=\"https://twitter.com/savinola\">Laura Savino</a>. The way she gives technical presentations makes the audience feel as if they’re going along on a shared journey. Each step of the way seems like a friend is sharing their favorite locations in an unfamiliar city.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/vkb9z68nhyo' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Readable Code - Laura Savino - DDD Europe 2018</em></p>\n<p>Second is <a href=\"https://twitter.com/nmeans\">Nickolas Means</a>. I’ve been impressed with the way that he can smoothly deliver stories that involve a lot of technical detail. The way he presents the topics at hand leaves the audience on the edge of their seat.</p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>I have a website: <a href=\"http://www.devwiththehair.com/\">http://www.devwiththehair.com/</a></p>\n<p>I co-host <a href=\"https://mtjc.fireside.fm/\">the More Than Just Code podcast</a></p>\n<p>I’m on Twitter: <a href=\"https://twitter.com/DevWithTheHair\">@DevWithTheHair</a></p>\n<p>My upcoming and previous conference talks <a href=\"https://github.com/DevWithTheHair/Conference-Talks\">can be found on GitHub</a></p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Jaime Lopez, the Dev With the Hair","path":"/blog/speakers-story-jaime-lopez-jr/","category":"Speaker's Story","tags":null,"date":"2019/05/17","image":"https://drive.google.com/uc?id=1E953n9DzKH8Iwj9fMtRAhLpRy8O9F9S2"}}}],"pathPrefix":"blog","first":false,"last":false,"index":3,"pageCount":5,"additionalContext":{}}}