{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"8cb4d4c4-14e3-561a-bc1d-db323d396aec","html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Like many conference speakers, John got his start speaking at local meetups. Over time, he got more comfortable in\nfront of a crowd, and has now spoken at over 20 technology conferences on a variety of topics. Now it’s become\npart of the way he helps his company, Comcast, make an impact on the technology community.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p><a data-flickr-embed=\"true\" href=\"https://www.flickr.com/photos/linuxfoundation/44425350705/in/faves-17844497@N00/\" title=\"1E6A7337_Web\"><img src=\"https://live.staticflickr.com/1958/44425350705_260783ba05_z.jpg\" width=\"427\" height=\"640\" alt=\"1E6A7337_Web\" class=\"left\"></a><script async src=\"//embedr.flickr.com/assets/client-code.js\" charset=\"utf-8\"></script></p>\n<p>I’m John Riviello and I’ve been working as a frontend web developer for over 20 years. I currently work at Comcast where I am the lead web developer for xFi. My first public presentation was at a Sass meetup in Philadelphia in 2012 where I volunteered to talk about a new open source project I was working on. From there I spoke at a few “unconferences” &#x26; “unconference tracks” at other conferences (where basically as long as you show up and there’s an open speaking slot, it’s yours) before I was first accepted to speak at a conference.</p>\n<p><em>Photo Credit: <a href=\"https://www.flickr.com/photos/linuxfoundation/44425350705/in/faves-17844497@N00/\">The Linux Foundation, some rights reserved</a></em></p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>The thing I enjoy the most is sharing my experiences, both on stage and in the conversations with attendees afterwards. It has also allowed me to travel to some fun and interesting places.</p>\n<p>There are a couple areas where it has directly benefited my career. <strong>I was given the opportunity to <a href=\"http://www.lynda.com/CSS-tutorials/CSS-Sass-Converting-Existing-Site/434463-2.html\">create a course for Lynda.com</a> because I met Lynda.com staff author <a href=\"http://www.raybo.org/\">Ray Villalobos</a> after we both spoke at a conference.</strong> It turned out that we were both speaking at another conference a few months later, so he made a point to check out my talk at that conference. He enjoyed it so he recommended me as a course author. Prior to that I had not even considered authoring a course, and after he sold me on the idea, it because a reality that never would have been had I not met Ray. In addition, at my current role at Comcast I am expected to be having an impact outside of the company, and public speaking is the path I’ve been leaning on to accomplish that.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>The first conference I was accepted to speak at via a CFP was the University of Illinois Web Conference in 2015. When I talked to folks that attended afterwards, everyone had good things to say, but given it was my first talk I essentially took that as I did not too anything terribly wrong, which was a great first step.</p>\n<p>My favorite talk I’ve given so far is “The Critical Career Path Conversation” which I premiered at The Lead Developer NYC in 2018. You can <a href=\"https://www.youtube.com/watch?list=PLBzScQzZ83I8H8_0Qete6Bs5EcW3p0kZF&#x26;v=hMz6QDURQOM\">view it on YouTube</a>, including a fun glitch about one-third of the way through for you all to enjoy watching me struggle &#x26; recover from.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/hMz6QDURQOM' frameborder='0' allowfullscreen></iframe></div>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve applied to about 70 so far and spoken at 20.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>Yes, but I wouldn’t recommend it 😜.</p>\n<p>I usually spend the hour before looking and my slide notes one last time and inevitably tweak a few things here or there. My system is to write out what I’m planning to say for each slide in the slide notes but then I rarely ever follow it directly once I start talking. It’s just a comfort feeling knowing that if I totally forget what I was going to say, the script is there.</p>\n<p>The last thing I do, which I do recommend, is to <strong>make sure you start off smiling</strong> 😃.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>There is so much I could say here but I’ll limit it to a few quick hits:</p>\n<ol>\n<li>\n<p><strong>Imposter syndrome is real and a totally normal feeling</strong>, so do not let that hold you back. Especially early on, I always had a feeling of “everyone in the audience will already know what I’m talking about.” That is not the case. If they did, they would not be there. Those that show up want to hear YOU and learn from your experiences. If it turns out there are a few people that decide to leave during the talk for whatever reason, there is nothing wrong with that.</p>\n</li>\n<li>\n<p>During the intro of your talk, let the audience know how you intend to take questions (raise your hand during the talk, hold them until the end, chat in the hallway later, email, etc.). If someone asks a question that you don’t know the answer to, it is much better to say “That is a great question. I don’t know what the answer is so let me get back to you,” than to try to make up an answer on the spot.</p>\n</li>\n<li>\n<p>My CFP acceptance rate went up when I internalized <a href=\"https://twitter.com/getify/status/804018344412217344\">this piece of advice from Fluent organizer Kyle Simpson</a>:</p>\n</li>\n</ol>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/advice?src=hash&amp;ref_src=twsrc%5Etfw\">#advice</a> <a href=\"https://twitter.com/hashtag/designingATalk?src=hash&amp;ref_src=twsrc%5Etfw\">#designingATalk</a><br><br>OK talks are about the topic.<br><br>Good talks are about the speaker/presentation.<br><br>Great talks are about the audience.</p>&mdash; getify (@getify) <a href=\"https://twitter.com/getify/status/804018344412217344?ref_src=twsrc%5Etfw\">November 30, 2016</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>There are 2 in particular that I look up to:</p>\n<p><a href=\"https://meowni.ca/\">Monica Dinculescu</a> because when it comes to technical knowledge, she does an excellent job of taking a topic and distilling it down so that the audience can understand it and apply it immediately. She is able to do it while keeping her talk entertaining with healthy doses of humor and emojis.</p>\n<p><a href=\"http://www.agiledeveloper.com/\">Venkat Subramaniam</a> is a marathon speaker that I am amazed by. He is a superhuman when it comes to learning new content and teaching it. At the last conference I spoke at, Venkat delivered a full day workshop on the first day and then gave a talk at literally every possible speaking slot over the course of the next 3 days, which totaled 13 separate 90 minute talks. The thing that amazes me even more (especially given my typical pre-talk routine) is he has no slides. He starts off each talk with some bullet point topics in a text editor and the magic happens from there.</p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>I tweet infrequently at <a href=\"https://twitter.com/johnriv?lang=en\">@JohnRiv</a>. In the middle of July I’ll be at <a href=\"https://uberconf.com\">ÜberConf</a> in Denver running a full-day workshop on Web Components and giving a couple talks in the days that follow. As the name suggests, ÜberConf covers a ton of topics related to software development, and Venkat Subramaniam will be speaking there, so if you’re not already familiar with the conference, check it out!</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: John Riviello, Frontend Web Developer","path":"/blog/speakers-story-john-riviello/","category":"Speaker's Story","tags":null,"date":"2019/05/25","image":"https://i.imgur.com/6V1TS6n.jpg"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}