{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"f30b1a83-19a9-58b6-981a-84da9eee329d","html":"<p>Leading up to <a href=\"https://gotochgo.com/2020/\">GOTO Chicago</a>, I decided to reach out to some of the speakers who I\nwas most excited to see this year. I’m really glad Danielle Pollard - a fellow Chicagoan - got back to me to share\nher story.</p>\n<p>In addition to her professional work as an Agile Lead, Danielle has a passion for lifting up those in the community\nwho most need help. While she’s relatively new at speaking at conferences, Danielle has been winning speaking competitions\nsince grade school, so read on to hear some of her candid and helpful advice.</p>\n<!--more-->\n<h3>Tell me about yourself.</h3>\n<img src=\"https://drive.google.com/uc?id=1fPEc4sWvfbW3_Gu2gkuu5nhfr9ki_4l0\" class=\"right\">\n<p>I’m currently an Agile Coach for Spot Hero in Chicago. SpotHero is a digital parking reservation service that connects drivers looking to reserve and pay for parking spaces with parking lots, parking garages and valet services.</p>\n<p>I believe that trust is hands down the #1 force multiplier for high performance, and I’ve used that belief to create results as a project management consultant and Lean/Agile transformation coach for best in class companies like UPS, Kohler, Blue Cross Blue Shield, Yellow-Roadway, RR Donnelley, Allstate, Apartments.com, US Foods.</p>\n<p>I’m also working closely with <a href=\"http://fchnwecare.com/\">FCHN</a>, a Soup Kitchen on the south side of Chicago focused on feeding, clothing and helping the needy. FCHN has been serving the community with hot meals 6 days a week for over 32 years. They are struggling to keep the lights on and I’m determined to turn things around for them.</p>\n<p>I’ve been able to impact the lives of hundreds of inner city youth and aspiring women entrepreneurs through nonprofits I work with, and in my non-existent “spare time” you can find me reading, eating some juicy carnivorous meal (scotch included) or being a personal barber for my two boys.</p>\n<h3>How did you get into public speaking?</h3>\n<p>In 4th grade my teacher was fed-up with my antics and inability to remain quiet and stay in my seat during class so she encouraged me to participate in the upcoming Speech Contest. I did. I won. And won and won and won until I became the 2nd Place winner in the Chicago-Wide Oratory competition.</p>\n<p>Never looked back.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I love speaking at conferences because I get a chance to meet some pretty awesome like-minded professionals, learn from them and share my ideas. Mostly for the love of helping and inspiring others and that has definitely enhanced my work as an Agile Coach without a doubt!</p>\n<h3>What makes Agile team leadership such an interesting topic to you?</h3>\n<p>It’s exciting for me because I love building resilient and learning teams that are able to handle anything that comes their way with top notch skill, professionalism and an unwavering focus on delivering value to both the business and the customer. Change is the only constant and I help teams and companies embrace and leverage it as a competitive advantage.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>It was for the Agile Professional Learning Network’s annual conference. It went a whole lot better than I thought. I didn’t know what to expect but I showed up and did my best and people seemed to like that.</p>\n<p>What I remember most is that my mom came and sat right in the front. She was supposed to record it for me but ended up getting so caught up in the presentation she completely forgot.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>My pre-talk routine includes prayer and for some reason I always get one more brilliant idea that I try to add in at the last minute…I don’t know what that’s about.</p>\n<p><strong>I also use lots of positive self-talk because I get extremely nervous.</strong> I remind myself to focus on the message and not me.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>The best advice I can give is just sharing four things that I always try to remember for myself:</p>\n<ol>\n<li>A seasoned speaker once told me, “the audience is actually rooting for you, because they’re thinking about if it were them and how unnerved they would be. They want you to do well.”</li>\n<li>If you didn’t belong here, you wouldn’t be here. So relax.</li>\n<li>Proper Preparation Prevents Piss Poor Performance…being prepared and practiced helps eliminate fear and build confidence.</li>\n<li>Be yourself. Authenticity goes a long way.</li>\n</ol>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>Locally, I love to hear <a href=\"https://twitter.com/zacharylbeer\">Zachary Beer</a> speak. He is smart, funny, and authentic as f*ck!</p>\n<p>Learn more about <a href=\"https://gotochgo.com/2020/speakers/1281/danielle-pollard\">Danielle’s talk at GOTO Chicago 2020 and how you can contact her here</a>.</p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Danielle Pollard, Agile Coach and Community Supporter","path":"/blog/speaker-danielle-pollard/","category":"Speaker's Story","tags":null,"date":"2020/03/02","image":"https://drive.google.com/uc?id=1fPEc4sWvfbW3_Gu2gkuu5nhfr9ki_4l0"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}