{"pageContext":{"isCreatedByStatefulCreatePages":false,"group":[{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Like many people who get into public speaking, Chris Holland has a strong drive to help other engineers perform at their best. When I first met Chris, he was speaking on application security at a regional PHP conference. One thing that comes across here (and if you meet Chris in person) is his passion for helping other engineers learn about topics that can be challenging to tackle.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p>I was raised in Paris, France then moved to Los Angeles in the 90s where I studied some computer science and quickly got into web applications development.</p>\n<p>My early career was focused on front-end development before we had standards such as CSS and the DOM - before AJAX was a thing. Fun trivia, back when Gmail first came out and people were impressed with its “autocompletion” on email addressees, I won a contest to deliver <a href=\"http://wick.sourceforge.net/\">the first open-source framework to do this</a>. Nobody cared, but it was fun.</p>\n<p>Pretty quickly however, I got more into server-side software engineering with Java/J2EE, then PHP and C#/.Net, where I developed a better understanding of Object-Oriented Design, Database Design and Information Security.</p>\n<p>I’ve been managing engineering organizations of various sizes since 2007, and to this day, remain close to the code, seeking out every opportunity to coach software engineers toward successful careers.</p>\n<p>Having learned many lessons “the hard way” over the past 20 years, in 2017 I started developing a growing portfolio of talks shining light on various aspects of Software Crafting and InfoSec. Having spoken at various local meetups, I got into my first “full software conference” as a speaker at the 2017 inaugural Coder <a href=\"https://www.codercruise.com\">Cruise Conference</a> by the fine folks at One for All Events. In 2017 I also spoke at a couple of InfoSec conferences by invitation from contacts developed from speaking at local OWASP meetups. All in all, 2017 ignited my speaking career.</p>\n<img src=\"https://i.imgur.com/eEzegV6.jpg\" class=\"center\">\n<h3>What do you like about speaking at conferences?</h3>\n<p>Speaking at conferences has been a powerful cathartic outlet for overcoming my ever-growing frustration of seeing software engineers making the same mistakes I did earlier-on in my career.</p>\n<p>Far beyond this however, speaking with attendees and listening to their stories, experiences, frustrations and successes, has also been very rewarding and has often given me ideas for new talks, while helping me refine existing talks. Sharing meals and drinks with attendees is a lot of fun. I do tend to be shy though, so I find it easier to engage with people in more intimate settings. <strong>I make a point of sitting at tables of people I don’t know and listening to their conversations while slowly coming out of my shell.</strong></p>\n<p>I also love meeting and learning from other sharp speakers at conferences. It’s helped me correct misconceptions, learn new things, and think about various problems differently.</p>\n<p><strong>Getting to travel the World has been an unbelievable experience. The people, the sights, the food. Just amazing.</strong></p>\n<p>Finally, I absolutely love meeting authors and contributors to open-source projects, with plenty of time to chat with them at speaker dinners and thank them profusely, in person, for their work. I’m also starting to contribute to some projects on Patreon.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first Software Engineering talk lacked structure. I jumped into concepts without sufficiently linking them with a common thread, both with slides and verbally. The audience was very supportive though and in general agreed with my concepts. Questions were thoughtful, and I did get a good amount of spontaneous positive feedback after it, with solid break-out discussions.</p>\n<p>My first InfoSec talk could date as far back as 2015 at a local OWASP Meetup. The graphics in my slides were just too “thin” with insufficient contrast and text that was too small. My delivery wasn’t on-point either. <strong>Despite all that, several people came-up afterward to continue the discussion.</strong></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>In 2018, I started getting accepted to a good number of conferences and spoke at seven of them. In 2019 so-far I’m looking at seven conferences between March and June. I’d be happy to score a couple more for the fall/winter season, but I do have limited availability because speaking at conferences isn’t part of my job description.</p>\n<p>For each conference at which I speak, I take personal time off from work. I also save-up money to bring my Wife to <em>a couple</em> of conferences per year. We strategize about the destinations she’d hope for the most, and when her parents are available to take care of our 2 daughters for a few days.</p>\n<p><strong>I do apply to “several dozen” conferences each year. It’s … overwhelming at times.</strong></p>\n<h3>Do you have a pre-talk routine?</h3>\n<ul>\n<li>Go over my slides, rehearse mental timing milestones at various sections of it. In some cases make some last-minute tweaks if I find an opportunity to more closely align an area of the presentation with the conference’s audience. Or something relevant that just happened in the news.</li>\n<li>Try to scope out the room and check for connectivity, HDMI, Power.</li>\n<li>Make sure my laser pointer works.</li>\n<li>Figure out where I can stash a bottle of water near the podium for mid-talk swig.</li>\n<li>Scope out well ahead of my talk, where the Audio/Video engineers are in case I need their help.</li>\n<li>See whether the previous speaker in my room had any issue with the equipment.</li>\n<li>Get laptop, remote and everything set-up at least 10 minutes before my talk, I like to start setting-up 15-20 minutes ahead of time when I can, and be fully-ready at the 10-minute mark. Yea … I’m also the person who shows-up at the airport at least 2 hours before any flight even with CLEAR and Pre-check.</li>\n</ul>\n<h3>What advice do you have for new speakers?</h3>\n<p><strong>Conferences are literally yearning for new voices. Attendees are growing tired of seeing the same people at conferences year after year.</strong> An increasing number of conferences are focusing their attention on attracting new speakers with no speaking experience with a great emphasis on diversity for underrepresented demographics.</p>\n<p>Check out <a href=\"http://selfconference.org\">SelfConference.org</a> — Speaking at a conference doesn’t have to be about having mastered technology X or methodology Y. It can be about your journey, your struggles, your learning process. Conference attendees love seeing a person to whom they can relate, sharing their struggles and hearing their story.</p>\n<p>Additionally, some of the most compelling talks and keynotes I’ve watched had nothing to do with technology. They were about human topics:</p>\n<ul>\n<li>If you’re struggling with mental health, become a spokesperson for <a href=\"https://osmihelp.org/\">OSMIHelp.org</a>, and educate us.</li>\n<li>If you’re struggling with discrimination, educate us.</li>\n<li>If you’re struggling with accessibility, educate us.</li>\n<li>If you care about something, educate us.</li>\n</ul>\n<p><strong>Turn the World into allies for the causes you care about.</strong></p>\n<p>Back to technology though, if you fear “imposter syndrome”, just know that you have valuable experience to share. I use this syndrome as motivation to more thoroughly research topics I speak on, and to seek out prevailing counter arguments to the points I’m about to make.</p>\n<p>With all this said, the most defensible position lies within what has worked for you, from the confines of realities which you had to face.</p>\n<p>Finally, keep in mind that conference organizers and their speaker selection panels know what they’re doing. <strong>If they’ve picked you, it’s important for you to realize that they’ve done their due-diligence, and that you absolutely, positively, unequivocally belong on that stage.</strong></p>\n<p>So what’s the downside to submitting? What’s the worst that can happen? You might unleash your awesomeness unto the World?</p>\n<p>Bring it.</p>\n<h3>Are there any other speakers you look up to?</h3>\n<p>Yes.</p>\n<ul>\n<li><a href=\"https://www.sandimetz.com\">Sandi Metz</a></li>\n<li><a href=\"https://twitter.com/anjanavakil\">Anjana Vakil</a></li>\n<li><a href=\"https://twitter.com/ieatkillerbees\">Samantha Quiñones</a></li>\n<li><a href=\"https://twitter.com/CalEvans\">Cal Evans</a></li>\n<li><a href=\"https://twitter.com/jonskeet\">Jon Skeet</a></li>\n<li><a href=\"https://twitter.com/likeOMGitsFEDAY\">Jennifer Wadella</a></li>\n<li><a href=\"http://jenna.io\">Jenna Quindica</a></li>\n<li><a href=\"https://twitter.com/xiehan\">Nara Kasbergen</a></li>\n<li><a href=\"http://docondev.com\">Doc Norton</a></li>\n<li><a href=\"https://twitter.com/eryno\">Eryn O’Neil</a></li>\n<li><a href=\"https://twitter.com/philsturgeon\">Phil Sturgeon</a></li>\n<li><a href=\"https://twitter.com/HMSEvans\">Stephanie Evans</a></li>\n<li><a href=\"https://twitter.com/matthewtrask\">Matthew Trask</a></li>\n<li><a href=\"https://twitter.com/JessicaMauerhan\">Jessica Mauerhan</a></li>\n<li><a href=\"https://twitter.com/saramg\">Sara Golemon</a></li>\n<li><a href=\"https://fsharpforfunandprofit.com\">Scott Wlaschin</a></li>\n<li><a href=\"https://twitter.com/IanColdwater\">Ian Coldwater</a></li>\n<li><a href=\"https://www.jbrains.ca\">J.B. Rainsberger</a></li>\n</ul>\n<p>These folks have all delivered amazing talks and keynotes which have impacted how I think about human, management, infosec and software engineering topics.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/VzWLGMtXflg' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Sandi Metz at RubyConf 2017</em></p>\n<h3>Where can readers find more about you?</h3>\n<ul>\n<li><a href=\"http://twitter.com/chrisholland\">Chris on Twitter</a></li>\n<li><a href=\"https://github.com/elchris/speaking\">Talks on Github</a></li>\n<li><a href=\"https://speakerdex.co/chrisholland\">Chris on Speakerdex</a></li>\n</ul>\n<hr>\n<p>If you’re a tech conference speaker, email karl@cfpland.com to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Chris Holland, Engineering Director Driven to Empower Others","path":"/blog/speakers-story-chris-holland/","category":"Speaker's Story","tags":null,"date":"2019/04/07","image":"https://drive.google.com/uc?id=1wviuIeLHd0nObuRL2MQvocWKYBE8CVTv"}}},{"post":{"html":"<p>This week, I released three new features to newsletter subscribers that should improve your experience with CFP Land: Category Preferences, 🔔 New tags, and Perks.</p>\n<!--more-->\n<h2>Category Preferences</h2>\n<p>The most requested feature so far has been the ability for subscribers to choose a preferred category. Each week, the CFP Land newsletter contains more than 30 conferences, so it’s really annoying to sift through all of them looking for the few you really care about. For that reason, each email you get now includes a link to “Update Your Preferences”:</p>\n<p><img src=\"https://i.imgur.com/sp9mq2c.png\" alt=\"Update your preferences in the weekly email\"></p>\n<p>This will take you to form where you can specify the category of conferences you prefer:</p>\n<p><img src=\"https://i.imgur.com/iibk8D7.png\" alt=\"Category preference form\"></p>\n<p>Each week, any CFPs matching your preferred category should show up at the top of your email:</p>\n<p><img src=\"https://i.imgur.com/3utX9jM.png\" alt=\"Preferred CFPs\"></p>\n<p>Location preferences aren’t quite ready yet, but they will be coming soon!</p>\n<h2>“New” Tags</h2>\n<p>Another way to pick out new CFPs from the weekly email is to focus on any that are new. The list is sorted by CFP end date, so usually new ones will be at the bottom, but occasionally I’ll add a conference CFP just before it closes. In this case, it will show up marked with the ”🔔 New” tag. This means the conference has been added since the last email was sent 7 days ago:</p>\n<p><img src=\"https://i.imgur.com/sp9mq2c.png\" alt=\"New tag indicates a conference has been added in the past 7 days\"></p>\n<h2>Perks for Speakers</h2>\n<p>Finally, I’m spending extra time each week looking for the “Perks” that each conference offers to speakers (hopefully I’ll be able to automate this eventually). This was another highly requested feature, and it definitely helps if you’re trying to prioritize conferences that will cover travel or hotel costs for you.</p>\n<p>Right now the perks I look for are:</p>\n<ul>\n<li><strong>Travel</strong> meaning that the conference will pay for your travel to and from the event.</li>\n<li><strong>Hotel</strong> indicates that the conference offers reimbursement for hotel costs.</li>\n<li><strong>Stipend</strong> is an offer for payment or extra cash to cover miscellaneous expenses while speaking. Not many conferences offer this, so it’s nice when they do!</li>\n</ul>\n<p>Because my resources are limited, I only include these perks when they are <strong>clearly listed</strong> on the conference’s website page for speakers. If I miss something, you can always email me to let me know. Also, I decided not to include whether a free ticket for the event was included because <em>almost</em> every conference includes this by default.</p>\n<p><img src=\"https://i.imgur.com/P03MMW4.png\" alt=\"Perks like travel, hotel, and stipend are included in each email\"></p>\n<p>That’s it for this month’s new features. All new subscribers are asked to fill out a feedback form, so if you’d like to see improvements, keep an eye out for that email after you subscribe or contact me (<a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a>) to start a conversation.</p>","frontmatter":{"layout":"post","title":"New Features: Category Preferences, \"New\" Tags, and Perks","path":"/blog/category-preferences-perks/","category":"Updates","tags":["Email","Website"],"date":"2019/04/05","image":null}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Laura is currently the <a href=\"https://www.modernteacher.com/\">Chief Product Officer at Modern\nTeacher</a>, an edtech startup based in Chicago,\nIL. She was recently featured as a <a href=\"https://www.asianentrepreneur.org/women-on-top-in-tech-laura-janusek-vice-president-of-product-and-founding-team-member-of-modern-teacher/\">“Woman on Top in\nTech”</a> by Asian Entrepreneur magazine, and has been involved in public speaking for\nmany years. In this interview, we cover how she got into speaking at tech\nconferences, her advice for new speakers, and some of the ways speaking has\nbenefited her professionally.</p>\n<!--more-->\n<img src=\"https://cdn-images-1.medium.com/max/1200/1*0KSCAln6MEJrW0a3URY6ow.jpeg\" class=\"left\">\n<h3>How did you get into public speaking?</h3>\n<p>I’ve become a more active speaker at technical conferences just in the last\nyear. Over the past several years, I would speak here and there, generally after\nbeing invited by someone involved with the event. But last year I was looking\ninto conferences I might want to attend for women in tech, and I saw a CFP on\nthe website for one of them. I thought, “Oh, maybe instead of just attending\nthese conferences, I could speak at them,” and I was right!</p>\n<p>I wish I had realized sooner that <strong>you don’t always have to be personally\ninvited to speak at events.</strong> Now that I’m aware of the CFP process, I’m\nspeaking regularly at conferences across the country.</p>\n<h3>What do you like about speaking at conferences? Has it benefited your career?</h3>\n<p>I think conferences can be such a fun way to meet people, whether you’re\nspeaking or not. But I have to admit, being a speaker has its perks. There are\ndinners, networking events, sometimes lounges specifically for the speakers,\nwhich build an immediate sense of community. I’ve been blown away by some of the\nother speakers I’ve met in these settings.</p>\n<p>Speaking also establishes your authority in your subject area, and it gives you\nthe chance to genuinely help people learn something new. This teaching aspect is\nespecially important to me, given my background in the education space.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>Being in EdTech, I’ve always spoken at events for teachers, which was a natural\nprogression from being in the classroom and participating in or leading\nprofessional development sessions. But my first speaking engagement that was for\nmore of a technical and business-oriented audience was on a panel of EdTech\nentrepreneurs at <a href=\"https://1871.com/\">Chicago’s tech incubator and hub, 1871</a>.\nOne of the organizers had seen me giving a product demo and asked for me to join\nthe event, perhaps to help them avoid the dreaded all-male panel (or “manel”).</p>\n<p>And again, this experience corrected some misconceptions I had about public\nspeaking. I used to think all panelists must be exceptional at coming up with\noff-the-cuff responses to tricky questions on the spot, and maybe some of them\nare, but that’s definitely not the norm.</p>\n<p>In my experience at the 1871’s event, the panelists were all given the questions\nahead of time so we could prepare, and I was asked if I’d be comfortable kicking\nthe panel off by responding to the first question. I didn’t need to worry about\ncoming up with responses in the moment, because I was prepped ahead of time,\nwhich made the experience a lot less intimidating. And the format of a panel —\nbeing seated, one in a row of several speakers — creates a more casual vibe as\nwell. <strong>I’d definitely recommend panels as a gateway experience for anyone who\nis considering branching out into public speaking.</strong></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve spoken at about 10 conferences to date, and I currently have 4 more\nscheduled in the coming months. I don’t keep count on how many I’ve applied to,\nbut it’s been a lot! <strong>I definitely don’t get accepted to every event — I don’t\nthink anyone does.</strong> But I’ve very much enjoyed the conferences I’ve been a part\nof, and I’m looking forward to the ones ahead.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I try to access the room some time before my session to make sure the AV setup\nis good to go, but apart from that, I’m usually attending someone else’s session\nright up until it’s time for mine to start!</p>\n<p>I know not everyone’s schedules allow them to spend the full day at the event,\nbut <strong>I think it’s a shame when speakers come in just for their session and then\nleave.</strong> I make it a point to support and learn from the other speakers when I’m\nat a conference, so my session is usually one of many that I participate in\nthroughout the day.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>My biggest piece of advice is to just go for it!</p>\n<p>I’m involved in a lot of online communities, and I’ll see people posting in\nSlack, asking if they should respond to a CFP they’re interested in. My response\nis always yes. Why not? <strong>It doesn’t take much to respond to a CFP. You don’t\nhave to have a whole session ready to go. You just need an idea and an\nabstract.</strong></p>\n<p>Think of something you’ve been successful at professionally, and then think of\nwhat advice you’d give to others on that topic. Can you come up with 5–10 tips\nto make your audience better at X? A coding language, a new tool, even a soft\nskill? Then you’ve got enough to respond to a CFP.</p>\n<p>There are a lot of resources on writing strong CFP submissions, so I’d recommend\ndoing a little research in that area, but <strong>don’t be intimidated, especially if\nyou’re a member of an underrepresented group. Conferences need more\nrepresentation of diversity and inclusion.</strong> Go for it!</p>\n<h3>Are there any other speakers who have inspired you?</h3>\n<p>One that comes to mind is Jennifer Wesley at Google, who gave the opening\nremarks at the Women Techmakers Summit in Chicago for International Women’s Day\nrecently. She stands out to me because she was able to get personal on stage,\nand in doing so, she established that the summit was a safe space for women.\n<strong>By being willing to be a little vulnerable with her personal story, she set\nthe tone for the whole day.</strong></p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/95g2cd8pwe8' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Jennifer Wesley at TEDxParker speaking about women in STEM</em></p>\n<h3>Where can readers find more about you?</h3>\n<p>I always post about my upcoming sessions on\n<a href=\"https://twitter.com/LBJanusek\">Twitter</a> and\n<a href=\"https://www.linkedin.com/in/lbjanusek/\">LinkedIn</a>, and I share speaker\ndiscounts there when I can, so follow or connect with me if you’re interested.</p>\n<hr>\n<p>If you’re a tech conference speaker, email karl@cfpland.com to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Laura Janusek, Chief Product Officer in Educational Technology","path":"/blog/speakers-story-laura-janusek/","category":"Speaker's Story","tags":null,"date":"2019/03/31","image":"https://cdn-images-1.medium.com/max/1200/1*0KSCAln6MEJrW0a3URY6ow.jpeg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>This week, I’m thrilled to bring you the story of <a href=\"https://geshan.com.np/\">Geshan\nManandhar</a>, a native of Nepal who now lives in\nAustralia. One of the things I love about speaking at conferences is the\nopportunity to meet people from all over the world, so reading Geshan’s\nexperience as a speaker on multiple continents was inspiring.</p>\n<!--more-->\n<img src=\"https://cdn-images-1.medium.com/max/1200/1*mQ216JZETiJBtVpHdGLBkA.jpeg\" class=\"left\">\n<h3>Tell me about yourself? How did you get into public speaking?</h3>\n<p>I have been a software engineer for more than a decade now. I have worked as a\nsoftware engineer in 3 countries in the past 10 years. I am primarily a backend\nsoftware engineer who dabbles in the frontend side of things once in a while.</p>\n<p>I used to do public speaking even in 2010 but I restarted doing it in 2014 when\nI spoke at a meetup in Kathmandu, Nepal. Then I started sending out abstract to\nCFPs in 2015, and in 2016 I spoke at my first conference: Code Motion Dubai.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I like meeting like-minded people with the profession in common. All of us are\nsolution providers at the end of the day at times with code and sometimes\nwithout code too. I like the positive energy conferences have and regardless of\nwhere you work or the number of years of experience one has all of the\nparticipants are there to learn and share the experience. I admire the time,\neffort and resources put in by speakers for their talk.</p>\n<p>Public speaking, to be honest, has benefited my career both directly and\nindirectly. It has surely given me recognition and many people have approached\nme after doing some public speaking for various reasons. To be honest, adding a\nsection in your CV where you have spoken in a couple of good conferences does\nadd more value.</p>\n<h3>Do you remember your first conference talk?</h3>\n<p>My first big conference talk was in August, 2016 in Amsterdam for Laracon EU.\nProbably that was the biggest audience I had spoken in front of and included all\nthe who’s who of that community. It was a talk on ChatOps and I think for that\ncommunity of people it was a relatively new thing then.</p>\n<p><span class=\"figcaption_hack\">Geshan’s first big conference talk at Laracon EU, 2016</span></p>\n<p>I think it went pretty well, I was shaky and nervous when I started of course\nand then after the first 10 minutes I think I was in the flow and telling most\nof the things I had to talk about.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>To be honest, I have lost count on how many CFPs I have submitted my abstracts,\nfrom 2015 it surely should be in the 100s. I generally submit to conferences\nthat cover both travel and accommodations or at least travel. Like an e-commerce\nwebsite, I believe (at least for me) the conversion (success) rate is like 1% or\nless :). In total from 2016 to now I have spoken at 4 conferences in 4\ncontinents, not sure if it qualifies me to be called an international speaker\nfrom Nepal though :).</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I narrate the talk to myself the night before. Then right before the talk, I\nmake sure I have things I need with me like water, screen connections, and that\nthe screen size is fine. After I get on stage, I focus on delivering the message\nwith the right impact.</p>\n<p>I try to keep preparation pretty simple: don’t over-prepare, keep things\nspontaneous, but have some direction and keep an eye on the time.</p>\n<p>I usually don’t have speaker notes so I look at the slides and then improvise on\nthem. That’s why even if I do the same talk a second time, the details I include\neach time will be different.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>For new speakers, there are two main pieces of advice:</p>\n<p><strong>First, give your talk on local meetups.</strong> Local user group meetups are always\nlooking for speakers so if you approach them you will rarely hear a no you can’t\npresent. Depending on your city, the frequency of meetups in your area of tech\nmight be many, little, or none. When you practice your talk in a smaller group\nyou get feedback and also get over imposter syndrome.</p>\n<p>Speaking is not a thing for everyone, so try it in a smaller group. If you like\nit do it more, but bare in mind public speaking is a very important skill for\nyour career.</p>\n<p><strong>The second one is to work on your title and abstract.</strong> When conferences have\nCFPs the main thing in my opinion that stands out is your title and abstract.\nThe relevance of the talk in that conference is vital too, for instance, a Ruby\nconference will never accept a PHP 7 features talk. As some conferences have\nblind speaker selection, always work an extra bit on your title and abstracts.</p>\n<p>Then, it’s all about submitting your talk to all the CFPs you can find. The best\nway to find CFPs is <a href=\"https://www.cfpland.com/\">CFP Land</a>,\n<a href=\"https://www.papercall.io/\">papercall.io</a>, <a href=\"https://confs.tech/\">confs.tech</a>,\nlanyrd.com (it’s usually down though),\n<a href=\"https://callingallpapers.com/\">callingallpapers.com</a>. I wrote some <a href=\"https://geshan.com.np/blog/2016/09/some-useful-resources-for-conference-speakers-and-wanna-be-speakers/\">more advice\nfor finding speaking opportunities on my blog\ntoo</a>.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>One tech speaker who is great to listen to is <a href=\"https://twitter.com/kelseyhightower\">Kelsey\nHightower</a> from Google. His talks are\nspontaneous, fun, and filled with information.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/_1-5YFfJCqM' frameborder='0' allowfullscreen></iframe></div>\n<p>Someone that I witnessed in-person who is very good on stage is <a href=\"https://twitter.com/adamwathan\">Adam\nWathan</a>. He was able to explain a complex topic\nin a very easy way and had the courage to do live coding on a stage with like\n500+ people watching.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/dfgtKb-VpRk' frameborder='0' allowfullscreen></iframe></div>\n<h3>Where can readers find more about you?</h3>\n<p>I blog at Geshan.com.np, I don’t have my next talks up yet, but the talks I have\ndone in the past are in the <a href=\"https://geshan.com.np/blog/categories/talks/\">“talks” section of my\nblog</a>.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed//QitdhwHYAVE' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Geshan’s more recent talk from DevOps Days Newcastle on Microservices</em></p>\n<hr>\n<p>If you’re a tech conference speaker, email karl@cfpland.com to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Geshan Manandhar, Intercontinental Speaker and Senior Software Engineer","path":"/blog/speakers-story-geshan-manandhar/","category":"Speaker's Story","tags":null,"date":"2019/03/24","image":"https://cdn-images-1.medium.com/max/1200/1*mQ216JZETiJBtVpHdGLBkA.jpeg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<!--more-->\n<h3>Tell me about yourself? How did you get into public speaking?</h3>\n<p>I’m Laurie and I’m a software engineer. I got into speaking for a couple of\nreasons. In my former life I was an active member of the debate team and did a\nlot of musical theatre, so audiences don’t scare me. I decided I wanted to be\ninvolved in technical speaking in part because I wanted to see more diversity\nrepresented on the stage.</p>\n<img src=\"https://cdn-images-1.medium.com/max/1200/1*fM3yLcP58eVXUsdeHAnVdA.jpeg\" class=\"left\">\n<h3>What do you like about speaking at conferences?</h3>\n<p>There is so much to love about speaking.</p>\n<p>I like thinking up the talk subject and coming up with something I think is new\nor interesting that will benefit attendees. While writing talks are a huge time\ncommitment, there is nothing quite like explaining a concept to others to help\ncrystalize it in your mind.</p>\n<p>And, speaking is an incredible way to connect with other people outside of your\ntech silo and/or geographic area. It has also opened up additional career\nopportunities for me, and has resulted in growing in different directions as\nwell, like writing blog posts and answering interview questions!</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I do! It was a local first year conference. I think the talk was meant to be 20\nminutes or so and I was overly concerned about running short.</p>\n<p>It went pretty well, and people laughed at my jokes, but I was far more nervous\nthan I’d expected to be. If you want to judge for yourself <a href=\"https://www.youtube.com/watch?v=eS8tO3Z6E7U&#x26;t=579s\">the video is\nonline</a>. I really should\nretool this talk and give it again.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed//eS8tO3Z6E7U' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Laurie Barth’s first ever conference talk at DC Full Stack Web Summit, 2017</em></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I looked at my Trello board, and I’ve applied to around 35 conferences over the\ncourse of 3 years. I’ve been accepted at 12 and spoken at 9–10 of those.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I try to arrive in the room as early as I can after the previous speaker, and\nnormally I run the talk through without notes while getting ready that morning.\nAs long as I know I have the cues in my head I’m not worried about any further\nmemorization.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>My biggest piece of advice is about content.</p>\n<p>The talks that are most engaging to me include stories of failure, they talk\nabout learning something you don’t know and falling down along the way, or\nthey’re a new perspective from an outsider on a specific topic.</p>\n<p>This isn’t a hard and fast rule, but I think it’s a great way to think about\npotential topics and to feel confident being honest with your audience. You’ll\nbe more memorable.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>So so many! I really couldn’t pick so I’ll try and talk about speakers with\ntotally different types of talks.</p>\n<p>I love <a href=\"https://twitter.com/nmeans\">Nicholas Means</a> who takes you through\nincredibly real stories about disasters and almost disasters and what we can\nlearn from them.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed//099cHWSbAL8' frameborder='0' allowfullscreen></iframe></div>\n<p>I love <a href=\"https://twitter.com/editingemily\">Emily Freeman</a> who talks about how the\nhuman reactions of all of us manifest themselves in our work and how that can\nhelp us be more cognizant of our actions.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed//dbKjzxd-f70' frameborder='0' allowfullscreen></iframe></div>\n<p>I’ve recently discovered some amazing speakers through youtube videos like\n<a href=\"https://twitter.com/philip_roberts\">Philip Roberts</a> who did a great talk on the\njavascript event loop:</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed//8aGhZQkoFbQ' frameborder='0' allowfullscreen></iframe></div>\n<h3>Where can readers find out more about you?</h3>\n<p>I have a website: <a href=\"http://laurieontech.com/\">laurieontech.com</a> (pardon the lack\nof responsive design, I just migrated to a new framework and it’s a work in\nprogress). I also tweet a fair amount\n@<a href=\"https://twitter.com/laurieontech?lang=en\">laurieontech</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email karl@cfpland.com to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Laurie Barth, Software Engineer and Conference Speaker","path":"/blog/speakers-story-laurie-barth/","category":"Speaker's Story","tags":null,"date":"2019/03/17","image":"https://cdn-images-1.medium.com/max/1200/1*fM3yLcP58eVXUsdeHAnVdA.jpeg"}}},{"post":{"html":"<p>When I <a href=\"/how-cfpland-came-to-be/\">started CFP Land last\nyear</a>,\nit was to help other speakers like me find out about new opportunities. In the\npast few months the project has struck a chord and hundreds of speakers have\nfollowed @<a href=\"https://twitter.com/cfp_land\">cfp_land</a> on Twitter or <a href=\"https://www.cfpland.com/\">subscribed to\nthe weekly email</a>.</p>\n<!--more-->\n<img src=\"https://cdn-images-1.medium.com/max/2600/1*bmxvII4crxCtfxC8iV84Og.jpeg\" class=\"center\">\n<p>📖 Anyway, I’d like to start publishing other speakers’ stories here on the blog\nwith <strong>the goal of helping inspire and teach new tech conference speakers what\nit takes to get up on the stage for the first time.</strong></p>\n<p>After you’ve given a few talks — or a few dozen — it starts to seem automatic,\nbut most of us can still remember that first time, the worst talk we ever gave,\nor the best talk we ever gave. If you’re a conference speaker, <strong>I’d like to\npublish a short interview with you on this blog.</strong> It doesn’t matter if you’ve\nspoken one time or one hundred times, someone can benefit from hearing your\nstory.</p>\n<p>If you’re interested, please email a short bio and link to your website to\n<a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a>.</p>\n<p>I look forward to hearing your story!</p>","frontmatter":{"layout":"post","title":"Calling All Speakers: We Want to Hear Your Story","path":"/blog/speakers-tell-your-story/","category":"Updates","tags":null,"date":"2019/03/13","image":"https://cdn-images-1.medium.com/max/2600/1*bmxvII4crxCtfxC8iV84Og.jpeg"}}},{"post":{"html":"<p><em>TL;DR: Back in 2017, I made a personal goal to get accepted to speak at 4\nconferences. <a href=\"https://www.karllhughes.com/posts/one-year-conference-summary\">I made\nit</a> 🎉 and used\nthe experience to launch <a href=\"https://www.cfpland.com/\">CFP Land, a free tool to help conference speakers\nkeep up with CFPs (Calls for Proposals</a>) 📣</em></p>\n<!--more-->\n<p>In 2017, I set myself a goal to <strong>get accepted to speak at 4 technical\nconferences.</strong></p>\n<p>I’m a big goals person — every month I reassess my list of personal goals,\nrecord my progress, and make adjustments as necessary — so when I set out to do\nsomething, I <em>usually</em> figure out a way to make it happen.</p>\n<img src=\"https://cdn-images-1.medium.com/max/1200/1*8lIHyJIsYF9Ci31_DOWYgg.png\" class=\"left\">\n<p>I had done enough presenting, teaching, singing and acting in my life to feel\npretty comfortable on a stage, but I had never tried to break into the tech\nconference scene. Like many software developers, <strong>I felt that I didn’t really\nhave that much to talk about, that my experience was not unique, and that\nsomeone in the audience would call me out for being a fraud.</strong></p>\n<h3>Overcoming the Fear</h3>\n<p>Grappling with the fear of inadequacy is a lifelong pursuit for many of us. I’m\nfortunate to not be crippled by it, but it still took me years to put myself out\nthere and give a technical talk.</p>\n<p>The way I overcame this fear was to <strong>start small</strong>. As I came up with talk\nideas I pitched them to local meetups and code bootcamps. After giving some of\nthese talks, I realized that the audience isn’t as scary as I thought. <em>These\nare just other developers who genuinely want to learn something, and I’m lucky\nenough to be helping them!</em></p>\n<h3>Setting the Goal</h3>\n<p>Four conferences was arbitrary. It felt like enough that I would be able to call\nmyself a “real” conference speaker, but not so many that I would have to travel\nall the time. I love traveling, but with a wife and puppy at home, I have\npractical limits.</p>\n<p>So, I settled on four, and started forming a plan for making it happen.</p>\n<h3>Making a Plan</h3>\n<p>When I create a personal goal, I don’t just write it down and check on it. The\nimportant part to goal-setting is making measurable milestones that you believe\nwill help you achieve that goal. In this case, I started by making a sub-goal:</p>\n<h4>Sub-Goal: Get Accepted to Speak at One Conference</h4>\n<ul>\n<li>✅ Write 2 conference talk proposals</li>\n<li>✅ Create slides for the proposed talks</li>\n<li>✅ Find 40+ conference CFPs</li>\n<li>✅ Submit 2 proposals to 3+ conferences per week until I get accepted</li>\n</ul>\n<p>As I worked my way through the checklist (it probably took about 12 weeks in\nall), I learned a lot about how to write a good proposal and what conferences\nusually looked for. I was very careful to read the conference’s CFP page, but\nI’ll admit that I sometimes submitted proposals that weren’t an ideal fit\nanyway.</p>\n<p>Within a few weeks, <a href=\"https://www.karllhughes.com/posts/api-strat-2017-presentation\">I had gotten my first\nacceptance</a>! Now\nI knew what it would take to get a talk accepted, and I felt like I had some\nmomentum.</p>\n<h3>Oh Yeah, I Still Have to Prepare</h3>\n<p>With one conference booked, I started refining and practicing my proposed talk.\nThe very first time I went through the slides it took me 25 minutes…for a 45\nminute speaking slot…whoops!</p>\n<p>This is where the meetups came in. After I had practiced about 12 times on my\nown, I gave my talk to the local <a href=\"https://www.karllhughes.com/posts/testing-layers-js-chicago\">Chicago Javascript\nmeetup</a>. I\npracticed solo several more times before giving it at the conference.</p>\n<img src=\"https://cdn-images-1.medium.com/max/2400/1*Va0ug0QDjguymVqLGXvU-g.png\" class=\"center\">\n<p>But while I was preparing, I was surprised to see acceptances continue rolling\nin. I ended up getting 7 accepts in the first few months of pitching my talk.</p>\n<h3>It Doesn’t Always Work Out</h3>\n<p>I was excited, but started to run into some tough decisions. One conference in\nRomania was the same weekend as a family obligation and two conferences were on\nthe exact same day, so I turned down the second one that accepted me. In another\nunexpected turn, one conference couldn’t get the attendance they needed, so it\nwas cancelled outright.</p>\n<p>That took my total for 2017/2018 down to four. A manageable number, and even\nbetter, I had hit my goal for the year! 🎉</p>\n<h3>The takeaway: CFPs seem hard, but they don’t have to be</h3>\n<p><a href=\"https://www.karllhughes.com/posts/one-year-conference-summary\">I learned a lot in that first year\nspeaking</a>, and\nwhile I’ve dialed back the number of applications I submit, I’m still actively\nengaged in the speaking community, and submitting a few CFPs per month.</p>\n<p>The whole experience has showed me that speaking isn’t as scary as it seems, and\nsubmitting winning CFPs isn’t a black art. It inspired me to create something\nthat would help other speakers — new and experienced — improve their odds of\nsuccess and become better, more prolific speakers, and thus <a href=\"https://www.cfpland.com/\">CFP Land was\nborn</a>.</p>\n<img src=\"https://i.imgur.com/IANh995.jpg\" class=\"center\">\n<h3>CFP Land: Never Miss a Call for Proposals Again</h3>\n<p><strong>One of the most frustrating things for me was when I’d discover a great\nconference in a fantastic location just a few days or weeks too late.</strong> Once the\nCFP closes, you have to wait a whole year to get back in the mix, and keeping up\nwith dozens of conferences is a lot of work.</p>\n<p>Initially, I used <a href=\"https://airtable.com/invite/r/4EaSmQNr\">Airtable</a> to store\nall the conferences I could find. Each week, I’d manually check on them and\nupdate CFP dates and links as needed. It took valuable time away from the real\nwork of writing proposals and practicing my talk, so I thought this problem\nneeded a better solution.</p>\n<p>Fortunately, other conference aggregators and CFP websites already exist, but\nthe killer feature that they were missing was a single weekly reminder of all\nupcoming CFPs.</p>\n<p>This seems obvious, but I wouldn’t have thought of it if I hadn’t spent months\napplying for CFPs. <strong>As a speaker, I don’t want a huge list of conferences or a\nbunch of noise — I just want a focused, weekly reminder of all the CFPs that\nwould be right for me.</strong></p>\n<h3>The Present and the Future</h3>\n<p>In its current iteration, <a href=\"https://www.cfpland.com/\">CFP Land</a> is an email\nnewsletter with all the upcoming CFPs listed in chronological order. <a href=\"https://twitter.com/cfp_land\">I also\nTweet each CFP</a> when it’s due in 30 days so\nfollowers have plenty of time to submit.</p>\n<p>As speakers have joined, I’ve gotten some great feedback, and am working on\nimprovements already. In the coming months, you’ll be able to filter CFPs by\nlocation, category, and whether or not travel/hotel costs are covered. I’m also\nworking to get more data from more sources so speakers are really sure to never\nmiss a CFP again.</p>\n<p>Of course, I can’t continue improving CFP Land without input from other\nspeakers! If you’re a technology conference speaker and you’ve got feedback,\nemail me at <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> or sign up below to start getting the weekly\nnewsletter 💌.</p>","frontmatter":{"layout":"post","title":"43 Conferences, 7 Offers, 4 Talks: How CFP Land Came to be","path":"/blog/how-cfpland-came-to-be/","category":"Updates","tags":null,"date":"2019/03/07","image":"https://drive.google.com/uc?id=12k9e2wWqhd6d7nVym88XmHzhgQ2ZMSBf"}}},{"post":{"html":"<p>Not sure where to start? New to public speaking? Want to know more about the CFP process for technology conferences? You’ve come to the right place.</p>\n<p>This post contains a listing of resources on this site and around the web that will be useful for new conference speakers.</p>\n<!--more-->\n<h2>CFP Land Resources</h2>\n<p>While running CFP Land I’ve had the opportunity to meet with and learn from dozens of speakers around the world. The community has been amazingly welcoming and helpful, so I’ve been trying to give some of this knowledge back in the form of blog posts and guides for new speakers:</p>\n<ul>\n<li><strong><a href=\"/guides/speaking/\">The Comprehensive Guide to Speaking at Tech Conferences</a></strong> - This 17,000+ word guide is a massive collection of all the advice and best practices I’ve collected from conference speakers over the years. It’s broken up chronologically and should be digestible for even brand new conference speakers.</li>\n<li><strong><a href=\"/blog/\">The CFP Land Blog</a></strong> - Every month, I publish at least one new interview with a tech conference speaker. Other posts include advice and announcements.</li>\n<li><strong><a href=\"/conferences/\">Filterable List of Open CFPs</a></strong> - If you want to speak at tech conferences, you have to know which CFPs are available. This list includes travel and hotel perks as well as conference dates and topics.</li>\n</ul>\n<h2>Additional Resources</h2>\n<p>In addition to the articles on this site, I’ve run across lots of great resources on the internet that you’ll find helpful. Below are a few of the best:</p>\n<ul>\n<li><a href=\"https://github.com/vmbrasseur/Public_Speaking\">VM Brasseur’s big open source list of conference speaking tips</a></li>\n<li><a href=\"https://twitter.com/johnsundell/status/976496157928165378?s=19\">John Sundell’s top 4 tips for new conference speakers</a></li>\n<li><a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">How and why to speak at tech conferences by Nick Heiner</a></li>\n<li><a href=\"https://blog.prezi.com/speaking-at-a-conference-here-are-10-things-the-organizer-wants-you-to-keep-in-mind/\">10 things conference organizers want speakers to do</a></li>\n<li><a href=\"https://github.com/karlhorky/awesome-speakers\">An awesome open source list of speakers you can follow online</a></li>\n<li><a href=\"https://speaking.io/\">Zach Holman’s wonderful list of tips at Speaking.io</a></li>\n<li><a href=\"https://www.lifehack.org/688597/the-ultimate-public-speaking-tips\">Lifehack’s Public Speaking Guide</a></li>\n<li><a href=\"https://news.ycombinator.com/item?id=16838460\">Hacker News’ favorite tech talks</a></li>\n<li><a href=\"http://www.speaktosucceed.in/\">Speak to Succeed - A blog with lots of public speaking tips</a></li>\n<li><a href=\"https://www.matthewgerstman.com/tech/how-i-prepare-a-talk/\">“How I Prepare a Tech Talk” by Matthew Gerstman</a></li>\n<li><a href=\"https://medium.com/@shehackspurple/presentation-tips-for-technical-talks-8d59f3de9f6d\">23 Presentation Tips for Technical Talks by Tanya Janca</a></li>\n<li><a href=\"https://dev.to/azure/a-guide-for-everyone-who-wants-to-give-technical-presentations-53bo\">A Comprehensive and Practical Guide to Technical Presentations by Jeremy Likness</a></li>\n<li><a href=\"https://www.garfieldtech.com/blog/3-paragraph-pitch\">Larry Garfield’s Three Paragraph Pitch for writing CFP Abstracts</a></li>\n<li><a href=\"https://twitter.com/EmmaWedekind/status/1105800258792185856\">Emma Wedekind’s Twitter Thread with hundreds of tips as replies</a></li>\n<li><a href=\"https://blog.frankel.ch/advices-junior-conference-speakers/\">Advice for Junior Conference Speakers by Nicolas Fränkel</a></li>\n</ul>\n<p>I will continue to keep this list up to date as we find more. If you want to submit your own resource, contact <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a>.</p>","frontmatter":{"layout":"post","title":"Tips for New Conference Speakers","path":"/blog/new-conference-speakers/","category":"Tips","tags":["New Speakers"],"date":"2019/01/01","image":null}}}],"pathPrefix":"blog","first":false,"last":true,"index":5,"pageCount":5,"additionalContext":{}}}