{"data":{"remark":{"posts":[{"post":{"html":"<p>With the global Covid 19 pandemic forcing the cancellation of thousands of conferences, meetups, and tradeshows across the world,\nyou have probably already changed your plans because of the virus. I wanted to offer a little update on how I’m handling things\nwith CFP Land, and what the current recommendations are for people like us who speak at conferences.</p>\n<!--more-->\n<h2>The CFP Land Newsletter Will Continue Weekly Publication</h2>\n<p>First, I am fortunate to have a job that can be done remotely, so my day-to-day schedule won’t change too much. I’ll continue\npreparing and publishing the CFP Land newsletter every week unless I (or someone in my family) gets seriously sick.</p>\n<p>Second, I will update any conferences I hear of that cancel their events, but I could use your help with this. I’m not on every\nevent’s mailing list, so if you see a conference on CFP Land that you know is no longer going to happen, please let me know\nusing the “Report an Issue” link on the CFP:</p>\n<p><img src=\"/img/posts/report.gif\" alt=\"Report issues on CFP Land\"></p>\n<p>As always, I’m also available by email at <code class=\"language-text\">info@cfpland.com</code>.</p>\n<h2>Consider Preemptively Canceling Any In-Person Events You’re Planning on Attending</h2>\n<p>Seriously, <a href=\"https://trackcorona.herokuapp.com/map\">this thing is global</a>, and probably going to get worse before it gets better.\n<a href=\"https://nationalpost.com/news/world/covid-19-what-is-social-distancing-and-how-to-do-it-properly\">Social distancing is the best way to slow its spread</a>, so I can’t imagine many tech conferences are important enough to go to at the risk of thousands of peoples’ lives.</p>\n<p><img src=\"/img/posts/covid-map.png\" alt=\"Global Covid 19 Map\"></p>\n<p>Alternatively, you could offer to give any scheduled talks virtually, or as <a href=\"\">Phil Nash</a> is doing, you could switch to live-streaming\nsome coding sessions instead.</p>\n<hr>\n<p>Much more will be coming soon, so if you’re interested, <a href=\"/members/\">your CFP Land Pro Membership is just a few clicks away</a>!</p>","frontmatter":{"layout":"post","title":"A CFP Land Covid 19 Update","path":"/blog/covid-19/","category":"Updates","tags":["Covid 19","Service Interruptions"],"date":"2020/03/14","image":"/img/posts/covid-map.png"}}},{"post":{"html":"<p>I launched <a href=\"/members/\">CFP Land Pro</a> back in 2019. After gathering feedback from hundreds of technology conference speakers, I realized that like me, many of them struggled to find and keep up with which CFPs were available and which ones they had applied to. Additionally, I wanted to find a way to make sure CFP Land was self-sustaining, so CFP Land Pro was born.</p>\n<p>If you’re considering a <a href=\"/members/\">Pro Membership</a>, read on to learn more about everything that’s included. Don’t hesitate to <a href=\"mailto:info@cfpland.com\">email me</a> if you have questions about how CFP Land can help you be a more successful speaker.</p>\n<!--more-->\n<h2><span id=\"early-access\">1. Early Access to CFPs</span></h2>\n<p>The weekly CFP Land newsletter and <a href=\"/conferences/\">our free conference listings</a> show all CFPs that close in the next 21 days. Usually this is plenty of time to apply, but many conferences review applicants on a rolling basis. In those cases, <strong>applying as early as possible is advantageous</strong>.</p>\n<p>One of the most popular features among Pro Members is the early access to CFPs. If you’re not a Pro Member already, you won’t see any conferences tagged <code class=\"language-text\">⬆️ Pro</code> in your feed, but if you sign up for a Pro Membership, here’s what it looks like:</p>\n<p><a href=\"/members/\"><img src=\"/img/posts/pro-early-access.png\" alt=\"Pro Members get access to CFPs 21 days before free members\"></a></p>\n<p>As a Pro Member, you can see all the CFPs in our database that are closing in the next <strong>42 days</strong>, meaning you’ll be able to apply much earlier than free users.</p>\n<h2><span id=\"save-cfps\">2. Save CFPs</span></h2>\n<p><a href=\"/members/\"><img src=\"/img/posts/save-cfps-1.gif\" class=\"right\" alt=\"Save conferences to be reminded before they close\"></a></p>\n<p>It’s easy to lose track of which CFPs you want to submit when there are hundreds each month on CFP Land alone. <strong>Saving CFPs is a great way to keep up with the conferences that you care about most.</strong></p>\n<p>Once you save a CFP to your Pro account, you’ll get email reminders 21, 7, and 3 days before it closes. This is great if you’re browsing CFPs on mobile, but you don’t want to forget to submit to them when you’re back at your computer.</p>\n<p>Another useful reason to save CFPs is to personalize your feed of upcoming Calls for Proposals. By default, there may be 50 to 100 open CFPs on the “All” page, so saving CFPs will ensure you don’t have to wade through quite as many irrelevant conferences.</p>\n<h2><span id=\"export-cfps\">3. Export CFPs to Your Personal Calendar</span></h2>\n<p><a href=\"/members/\"><img src=\"/img/posts/export-cfps-2.gif\" alt=\"Using CFP Land Pro to export conferences to your calendar\"></a></p>\n<p>You don’t have to track your CFPs in CFP Land. Pro Members also get a calendar export tool that allows you to save CFPs to Google Calendar, Apple Calendar, or Outlook.</p>\n<p>This is helpful if you want to create custom reminders or use your own calendar notifications rather than the CFP Land emails.</p>\n<h2><span id=\"search-alerts\">4. Custom Search Alerts</span></h2>\n<p><a href=\"/members/\"><img src=\"/img/posts/saved-search-2.gif\" alt=\"Saving searches with your CFP Land Pro Membership\"></a></p>\n<p>All CFP Land users can use filters to search for conferences that match their preferences, but if you’re a free user, you will need to check the site periodically to make sure you don’t miss any new opportunities. In order to make your life a little easier, <strong>CFP Land Pro Members can save their searches to get an email alert when new CFPs are found that match their filters.</strong></p>\n<p><a href=\"/members/\"><img src=\"/img/posts/saved-search-3.png\" class=\"right\" alt=\"Email alert when results from a saved search are found\" /></a></p>\n<p>When a new conference CFP is found that matches one of your saved searches, you’ll get an email about it, letting you know that you can either <a href=\"/blog/pro-saving-cfps/\">Save the CFP</a> or apply right away.</p>\n<p>Hopefully you’ll never miss another great CFP once you set up your searches on <a href=\"/members/\">CFP Land Pro</a>.</p>\n<h2><span id=\"abstracts\">5. Save Your Abstracts</span></h2>\n<p><a href=\"/members/\"><img src=\"/img/posts/abstracts.png\" alt=\"Abstracts on CFP Land Pro\"></a></p>\n<p>Most experienced speakers have a pool of abstracts that they could submit depending on the audience and conference focus. CFP Land Pro Members can save those Abstracts to their CFP Land account so that they can tie them to each CFP they submit.</p>\n<p>This is a great way to see which of your abstracts is the most successful and to remember which Abstract you submitted to which conference.</p>\n<h2><span id=\"track\">6. Track Your Submissions</span></h2>\n<p><a href=\"/members/\"><img src=\"/img/posts/track.gif\" alt=\"Track submissions on CFP Land Pro\"></a></p>\n<p>Finally, if you submit dozens of Abstracts per year, it can be hard to keep up with all of them. In my first year of speaking, I used a giant spreadsheet to track over 50 submissions, and it got to be a huge mess.</p>\n<p>CFP Land Pro Members can track the conferences they’ve applied to, been accepted at, and been rejected from in addition to attaching their Abstracts to each submission.</p>\n<hr>\n<p>Much more will be coming soon, so if you’re interested, <a href=\"/members/\">your CFP Land Pro Membership is just a few clicks away</a>!</p>","frontmatter":{"layout":"post","title":"Pro Members Only: A Complete List of All the Features CFP Land Pro Members Get","path":"/blog/pro-features/","category":"Updates","tags":["Pro Features"],"date":"2020/02/07","image":"/img/posts/pro-early-access.png"}}},{"post":{"html":"<p>Last week, I added a couple new sources that more than tripled the number of <a href=\"https://www.cfpland.com/conferences\">conference CFPs listed on our site</a>.\nUnfortunately, I made an assumption that any publicly available API would be okay to integrate with, and one of the new sources\ngot a little bothered about my cross-posting their listings. In order to increase transparency, I’m going to show you where\nI get all the data for this site, and outline my policy on sharing this data.</p>\n<!--more-->\n<h3>CFP Source Data</h3>\n<p>First of all, <strong>my immediate goal for CFP Land is to provide a free feed of all the upcoming CFPs for tech conferences that I can find</strong>.</p>\n<p>With that in mind, I want to give credit to the sources I use to find out about CFPs:</p>\n<ul>\n<li><strong><a href=\"https://confs.tech/\">Confs.tech</a></strong> - An open source list of conferences that I and many others have contributed to.</li>\n<li><strong><a href=\"https://callingallpapers.com/\">Calling All Papers</a></strong> - An open source list and API that aggregates CFPs from joind.in, papercall.io, and lanyrd (which I believe is now defunct).</li>\n<li><strong>Twitter searches and retweets</strong> - People often mention <a href=\"https://twitter.com/cfp_land\">@cfp_land</a> with new conferences, but I also have a few Twitter searches set up to help me find new CFPs.</li>\n<li><strong>Conference Speaker Slack channel</strong> - I am a part of a Slack channel for conference speakers where we often pass CFPs around. I add many of these to my list as well.</li>\n<li><strong>User submissions</strong> - Finally, I’m getting an increasing number of <a href=\"https://www.cfpland.com/submit\">submissions from subscribers</a>. This is really helpful, and I plan on making it even easier to do in the future.</li>\n</ul>\n<h3>Enhancing Source Data</h3>\n<p>Getting the upcoming CFPs is the first part of the process. Next, I manually review each one, make sure it’s categorized, that the location\nis accurate, and I add data about whether they cover travel and hotel costs for speakers. This takes me an increasing amount of time\neach week, but I’m working to automate it. 🤖</p>\n<p>I also have scripts that add logos, Twitter accounts, descriptions, and other metadata.</p>\n<h3>Acceptable Data Use</h3>\n<p>All the data I have is available to the public for any purpose (including building tools that directly compete with CFP Land!) <a href=\"https://www.cfpland.com/conferences\">here on the website</a>, <a href=\"https://feeds.cfpland.com/v2/rss/cfps\">in this RSS feed</a>, or <a href=\"https://cfpland.github.io/api-docs/\">through the API</a>. Seriously, if you want to build something cool with it, go for it. I’d love to hear about it! One guy sent me a message about a <a href=\"https://github.com/jonatasbaldin/cfpland-telegram-bot\">CFP Land Telegram Bot</a> that he built. 👍</p>\n<p>I don’t currently show CFPs that have closed or CFPs that are closing in more than 3 weeks, but I am working on making them available too.</p>\n<h3>Monetization</h3>\n<p><strong>My long-term goal for this project is to make it self-sustaining.</strong></p>\n<p>I do occasionally find sponsors for the newsletter, and I’m exploring building a CFP submission management tool for speakers. If it makes enough to pay for my hosting and email client bills someday, that would be pretty cool. If not, I’ll probably try to do as much as can be fully automated and stop doing as much cleanup.</p>\n<p>If you have questions or problems with any of this, I am a real person. My name is Karl. I live in Chicago, USA and have <a href=\"https://www.instagram.com/urbanmutt_chilidog/\">a dog named Chili</a>. Just <a href=\"mailto:karl@cfpland.com\">email me</a> and I’d love to talk. 💌</p>","frontmatter":{"layout":"post","title":"CFP Land Data Sources & Sharing","path":"/blog/data/","category":"Updates","tags":["Data","Website"],"date":"2019/04/29","image":"https://i.imgur.com/TU40Hf6.jpg"}}},{"post":{"html":"<p>This week, I released three new features to newsletter subscribers that should improve your experience with CFP Land: Category Preferences, 🔔 New tags, and Perks.</p>\n<!--more-->\n<h2>Category Preferences</h2>\n<p>The most requested feature so far has been the ability for subscribers to choose a preferred category. Each week, the CFP Land newsletter contains more than 30 conferences, so it’s really annoying to sift through all of them looking for the few you really care about. For that reason, each email you get now includes a link to “Update Your Preferences”:</p>\n<p><img src=\"https://i.imgur.com/sp9mq2c.png\" alt=\"Update your preferences in the weekly email\"></p>\n<p>This will take you to form where you can specify the category of conferences you prefer:</p>\n<p><img src=\"https://i.imgur.com/iibk8D7.png\" alt=\"Category preference form\"></p>\n<p>Each week, any CFPs matching your preferred category should show up at the top of your email:</p>\n<p><img src=\"https://i.imgur.com/3utX9jM.png\" alt=\"Preferred CFPs\"></p>\n<p>Location preferences aren’t quite ready yet, but they will be coming soon!</p>\n<h2>“New” Tags</h2>\n<p>Another way to pick out new CFPs from the weekly email is to focus on any that are new. The list is sorted by CFP end date, so usually new ones will be at the bottom, but occasionally I’ll add a conference CFP just before it closes. In this case, it will show up marked with the ”🔔 New” tag. This means the conference has been added since the last email was sent 7 days ago:</p>\n<p><img src=\"https://i.imgur.com/sp9mq2c.png\" alt=\"New tag indicates a conference has been added in the past 7 days\"></p>\n<h2>Perks for Speakers</h2>\n<p>Finally, I’m spending extra time each week looking for the “Perks” that each conference offers to speakers (hopefully I’ll be able to automate this eventually). This was another highly requested feature, and it definitely helps if you’re trying to prioritize conferences that will cover travel or hotel costs for you.</p>\n<p>Right now the perks I look for are:</p>\n<ul>\n<li><strong>Travel</strong> meaning that the conference will pay for your travel to and from the event.</li>\n<li><strong>Hotel</strong> indicates that the conference offers reimbursement for hotel costs.</li>\n<li><strong>Stipend</strong> is an offer for payment or extra cash to cover miscellaneous expenses while speaking. Not many conferences offer this, so it’s nice when they do!</li>\n</ul>\n<p>Because my resources are limited, I only include these perks when they are <strong>clearly listed</strong> on the conference’s website page for speakers. If I miss something, you can always email me to let me know. Also, I decided not to include whether a free ticket for the event was included because <em>almost</em> every conference includes this by default.</p>\n<p><img src=\"https://i.imgur.com/P03MMW4.png\" alt=\"Perks like travel, hotel, and stipend are included in each email\"></p>\n<p>That’s it for this month’s new features. All new subscribers are asked to fill out a feedback form, so if you’d like to see improvements, keep an eye out for that email after you subscribe or contact me (<a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a>) to start a conversation.</p>","frontmatter":{"layout":"post","title":"New Features: Category Preferences, \"New\" Tags, and Perks","path":"/blog/category-preferences-perks/","category":"Updates","tags":["Email","Website"],"date":"2019/04/05","image":null}}},{"post":{"html":"<p>When I <a href=\"/how-cfpland-came-to-be/\">started CFP Land last\nyear</a>,\nit was to help other speakers like me find out about new opportunities. In the\npast few months the project has struck a chord and hundreds of speakers have\nfollowed @<a href=\"https://twitter.com/cfp_land\">cfp_land</a> on Twitter or <a href=\"https://www.cfpland.com/\">subscribed to\nthe weekly email</a>.</p>\n<!--more-->\n<img src=\"https://cdn-images-1.medium.com/max/2600/1*bmxvII4crxCtfxC8iV84Og.jpeg\" class=\"center\">\n<p>📖 Anyway, I’d like to start publishing other speakers’ stories here on the blog\nwith <strong>the goal of helping inspire and teach new tech conference speakers what\nit takes to get up on the stage for the first time.</strong></p>\n<p>After you’ve given a few talks — or a few dozen — it starts to seem automatic,\nbut most of us can still remember that first time, the worst talk we ever gave,\nor the best talk we ever gave. If you’re a conference speaker, <strong>I’d like to\npublish a short interview with you on this blog.</strong> It doesn’t matter if you’ve\nspoken one time or one hundred times, someone can benefit from hearing your\nstory.</p>\n<p>If you’re interested, please email a short bio and link to your website to\n<a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a>.</p>\n<p>I look forward to hearing your story!</p>","frontmatter":{"layout":"post","title":"Calling All Speakers: We Want to Hear Your Story","path":"/blog/speakers-tell-your-story/","category":"Updates","tags":null,"date":"2019/03/13","image":"https://cdn-images-1.medium.com/max/2600/1*bmxvII4crxCtfxC8iV84Og.jpeg"}}},{"post":{"html":"<p><em>TL;DR: Back in 2017, I made a personal goal to get accepted to speak at 4\nconferences. <a href=\"https://www.karllhughes.com/posts/one-year-conference-summary\">I made\nit</a> 🎉 and used\nthe experience to launch <a href=\"https://www.cfpland.com/\">CFP Land, a free tool to help conference speakers\nkeep up with CFPs (Calls for Proposals</a>) 📣</em></p>\n<!--more-->\n<p>In 2017, I set myself a goal to <strong>get accepted to speak at 4 technical\nconferences.</strong></p>\n<p>I’m a big goals person — every month I reassess my list of personal goals,\nrecord my progress, and make adjustments as necessary — so when I set out to do\nsomething, I <em>usually</em> figure out a way to make it happen.</p>\n<img src=\"https://cdn-images-1.medium.com/max/1200/1*8lIHyJIsYF9Ci31_DOWYgg.png\" class=\"left\">\n<p>I had done enough presenting, teaching, singing and acting in my life to feel\npretty comfortable on a stage, but I had never tried to break into the tech\nconference scene. Like many software developers, <strong>I felt that I didn’t really\nhave that much to talk about, that my experience was not unique, and that\nsomeone in the audience would call me out for being a fraud.</strong></p>\n<h3>Overcoming the Fear</h3>\n<p>Grappling with the fear of inadequacy is a lifelong pursuit for many of us. I’m\nfortunate to not be crippled by it, but it still took me years to put myself out\nthere and give a technical talk.</p>\n<p>The way I overcame this fear was to <strong>start small</strong>. As I came up with talk\nideas I pitched them to local meetups and code bootcamps. After giving some of\nthese talks, I realized that the audience isn’t as scary as I thought. <em>These\nare just other developers who genuinely want to learn something, and I’m lucky\nenough to be helping them!</em></p>\n<h3>Setting the Goal</h3>\n<p>Four conferences was arbitrary. It felt like enough that I would be able to call\nmyself a “real” conference speaker, but not so many that I would have to travel\nall the time. I love traveling, but with a wife and puppy at home, I have\npractical limits.</p>\n<p>So, I settled on four, and started forming a plan for making it happen.</p>\n<h3>Making a Plan</h3>\n<p>When I create a personal goal, I don’t just write it down and check on it. The\nimportant part to goal-setting is making measurable milestones that you believe\nwill help you achieve that goal. In this case, I started by making a sub-goal:</p>\n<h4>Sub-Goal: Get Accepted to Speak at One Conference</h4>\n<ul>\n<li>✅ Write 2 conference talk proposals</li>\n<li>✅ Create slides for the proposed talks</li>\n<li>✅ Find 40+ conference CFPs</li>\n<li>✅ Submit 2 proposals to 3+ conferences per week until I get accepted</li>\n</ul>\n<p>As I worked my way through the checklist (it probably took about 12 weeks in\nall), I learned a lot about how to write a good proposal and what conferences\nusually looked for. I was very careful to read the conference’s CFP page, but\nI’ll admit that I sometimes submitted proposals that weren’t an ideal fit\nanyway.</p>\n<p>Within a few weeks, <a href=\"https://www.karllhughes.com/posts/api-strat-2017-presentation\">I had gotten my first\nacceptance</a>! Now\nI knew what it would take to get a talk accepted, and I felt like I had some\nmomentum.</p>\n<h3>Oh Yeah, I Still Have to Prepare</h3>\n<p>With one conference booked, I started refining and practicing my proposed talk.\nThe very first time I went through the slides it took me 25 minutes…for a 45\nminute speaking slot…whoops!</p>\n<p>This is where the meetups came in. After I had practiced about 12 times on my\nown, I gave my talk to the local <a href=\"https://www.karllhughes.com/posts/testing-layers-js-chicago\">Chicago Javascript\nmeetup</a>. I\npracticed solo several more times before giving it at the conference.</p>\n<img src=\"https://cdn-images-1.medium.com/max/2400/1*Va0ug0QDjguymVqLGXvU-g.png\" class=\"center\">\n<p>But while I was preparing, I was surprised to see acceptances continue rolling\nin. I ended up getting 7 accepts in the first few months of pitching my talk.</p>\n<h3>It Doesn’t Always Work Out</h3>\n<p>I was excited, but started to run into some tough decisions. One conference in\nRomania was the same weekend as a family obligation and two conferences were on\nthe exact same day, so I turned down the second one that accepted me. In another\nunexpected turn, one conference couldn’t get the attendance they needed, so it\nwas cancelled outright.</p>\n<p>That took my total for 2017/2018 down to four. A manageable number, and even\nbetter, I had hit my goal for the year! 🎉</p>\n<h3>The takeaway: CFPs seem hard, but they don’t have to be</h3>\n<p><a href=\"https://www.karllhughes.com/posts/one-year-conference-summary\">I learned a lot in that first year\nspeaking</a>, and\nwhile I’ve dialed back the number of applications I submit, I’m still actively\nengaged in the speaking community, and submitting a few CFPs per month.</p>\n<p>The whole experience has showed me that speaking isn’t as scary as it seems, and\nsubmitting winning CFPs isn’t a black art. It inspired me to create something\nthat would help other speakers — new and experienced — improve their odds of\nsuccess and become better, more prolific speakers, and thus <a href=\"https://www.cfpland.com/\">CFP Land was\nborn</a>.</p>\n<img src=\"https://i.imgur.com/IANh995.jpg\" class=\"center\">\n<h3>CFP Land: Never Miss a Call for Proposals Again</h3>\n<p><strong>One of the most frustrating things for me was when I’d discover a great\nconference in a fantastic location just a few days or weeks too late.</strong> Once the\nCFP closes, you have to wait a whole year to get back in the mix, and keeping up\nwith dozens of conferences is a lot of work.</p>\n<p>Initially, I used <a href=\"https://airtable.com/invite/r/4EaSmQNr\">Airtable</a> to store\nall the conferences I could find. Each week, I’d manually check on them and\nupdate CFP dates and links as needed. It took valuable time away from the real\nwork of writing proposals and practicing my talk, so I thought this problem\nneeded a better solution.</p>\n<p>Fortunately, other conference aggregators and CFP websites already exist, but\nthe killer feature that they were missing was a single weekly reminder of all\nupcoming CFPs.</p>\n<p>This seems obvious, but I wouldn’t have thought of it if I hadn’t spent months\napplying for CFPs. <strong>As a speaker, I don’t want a huge list of conferences or a\nbunch of noise — I just want a focused, weekly reminder of all the CFPs that\nwould be right for me.</strong></p>\n<h3>The Present and the Future</h3>\n<p>In its current iteration, <a href=\"https://www.cfpland.com/\">CFP Land</a> is an email\nnewsletter with all the upcoming CFPs listed in chronological order. <a href=\"https://twitter.com/cfp_land\">I also\nTweet each CFP</a> when it’s due in 30 days so\nfollowers have plenty of time to submit.</p>\n<p>As speakers have joined, I’ve gotten some great feedback, and am working on\nimprovements already. In the coming months, you’ll be able to filter CFPs by\nlocation, category, and whether or not travel/hotel costs are covered. I’m also\nworking to get more data from more sources so speakers are really sure to never\nmiss a CFP again.</p>\n<p>Of course, I can’t continue improving CFP Land without input from other\nspeakers! If you’re a technology conference speaker and you’ve got feedback,\nemail me at <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> or sign up below to start getting the weekly\nnewsletter 💌.</p>","frontmatter":{"layout":"post","title":"43 Conferences, 7 Offers, 4 Talks: How CFP Land Came to be","path":"/blog/how-cfpland-came-to-be/","category":"Updates","tags":null,"date":"2019/03/07","image":"https://drive.google.com/uc?id=12k9e2wWqhd6d7nVym88XmHzhgQ2ZMSBf"}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"category":"Updates"}}