{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"9f2c5b9b-58c9-59ce-b4ee-486b8f698a53","html":"<p>…</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/G2DRaCN.jpg\" class=\"right\">\n<p>My name is Vincenzo Chianese, I am an Italian Software Developer that’s been working for the last 5 years in the WebAPIs space, providing tools for API Developers. I mostly code in TypeScript/JavaScript these days, but previously I’ve worked with C#, C++ and VB6. I am an Auth0 Ambassador and a Google Developer Expert in WebTechnologies and I’ve been living in Prague, Madrid and (starting in January) in Austin, TX.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>The ability to travel and see new places. I think I’ve been able to go on all the continents just because of the speaking engagements I had, which would have been impossible otherwise.</p>\n<p>Second? Networking with speakers; <strong>I met some of my best contacts I have in the space because of the conferences,</strong> and I even ended up organising a conference because of some people I met in Paris last year. You never know who you’re talking to — and you can be surprised. Curiously enough, the content is really the last reason I’d go to a conference.</p>\n<h3>What topics do you typically speak about?</h3>\n<p>I have always refused to present basic-level stuff that you can easily find on the web (tutorials and documentation) or even worse marked products for the company I work for. <strong>So every 8-10 months I do kind of a retrospective of what I’ve been working on and if I see a fit for an interesting talk (such as something that you don’t exactly do everyday, something that has never been treated elsewhere)</strong> — I put up an abstract and a title and try to submit it around.</p>\n<p>Sometimes the topic is appreciated, but most of the times it is not. My point is — I want to share experiences, not technical documents in an oral form.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I totally remember it. It was in 2015 at the mDevCamp and I was asked to replace a colleague that couldn’t make it. I was in an horrible condition (I had fever) and it was at the very last moment. I didn’t want to leave the company unrepresented to I took the bet and had the presentation anyway.</p>\n<div id=\"presentation-embed-38894088\"></div>\n<script src='https://slideslive.com/embed_presentation.js'></script>\n<script>\n    embed = new SlidesLiveEmbed('presentation-embed-38894088', {\n        presentationId: '38894088',\n        autoPlay: false,\n        verticalEnabled: true\n    });\n</script>\n<p>I must say, my English has improved since then, I promise.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<h3>What advice do you have for new speakers?</h3>\n<h3>Where can readers find more about you?</h3>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Vincenzo Chianese, API Tool Builder and Google Developer Expert","path":"/blog/speaker-vincenzo-chianese/","category":"Speaker's Story","tags":null,"date":"2019/12/01","image":"https://i.imgur.com/G2DRaCN.jpg"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}