{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"2da49e76-cde1-57d8-90c8-c3c76fbb3b58","html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Like many people who get into public speaking, Chris Holland has a strong drive to help other engineers perform at their best. When I first met Chris, he was speaking on application security at a regional PHP conference. One thing that comes across here (and if you meet Chris in person) is his passion for helping other engineers learn about topics that can be challenging to tackle.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p>I was raised in Paris, France then moved to Los Angeles in the 90s where I studied some computer science and quickly got into web applications development.</p>\n<p>My early career was focused on front-end development before we had standards such as CSS and the DOM - before AJAX was a thing. Fun trivia, back when Gmail first came out and people were impressed with its “autocompletion” on email addressees, I won a contest to deliver <a href=\"http://wick.sourceforge.net/\">the first open-source framework to do this</a>. Nobody cared, but it was fun.</p>\n<p>Pretty quickly however, I got more into server-side software engineering with Java/J2EE, then PHP and C#/.Net, where I developed a better understanding of Object-Oriented Design, Database Design and Information Security.</p>\n<p>I’ve been managing engineering organizations of various sizes since 2007, and to this day, remain close to the code, seeking out every opportunity to coach software engineers toward successful careers.</p>\n<p>Having learned many lessons “the hard way” over the past 20 years, in 2017 I started developing a growing portfolio of talks shining light on various aspects of Software Crafting and InfoSec. Having spoken at various local meetups, I got into my first “full software conference” as a speaker at the 2017 inaugural Coder <a href=\"https://www.codercruise.com\">Cruise Conference</a> by the fine folks at One for All Events. In 2017 I also spoke at a couple of InfoSec conferences by invitation from contacts developed from speaking at local OWASP meetups. All in all, 2017 ignited my speaking career.</p>\n<img src=\"https://i.imgur.com/eEzegV6.jpg\" class=\"center\">\n<h3>What do you like about speaking at conferences?</h3>\n<p>Speaking at conferences has been a powerful cathartic outlet for overcoming my ever-growing frustration of seeing software engineers making the same mistakes I did earlier-on in my career.</p>\n<p>Far beyond this however, speaking with attendees and listening to their stories, experiences, frustrations and successes, has also been very rewarding and has often given me ideas for new talks, while helping me refine existing talks. Sharing meals and drinks with attendees is a lot of fun. I do tend to be shy though, so I find it easier to engage with people in more intimate settings. <strong>I make a point of sitting at tables of people I don’t know and listening to their conversations while slowly coming out of my shell.</strong></p>\n<p>I also love meeting and learning from other sharp speakers at conferences. It’s helped me correct misconceptions, learn new things, and think about various problems differently.</p>\n<p><strong>Getting to travel the World has been an unbelievable experience. The people, the sights, the food. Just amazing.</strong></p>\n<p>Finally, I absolutely love meeting authors and contributors to open-source projects, with plenty of time to chat with them at speaker dinners and thank them profusely, in person, for their work. I’m also starting to contribute to some projects on Patreon.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first Software Engineering talk lacked structure. I jumped into concepts without sufficiently linking them with a common thread, both with slides and verbally. The audience was very supportive though and in general agreed with my concepts. Questions were thoughtful, and I did get a good amount of spontaneous positive feedback after it, with solid break-out discussions.</p>\n<p>My first InfoSec talk could date as far back as 2015 at a local OWASP Meetup. The graphics in my slides were just too “thin” with insufficient contrast and text that was too small. My delivery wasn’t on-point either. <strong>Despite all that, several people came-up afterward to continue the discussion.</strong></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>In 2018, I started getting accepted to a good number of conferences and spoke at seven of them. In 2019 so-far I’m looking at seven conferences between March and June. I’d be happy to score a couple more for the fall/winter season, but I do have limited availability because speaking at conferences isn’t part of my job description.</p>\n<p>For each conference at which I speak, I take personal time off from work. I also save-up money to bring my Wife to <em>a couple</em> of conferences per year. We strategize about the destinations she’d hope for the most, and when her parents are available to take care of our 2 daughters for a few days.</p>\n<p><strong>I do apply to “several dozen” conferences each year. It’s … overwhelming at times.</strong></p>\n<h3>Do you have a pre-talk routine?</h3>\n<ul>\n<li>Go over my slides, rehearse mental timing milestones at various sections of it. In some cases make some last-minute tweaks if I find an opportunity to more closely align an area of the presentation with the conference’s audience. Or something relevant that just happened in the news.</li>\n<li>Try to scope out the room and check for connectivity, HDMI, Power.</li>\n<li>Make sure my laser pointer works.</li>\n<li>Figure out where I can stash a bottle of water near the podium for mid-talk swig.</li>\n<li>Scope out well ahead of my talk, where the Audio/Video engineers are in case I need their help.</li>\n<li>See whether the previous speaker in my room had any issue with the equipment.</li>\n<li>Get laptop, remote and everything set-up at least 10 minutes before my talk, I like to start setting-up 15-20 minutes ahead of time when I can, and be fully-ready at the 10-minute mark. Yea … I’m also the person who shows-up at the airport at least 2 hours before any flight even with CLEAR and Pre-check.</li>\n</ul>\n<h3>What advice do you have for new speakers?</h3>\n<p><strong>Conferences are literally yearning for new voices. Attendees are growing tired of seeing the same people at conferences year after year.</strong> An increasing number of conferences are focusing their attention on attracting new speakers with no speaking experience with a great emphasis on diversity for underrepresented demographics.</p>\n<p>Check out <a href=\"http://selfconference.org\">SelfConference.org</a> — Speaking at a conference doesn’t have to be about having mastered technology X or methodology Y. It can be about your journey, your struggles, your learning process. Conference attendees love seeing a person to whom they can relate, sharing their struggles and hearing their story.</p>\n<p>Additionally, some of the most compelling talks and keynotes I’ve watched had nothing to do with technology. They were about human topics:</p>\n<ul>\n<li>If you’re struggling with mental health, become a spokesperson for <a href=\"https://osmihelp.org/\">OSMIHelp.org</a>, and educate us.</li>\n<li>If you’re struggling with discrimination, educate us.</li>\n<li>If you’re struggling with accessibility, educate us.</li>\n<li>If you care about something, educate us.</li>\n</ul>\n<p><strong>Turn the World into allies for the causes you care about.</strong></p>\n<p>Back to technology though, if you fear “imposter syndrome”, just know that you have valuable experience to share. I use this syndrome as motivation to more thoroughly research topics I speak on, and to seek out prevailing counter arguments to the points I’m about to make.</p>\n<p>With all this said, the most defensible position lies within what has worked for you, from the confines of realities which you had to face.</p>\n<p>Finally, keep in mind that conference organizers and their speaker selection panels know what they’re doing. <strong>If they’ve picked you, it’s important for you to realize that they’ve done their due-diligence, and that you absolutely, positively, unequivocally belong on that stage.</strong></p>\n<p>So what’s the downside to submitting? What’s the worst that can happen? You might unleash your awesomeness unto the World?</p>\n<p>Bring it.</p>\n<h3>Are there any other speakers you look up to?</h3>\n<p>Yes.</p>\n<ul>\n<li><a href=\"https://www.sandimetz.com\">Sandi Metz</a></li>\n<li><a href=\"https://twitter.com/anjanavakil\">Anjana Vakil</a></li>\n<li><a href=\"https://twitter.com/ieatkillerbees\">Samantha Quiñones</a></li>\n<li><a href=\"https://twitter.com/CalEvans\">Cal Evans</a></li>\n<li><a href=\"https://twitter.com/jonskeet\">Jon Skeet</a></li>\n<li><a href=\"https://twitter.com/likeOMGitsFEDAY\">Jennifer Wadella</a></li>\n<li><a href=\"http://jenna.io\">Jenna Quindica</a></li>\n<li><a href=\"https://twitter.com/xiehan\">Nara Kasbergen</a></li>\n<li><a href=\"http://docondev.com\">Doc Norton</a></li>\n<li><a href=\"https://twitter.com/eryno\">Eryn O’Neil</a></li>\n<li><a href=\"https://twitter.com/philsturgeon\">Phil Sturgeon</a></li>\n<li><a href=\"https://twitter.com/HMSEvans\">Stephanie Evans</a></li>\n<li><a href=\"https://twitter.com/matthewtrask\">Matthew Trask</a></li>\n<li><a href=\"https://twitter.com/JessicaMauerhan\">Jessica Mauerhan</a></li>\n<li><a href=\"https://twitter.com/saramg\">Sara Golemon</a></li>\n<li><a href=\"https://fsharpforfunandprofit.com\">Scott Wlaschin</a></li>\n<li><a href=\"https://twitter.com/IanColdwater\">Ian Coldwater</a></li>\n<li><a href=\"https://www.jbrains.ca\">J.B. Rainsberger</a></li>\n</ul>\n<p>These folks have all delivered amazing talks and keynotes which have impacted how I think about human, management, infosec and software engineering topics.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/VzWLGMtXflg' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Sandi Metz at RubyConf 2017</em></p>\n<h3>Where can readers find more about you?</h3>\n<ul>\n<li><a href=\"http://twitter.com/chrisholland\">Chris on Twitter</a></li>\n<li><a href=\"https://github.com/elchris/speaking\">Talks on Github</a></li>\n<li><a href=\"https://speakerdex.co/chrisholland\">Chris on Speakerdex</a></li>\n</ul>\n<hr>\n<p>If you’re a tech conference speaker, email karl@cfpland.com to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Chris Holland, Engineering Director Driven to Empower Others","path":"/blog/speakers-story-chris-holland/","category":"Speaker's Story","tags":null,"date":"2019/04/07","image":"https://i.imgur.com/eEzegV6.jpg"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}