{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"f3241422-9fa5-5dcb-a32e-17ad6bf0010e","html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Many technical leads that I’ve spoken to don’t realize how much knowledge they have that others do not. It’s easy when you\nspend every day working with caching in Ruby, for example, to forget that most devs never get the chance to do what you do.\nLike Molly, many speakers realize that their unique knowledge is worth sharing, and start getting on stage. In this interview,\nwe talked about Molly’s journey and some of her advice for new speakers.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p>I am currently the Lead Site Reliability Engineer at Kenna Security. I have been working at Kenna for almost 4 years now and I got into public speaking last year thanks to the support at Kenna.</p>\n<p>My lead at the time suggested that I find ways I could share my knowledge with others. I had become extremely proficient and knowledge about making performance improvements in our Ruby application so I started with sharing that knowledge internally and then decided to try submitting a talk on it to a conference. I submitted a proposal to RubyConf not thinking anything would come of it. Because my expectations were low I also submitted a talk to a local meetup about another technical passion of mine, Elasticsearch.</p>\n<p>Needless to say, BOTH talks were accepted and my Fall quickly became very busy. I had done debate and was good at speaking in high school, but I was not sure what to expect from technical speaking. After giving my first talk and seeing the response it got and how thankful the people were, I was hooked! It has been less than a year since that first talk and I have given 2 conference talks since, plus a few Meetup talks.</p>\n<img src=\"https://i.imgur.com/sU57xj3.jpg\" class=\"right\">\n<h3>What do you like about speaking at conferences?</h3>\n<p>I enjoy being able to share my advice with a lot of people at once. It is like mentoring or giving advice on steroids. I also really enjoy getting out of the office and getting to meet other devs. Everyone has such difference experiences and being able to chat with everyone is a great way to bring back new ideas and learn new things.</p>\n<p>It has definitely benefited my career because I have made so many amazing professional connections via speaking. All of my talks were inspired by my work, but are not required for me to do my job. The speaking and additional connections I have made have also benefited Kenna as well in the form of bringing in job candidates. Kenna has been very supportive of all the speaking and covers all of my expenses whenever I speak.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>You bet I do since it was last November! It went fabulous! For a few days after I was on a high from it.</p>\n<p>I have looked up to many speakers and the idea of me being up on the stage was almost something I couldn’t comprehend. Once I did it, I was amazed with myself and also immediately ready to do it again! My only regret was that I left my necklace on and that interfered with the mic near the end. I was worried that it might have been horrible for those listening, but no one said anything. I don’t think many people even noticed. Being a perfectionist, I definitely did. But live and learn!</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/vEi-vYcyTT8' frameborder='0' allowfullscreen></iframe></div>\n<p><em><a href=\"http://confreaks.tv/videos/rubyconf2018-cache-is-king-get-the-most-bang-for-your-buck-from-ruby\">Cache is King: Get the Most Bang for Your Buck From Ruby by Molly Struve</a></em></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I have spoken at 3 conferences and applied to probably 9, some of which are this fall so I am waiting to hear back about those. The 3 conferences I have spoked at have all been Ruby conferences which have been incredible! A couple I applied to in the Fall are Site Reliability and DevOps conferences. I am interested, if accepted, to see how they differ.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I am a big proponent of practicing my talk!</p>\n<p>I know some people who prefer not to practice and they do better when they wing it, but I am not one of those people. I like to know exactly what I am going to say when I get up there. Because of that I practice my talk a lot and I memorize my intro and ending so those are guaranteed to go smoothly. Right before I talk I like to Power Pose(<a href=\"https://www.ted.com/talks/amy_cuddy_your_body_language_shapes_who_you_are?language=en\">https://www.ted.com/talks/amy<em>cuddy</em>your<em>body</em>language<em>shapes</em>who<em>you</em>are?language=en</a>). But when I Power Pose, I do it with a twist. I recite these lines from Jr in Cool Runnings <a href=\"https://www.youtube.com/watch?v=7zFHkBQBg-4\">https://www.youtube.com/watch?v=7zFHkBQBg-4</a> All of that helps me feel really confident and bad ass before I go on.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>The best advice I have for new speakers, especially those who feel intimidated by speaking at a conference, is to start small. <strong>Begin by giving talks internally at your company first.</strong> It could be as simple as giving a demo of a feature you built. From there, consider lightening talks at a conference or even a talk at a Meetup. Once you are comfortable, then apply to a conference.</p>\n<p>If you are a new speaker that has already been accepted to give a conference talk then my best advice would be to <strong>give your talk in a smaller setting about a month before</strong>. This forces you to get the talk done early which will save you from last minute, frantic cramming. It will also allow you to get some feedback on the talk. I gave my first conference talk 3 times before RubyConf. I gave it at 2 small meetups and once for my coworkers. Every time I got great feedback that I was able to use to tweak the talk and make it more clear and approachable.</p>\n<p>Picking a topic can also be a struggle for people who want to get started, but sometimes feel they have nothing “new” to talk about. First and foremost, <strong>ANY topic is fair game even if people have talked about it before</strong>. You can always bring a new perspective to a topic.  Even presenting new examples for a topic could help someone who has heard the topic a thousand times finally understand it. My first conference talk I wrote, Cache is King, I thought for sure it was too “simple” and not “innovative” enough to ever be considered. But I quickly learned, most conference talks aren’t about discovering something new, they are about taking a topic and presenting it in a way that is approachable and helps your audience learn something.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p><a href=\"https://twitter.com/saronyitbarek\">Saron Yitbarek</a> has been HUGELY inspiration as well as <a href=\"https://twitter.com/r00k\">Ben Ornstein</a>. </p>\n<p>Right after I got accepted to speak at my first conference I watched Saron’s talk on building a community which gave me all the good feels I needed to believe I could take on this daunting task. I then watched Ben Ornstein’s talk on <a href=\"https://www.youtube.com/watch?v=l9JXH7JPjR4\">How to Give a Technical Talk</a> and that really inspired me to make my speech relatable and entertaining. My favorite quote is, “You can’t teach them anything if you don’t have their attention”</p>\n<h3>Where can readers find more about you?</h3>\n<p>I have been pretty good about keeping my personal website up to date and that is <a href=\"https://www.mollystruve.com/\">www.mollystruve.com</a>. There I have links to my Twitter, blog, Instagram, Facebook, etc. I am also very passionate about blogging so I would be remiss if I didn’t include a link directly to my blog, <a href=\"https://dev.to/molly_struve\">dev.to/mollystruve</a>.</p>\n<p>I am a big fan of taking a talk and breaking it down into blog posts so it can reach more people. The opposite works as well, I have used some of my blogs to drive some talk ideas.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Molly Struve, Site Reliability Engineer and Technical Speaker","path":"/blog/speaker-molly-struve/","category":"Speaker's Story","tags":null,"date":"2019/08/02","image":"https://i.imgur.com/sU57xj3.jpg"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}