{"data":{"remark":{"posts":[{"post":{"html":"<p>While running CFP Land I’ve had the opportunity to <a href=\"/blog/\">meet with and learn from dozens of speakers around the world</a>. The community has been amazingly welcoming and helpful, so I wanted to give some of this knowledge back by releasing a comprehensive guide to speaking at technology conferences.</p>\n<p>Because everyone reading this will start at a different level of speaking experience, you can either jump straight to the section you find most relevant using the Table of Contents below or read all the sections sequentially by looking for the “Next” link at the bottom of each page.</p>\n<!--more-->\n<h2>Table of Contents</h2>\n<ol>\n<li><strong><a href=\"./introduction/\">An Introduction to Technology Conferences</a></strong> - This section looks at some of the dimensions you might use to compare technology conferences as well as reasons for attending them.</li>\n<li><strong><a href=\"./why-speak/\">Why Speak? 11 Reasons People Get on Stage</a></strong> - In this section, I’ve collected the most common reasons people cite for wanting to speak at conferences, so if you’re on the fence, this might help motivate you.</li>\n<li><strong><a href=\"./how-conferences-choose/\">How Conferences Choose Speakers</a></strong> - A look at the different methods for selecting speakers as well as some factors that make some speakers more successful than others.</li>\n<li><strong><a href=\"./finding-cfps/\">Finding and Selecting CFPs (“Calls for Proposals”)</a></strong> - This section looks at various methods for finding and selecting conferences to speak at.</li>\n<li><strong><a href=\"./submitting/\">Submitting Abstracts</a></strong> - Writing and submitting an abstract for a conference is a skill that can take years to master. Here are tips from dozens of experienced speakers about what works.</li>\n<li><strong><a href=\"./success-rejection/\">What Comes Next? Dealing with Success or Rejection</a></strong> - A collection of some of the reasons your talk might be rejected, what to do when you do get a talk accepted, and how to respectfully decline giving a talk when you can no longer commit to it.</li>\n<li><strong><a href=\"./presentation/\">Preparing a Presentation</a></strong> - Common presentation formats, tools, and advice from technology conference speakers from around the world.</li>\n<li><strong><a href=\"./pre-conference/\">Preparing for the Conference</a></strong> - Know what to expect on the big day! Logistical details and conference-day tips conclude the guide.</li>\n</ol>\n<div class=\"card bg-info-light mb-3\">\n<div class=\"card-body\">\n  <h5 class=\"card-title\">\n    <strong>Never miss a speaking opportunity again.</strong><br/>\n    Subscribe to get upcoming CFPs and new advice in your inbox every week!\n  </h5>\n  <form\n    class=\"row\"\n    action=\"https://cfpland.us15.list-manage.com/subscribe/post?u=4eba8b205fc13380cd3e6f3fc&amp;id=258f553f4e\"\n    method=\"post\"\n  >\n    <div class=\"col-sm-12 col-md-8\">\n      <input\n        name=\"EMAIL\"\n        type=\"email\"\n        class=\"form-control mb-2\"\n        id=\"emailInput\"\n        aria-label=\"Enter email to get CFPs in your inbox every week\"\n        placeholder=\"Enter email\"\n        required\n      />\n    </div>\n    <div class=\"col-sm-12 col-md-3\">\n      <button type=\"submit\" class=\"btn btn-secondary btn-block mb-2\">\n        Sign Up\n      </button>\n    </div>\n  </form>\n</div>\n</div>\n<h2>About This Guide</h2>\n<p>Whether you’re preparing for your first speaking engagement, speaking at your 100th event, or not sure how to even get started, this guide will get you on the right track. <strong>I’ve compiled advice from over 30 interviews I’ve done with conference speakers, dozens of blog posts I read, and my own experience as a speaker to create this comprehensive guide to speaking at technology conferences.</strong></p>\n<p>As you read through these chapters, you may have your own ideas or resources to suggest. That’s great! I’d love to continue refining and building this guide with help from the community. Just <a href=\"mailto:info@cfpland.com\">shoot me an email</a> with the tips you’d like to add, and I’ll keep updating this resource.</p>\n<p>Also, be sure to check out the <a href=\"/conferences/\">dozens of open CFPs listed on CFP Land right now</a>. If you don’t want to miss any in the future, be sure to also sign up for our mailing list below.</p>\n<p><a class=\"text-right d-block\" href=\"./introduction/\">Next: An Introduction to Technology Conferences</a></p>","frontmatter":{"layout":"post","title":"The Comprehensive Guide to Speaking at Technology Conferences in 2020","path":"/guides/speaking/","category":"Guides","tags":null,"date":null,"image":"https://i.imgur.com/SvwcdNz.jpg"}}},{"post":{"html":"<p>Once you’re very well established as a technology conference speaker, you might start getting invited to speak, but for most speakers, this takes a long time if it happens at all. The reality is that conferences typically get many more speakers interested than they have slots, so they almost always hold an open <a href=\"../how-conferences-choose/\">Call for Proposals or “CFP”</a>.</p>\n<p>Before you can submit any CFPs though, you’ll need to find them. In this section, we’ll look at various methods for finding conferences with open calls for proposals and selecting those that are worth your time.</p>\n<!--more-->\n<p><em>This post is part of an 8-part guide to speaking at technology conferences. Be sure to <a href=\"../\">check out the other sections listed here</a>.</em></p>\n<p><img src=\"https://i.imgur.com/mbfsQRT.jpg\"></p>\n<div class=\"card bg-info-light mb-3\">\n<div class=\"card-body\">\n  <h5 class=\"card-title\">\n    <strong>Never miss a speaking opportunity again.</strong><br/>\n    Subscribe to get upcoming CFPs and new advice in your inbox every week!\n  </h5>\n  <form\n    class=\"row\"\n    action=\"https://cfpland.us15.list-manage.com/subscribe/post?u=4eba8b205fc13380cd3e6f3fc&amp;id=258f553f4e\"\n    method=\"post\"\n  >\n    <div class=\"col-sm-12 col-md-8\">\n      <input\n        name=\"EMAIL\"\n        type=\"email\"\n        class=\"form-control mb-2\"\n        id=\"emailInput\"\n        aria-label=\"Enter email to get CFPs in your inbox every week\"\n        placeholder=\"Enter email\"\n        required\n      />\n    </div>\n    <div class=\"col-sm-12 col-md-3\">\n      <button type=\"submit\" class=\"btn btn-secondary btn-block mb-2\">\n        Sign Up\n      </button>\n    </div>\n  </form>\n</div>\n</div>\n<h2>Finding CFPs</h2>\n<blockquote>\n<p>“It is better to submit to many conferences that you think would benefit from your talk than it is to be fixated on any particular conference (which puts all of your hopes and dreams on a single CFP).”\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-jaime-lopez-jr/\">Jaime Lopez</a></em></p>\n</blockquote>\n<p>There are several ways that you can find out about CFPs:</p>\n<h3>1. Contact the Conference Directly</h3>\n<p>If you are focused on just a few specific conferences, you could reach out directly to each of them to express your interest in submitting. Many conferences start planning 6 months before the event, so they might be looking for CFPs early. That said, some organizers may not start working until 3 months before the event, or they might not have time to answer every email individually. In this case, you’ll end up spending a lot of time chasing them.</p>\n<p>In most cases, it’s unnecessary to ask a conference directly when their CFP will open as they’ll probably post something about it on their website. But, it’s worth mentioning because some conferences never hold an open CFP, so you have to reach out directly.</p>\n<h3>2. Subscribe to the Conference’s Website or Newsletter</h3>\n<p>Assuming the conference holds an open CFP, they’re likely to tell as many people as they can about it in their blog or newsletter. If you’re targeting a few specific conferences, this might be the best way to ensure you don’t miss their CFPs. Be careful counting on conference newsletters too much though. Some organizers are not very good at sending them, and they may forget to publicize their CFP that way.</p>\n<p>It will be annoying to check every conference website you’re interested in submitting to every few weeks, but it may be the only way to ensure you don’t miss a certain CFP.</p>\n<h3>3. Social Media</h3>\n<p>Twitter is probably the most popular social network for technology conferences and speakers, so you may want to start following people there. Following individual conferences will get you started, but there are a number of good accounts that tweet out about open CFPs. You can also save a few Twitter searches to accomplish this goal.</p>\n<blockquote>\n<p>Another way to find conferences that’s worked for me is to literally search “tech cfp” on Twitter\n<em><a href=\"https://www.cfpland.com/blog/speaker-taelur-alexis/\">Tae’lur Alexis</a></em></p>\n</blockquote>\n<h3>4. Use a CFP Aggregator</h3>\n<p>I’m biased towards this one - <a href=\"https://www.cfpland.com/blog/how-cfpland-came-to-be/\">that’s why I started CFP Land</a> - but it’s also the most convenient method if you want to apply to speak at a lot of conferences. <a href=\"https://www.cfpland.com/\">CFP Land</a>, <a href=\"https://confs.tech/\">Confs.tech</a>, and <a href=\"https://callingallpapers.com/\">CallingAllPapers</a> are the most comprehensive CFP aggregators, but there are other niche topic aggregators as well. At CFP Land, we add the perks that speakers can expect from the conference, but you could also look that information up yourself on each conference’s website.</p>\n<blockquote>\n<p>“I love that CFP Land lists which “perks” each conference offers (travel/hotel/stipend), if any. It means I don’t have to get all the way to have my paper accepted just to realize that I’m expected to fork over a couple of grand for the privilege of presenting.”\n<em><a href=\"https://www.cfpland.com/blog/speakers-bailey-lewis/\">Bailey Lewis</a></em></p>\n</blockquote>\n<p>All of these aggregators have a list of open CFPs and some of them offer a newsletter or email alerts as well. The biggest downside to a CFP aggregator is that you’re bound to miss some conferences that they aren’t aware of. I’ve collected over 1200 conference CFPs in the past two years, but every month subscribers submit dozens of new ones that I didn’t know existed.</p>\n<div class=\"card bg-info-light mb-3\">\n<div class=\"card-body\">\n  <h5 class=\"card-title\">\n    <strong>Never miss a speaking opportunity again.</strong><br/>\n    Subscribe to the CFP Land newsletter to get new CFPs delivered to your inbox every week!\n  </h5>\n  <form\n    class=\"row\"\n    action=\"https://cfpland.us15.list-manage.com/subscribe/post?u=4eba8b205fc13380cd3e6f3fc&amp;id=258f553f4e\"\n    method=\"post\"\n  >\n    <div class=\"col-sm-12 col-md-8\">\n      <input\n        name=\"EMAIL\"\n        type=\"email\"\n        class=\"form-control mb-2\"\n        id=\"emailInput\"\n        aria-label=\"Enter email to get CFPs in your inbox every week\"\n        placeholder=\"Enter email\"\n        required\n      />\n    </div>\n    <div class=\"col-sm-12 col-md-3\">\n      <button type=\"submit\" class=\"btn btn-secondary btn-block mb-2\">\n        Sign Up\n      </button>\n    </div>\n  </form>\n</div>\n</div>\n<h2>Deciding Which CFPs to Submit to</h2>\n<p>As you start learning more about the wide array of conferences out there, you’ll discover that there are likely more open CFPs than you have time to submit to. Every speaker must decide which conferences are worth their time, so while you may not be as picky when you’re just getting started, it’s certainly worth considering the following criteria with each CFP.</p>\n<h3>1. Topic Area</h3>\n<img src=\"https://i.imgur.com/n827vdA.jpg\" class=\"right\">\n<p>You don’t have to have a complete talk ready before you start submitting abstracts to open Calls for Proposals, but you should have some idea of what kind of topics you want to speak about. While conferences will usually look for a range of talks, you are never going to get a Ruby talk accepted to a Python conference. Plus, as Nick points out, that Python conference may not be interesting to you anyway:</p>\n<blockquote>\n<p>“Maybe you can get your talk on web accessibility accepted at DjangoCon, but if you aren’t interested in Python, then the rest of the conference will be of minimal value to you.”\n<em><a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">Nick Heiner</a></em></p>\n</blockquote>\n<p>Most conferences will provide information about the topics and kinds of talks they want on the CFP page, but if they don’t take a look at videos or listings of the previous year’s talks. This should give you some idea what they are looking for.</p>\n<h3>2. Location</h3>\n<p>One of the first conferences I spoke at was Codemash, and while I loved the event, traveling to Sandusky, Ohio in January is not always pleasant. As you look for conferences, you may want to prioritize those in locations that would be fun to visit or where you have friends or coworkers.</p>\n<p>I’ve actually spoken at some conferences that did not pay for my hotel because I had a friend in town I could stay with anyway. This makes it easier for the conference to support you financially, plus I got to hang out with an old college friend who lives on the other side of the country.</p>\n<h3>3. Financial Viability</h3>\n<p>Getting accepted to speak at a conference in Thailand may sound great, but if they don’t cover your flight costs, you might be paying several thousand dollars just to get there. Most conferences will list the speaker perks they offer on their website, but if not, you can email the organizers directly to ask. In my experience, about 30% of tech conferences cover travel and hotel costs for their speakers, and about 1% offer an extra stipend.</p>\n<p>Another way to fund your speaking excursion might be to turn to your employer. Some companies offer an education budget to employees and attending a conference - even as a speaker - is certainly an educational experience. You could also make the argument that you’ll help your employer raise awareness of their product or any open job listings while you’re there. It may or may not work, but it’s worth trying.</p>\n<p>Finally, many conferences offer other perks to speakers - whether they can cover travel or not. For example, I’ve seen conferences offer:</p>\n<ul>\n<li>Free speaker training sessions</li>\n<li>Airport transportation</li>\n<li>Speaker’s dinner</li>\n<li>Gift bags or cards for speakers</li>\n</ul>\n<p>All these add-ons may help make speaking more financially viable, but to be honest, most new speakers will not get paid much for their speaking directly.</p>\n<h3>4. Reputation</h3>\n<blockquote>\n<p>Not all conferences are born equal: whether you like it or not, there’s a “coolness” factor attached to each of them.\n<em><a href=\"https://blog.frankel.ch/advices-junior-conference-speakers/\">Nicolas Fränkel</a></em></p>\n</blockquote>\n<p>Whether you call it “coolness” or “reputation” or “prestige”, it’s true that not all conferences hold the same weight. Smaller, regional conferences are more like a big meetup, so speaking there may not be that difficult. On the other hand, some huge tech events are extremely competitive and aim to only accept world-class speakers. Either way, there’s no harm in applying to speak at a conference that you feel is “above your pay grade.” The only way to move up is to go for it!</p>\n<blockquote>\n<p>“I recommend looking at videos from prior years and looking at the conference website, to see if it appears to be the work of conscientious, detail-oriented, experienced people.”\n<em><a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">Nick Heiner</a></em></p>\n</blockquote>\n<p>While you may start by applying at smaller, newer conferences, it is a good idea to look into how the conference has been run in the past. Do they treat their speakers and attendees well? Are the organizers well-known? Do they have a good reputation? Ask around if you don’t know anyone who’s been to the event personally.</p>\n<p>Finally, consider whether or not you want to take a risk by speaking at a first time conference. I have had good and bad experiences with new events: one had to cancel the event due to lack of interest, and the other was an awesome conference run by very professional and experienced people. Talk to the organizers and do what you can to understand their vision for the event.</p>\n<h3>5. Commitment to Diversity</h3>\n<p><img src=\"https://i.imgur.com/5ezcedx.jpg\"></p>\n<p>Last but certainly not least, you should know whether the event has a commitment to diversity and will provide a welcoming environment for all attendees and speakers. You don’t want to be attached to an event that gets bad press for excluding people or allowing hostile behavior. Look for a code of conduct, ask the organizers about this, and take a look at their speaker lineup from previous years. I - like many speakers - believe that <a href=\"https://www.karllhughes.com/posts/diversity-in-conference-speakers\">conferences should choose speakers that reflect the diversity of the communities they hope to serve</a>.</p>\n<p>Once you start to find conferences that would be a good fit for you, it’s time to write and submit your first abstract. The next section outlines some tips from experienced speakers and conference organizers about how to get your abstract accepted.</p>\n<p><a class=\"text-left d-block\" href=\"../how-conferences-choose/\">Previous: How Conferences Choose Their Speakers</a>\n<a class=\"text-right d-block\" href=\"../submitting/\">Next: Submitting Abstracts</a></p>","frontmatter":{"layout":"post","title":"Finding and Selecting CFPs","path":"/guides/speaking/finding-cfps/","category":"Guides","tags":null,"date":null,"image":"https://drive.google.com/uc?id=13idRXpK-5svs-Lp_c5-cYWFPKsahVyWU"}}},{"post":{"html":"<p>Hundreds of technology conferences take place around the world every year. We catalog <a href=\"/blog/data\">over 400 per year at CFP Land</a>, but there are even more that we don’t find. If you’re new to the field, you might be surprised that there could be that many events, but as this post elaborates, no two tech conferences are alike. These conferences range in size, topic focus, cost, and competitiveness for speakers.</p>\n<!--more-->\n<p><em>This post is part of an 8-part guide to speaking at technology conferences. Be sure to <a href=\"../\">check out the other sections listed here</a>.</em></p>\n<div class=\"card bg-info-light mb-3\">\n<div class=\"card-body\">\n  <h5 class=\"card-title\">\n    <strong>Never miss a speaking opportunity again.</strong><br/>\n    Subscribe to get upcoming CFPs and new advice in your inbox every week!\n  </h5>\n  <form\n    class=\"row\"\n    action=\"https://cfpland.us15.list-manage.com/subscribe/post?u=4eba8b205fc13380cd3e6f3fc&amp;id=258f553f4e\"\n    method=\"post\"\n  >\n    <div class=\"col-sm-12 col-md-8\">\n      <input\n        name=\"EMAIL\"\n        type=\"email\"\n        class=\"form-control mb-2\"\n        id=\"emailInput\"\n        aria-label=\"Enter email to get CFPs in your inbox every week\"\n        placeholder=\"Enter email\"\n        required\n      />\n    </div>\n    <div class=\"col-sm-12 col-md-3\">\n      <button type=\"submit\" class=\"btn btn-secondary btn-block mb-2\">\n        Sign Up\n      </button>\n    </div>\n  </form>\n</div>\n</div>\n<h2>How Do Conferences Differ?</h2>\n<p>Let’s take a look at a few of the dimensions you might use to compare technology conferences:</p>\n<h3>1. Breadth and Depth</h3>\n<p>If you’re in a narrow specialty, you may not have the opportunity to meet with many similar professionals in your city often. Some conferences cater to these narrow “niches” and go really deep into a single area of focus.</p>\n<p>Conversely, there are some tech conferences that cover a huge range of technologies and disciplines. These usually last longer and have multiple “tracks” so attendees can choose the talks they are most interested in.</p>\n<h3>2. Tracks</h3>\n<p>“Tracks” are the way most conferences divide up talks by specialty or area of interest. Some tech conferences may have a track for design, another for development, and a third for product managers. Usually, these individual tracks are capped off with one or two keynotes that have broad appeal to most attendees.</p>\n<blockquote>\n<p>Single-track conferences can be nice because you’re guaranteed the maximum audience size. However, it also means that there may be people in the audience who don’t care about your talk. With a multi-track conference, the people who do attend your talk will be more interested in what you have to say. But this also brings anxiety or disappointment when not as many people choose your talk as you’d like, and you have to give your talk to an awkwardly small crowd.\n<em><a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">Nick Heiner</a></em></p>\n</blockquote>\n<p><img src=\"https://i.imgur.com/4ho1VrO.jpg\"></p>\n<h3>3. Attendees</h3>\n<p>Some niche, regional conferences may attract fewer than 100 attendees. I’ve been to a couple where you didn’t really even need a microphone to reach the whole audience. On the opposite end of the spectrum, there are some tech conferences with thousands of attendees who swarm on massive convention centers for days at a time.</p>\n<p>The smaller ones can be nice if you really want to form close relationships with a few people, but sometimes it’s nice to slip into anonymity at a huge conference and not have to see the same 5 people all the time.</p>\n<h3>4. Frequency</h3>\n<p>The majority of tech conferences happen annually, but there are some with bi-annual cadences. Usually, these will hold one event in America and the other in Europe to allow attendees on both hemispheres the opportunity to attend.</p>\n<h3>5. Location</h3>\n<p>Conferences don’t necessarily happen in big cities, but it is more common. If people are traveling to attend, it’s usually easier to host the event in a large, central location. That said, there are some conferences that happen in unique venues: a <a href=\"https://www.codercruise.com/\">cruise ship</a>, an <a href=\"https://www.atechconference.com/\">island</a>, or <a href=\"https://nomadphp.com/\">online</a>.</p>\n<h3>6. Corporate vs. Community-Run</h3>\n<p>A few large tech companies run their own conferences with the goal of promoting their technology and building a community of users. For example, <a href=\"https://www.microsoft.com/en-us/ignite\">Microsoft’s Ignite</a> and <a href=\"https://reinvent.awsevents.com/\">Amazon’s re:Invent</a>. Just because these conferences have a clear agenda doesn’t mean the content isn’t valuable though. Many of us rely on keeping up with the latest technology that these companies release.</p>\n<p>Community-run conferences sit at the other end of the spectrum. These events are managed by fans or advocates for a particular language, technology, or project, and are often much lower-budget. Some rely on donations, some partner with sponsors, and others charge attendees.</p>\n<blockquote>\n<p>Some conferences are for-profit. Others make little to no money for the organizers, and are largely a labor of love for the community. Some for-profit conferences will masquerade as the latter. Make sure you know what the conference is and if you’re comfortable with it before you accept.\n<em><a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">Nick Heiner</a></em></p>\n</blockquote>\n<p>Running a conference is notoriously challenging and expensive. Organizers have to coordinate a lot of details; pay for food, event space, speakers, and staff; find sponsors; sell tickets…the list goes on! If you’re interested in how this all shakes out, <a href=\"https://2019.jsconf.eu/news/the-jsconf-cssconf-eu-finances/\">JS Conf Europe’s organizers wrote an interesting overview of their finances last year</a>.</p>\n<div class=\"card bg-info-light mb-3\">\n<div class=\"card-body\">\n  <h5 class=\"card-title\">\n    <strong>Like this guide?</strong><br/>\n    Subscribe to get advice, interviews with conference speakers, and new speaking opportunities in your inbox every week!\n  </h5>\n  <form\n    class=\"row\"\n    action=\"https://cfpland.us15.list-manage.com/subscribe/post?u=4eba8b205fc13380cd3e6f3fc&amp;id=258f553f4e\"\n    method=\"post\"\n  >\n    <div class=\"col-sm-12 col-md-8\">\n      <input\n        name=\"EMAIL\"\n        type=\"email\"\n        class=\"form-control mb-2\"\n        id=\"emailInput\"\n        aria-label=\"Enter email to get CFPs in your inbox every week\"\n        placeholder=\"Enter email\"\n        required\n      />\n    </div>\n    <div class=\"col-sm-12 col-md-3\">\n      <button type=\"submit\" class=\"btn btn-secondary btn-block mb-2\">\n        Sign Up\n      </button>\n    </div>\n  </form>\n</div>\n</div>\n<h2>Why Attend?</h2>\n<p>Plenty of experienced technology professionals never go to or speak at a conference. They can be expensive, take away time from focused work, and awkward - especially if you don’t know anyone there. That said, there are some great reasons to try attending a tech conference sometime:</p>\n<h3>1. Learn New Skills</h3>\n<p>The tools available to technology professionals is changing rapidly, and it can be hard to keep up. Newsletters, blogs, and local user groups are all a great place to turn, but so are conferences.</p>\n<blockquote>\n<p>Conferences are a prime place for learning about new or obscure libraries and packages that you haven’t used before. If it’s been done before, then someone somewhere will eventually give a talk about it.\n<em><a href=\"https://opensource.com/life/16/2/attending-technical-conferences-whats-big-deal\">Deb Nicholson</a></em></p>\n</blockquote>\n<h3>2. Meet New People</h3>\n<p>While attending talks is an obvious way to learn new things at a conference, you may also pick up some new ideas from your fellow attendees. Meeting people at conferences is also a great way to find a job or look for job candidates.</p>\n<blockquote>\n<p>I like meeting like-minded people with the profession in common…I like the positive energy conferences have and regardless of where you work or the number of years of experience one has all of the participants are there to learn and share the experience.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-geshan-manandhar/\">Geshan Manandhar</a></em></p>\n</blockquote>\n<h3>3. Be Inspired</h3>\n<p>Great speakers can motivate you; ignite your passions; inspire you to do something you wouldn’t have. Not every tech conference has room for a ton of inspirational talks, but many conferences try to include some of these in their keynote slots.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/dYlT4lU5pb4' frameborder='0' allowfullscreen></iframe></div>\n<p><em>“A Tinker Story” by dina Amin</em></p>\n<h3>4. Have Fun</h3>\n<p>Finally, attending a tech conference can be really fun. Last time I went to <a href=\"https://www.codemash.org/\">Codemash</a>, I got to visit the NASA facilities in Sandusky, Ohio, see the indoor water park, and play virtual reality video games in the arcade for hours after the talks ended.</p>\n<p>If you think attending a tech conference is a great experience, keep reading! Next, we’ll learn why you might want to move from the audience to the stage and start speaking at tech conferences too.</p>\n<p><a class=\"text-left d-block\" href=\"../\">Previous: Index</a>\n<a class=\"text-right d-block\" href=\"../why-speak/\">Next: Why Speak? The Reasons People Get on Stage</a></p>","frontmatter":{"layout":"post","title":"An Introduction to Technology Conferences","path":"/guides/speaking/introduction/","category":"Guides","tags":null,"date":null,"image":"https://drive.google.com/uc?id=1Q-5hni9-WpjpQgQq-8oBi3FmnWp9TzYq"}}},{"post":{"html":"<p>Most technology conference attendees never dream of speaking at an event, so they probably don’t even realize what goes into the speaker selection process. In this section, we’ll take a look at common forms of the “CFP” (Call for Proposals) process, and some of the factors that make technology conference speakers stand out.</p>\n<!--more-->\n<p><em>This post is part of an 8-part guide to speaking at technology conferences. Be sure to <a href=\"../\">check out the other sections listed here</a>.</em></p>\n<p><img src=\"https://i.imgur.com/scKOuP1.jpg\"></p>\n<div class=\"card bg-info-light mb-3\">\n<div class=\"card-body\">\n  <h5 class=\"card-title\">\n    <strong>Never miss a speaking opportunity again.</strong><br/>\n    Subscribe to get upcoming CFPs and new advice in your inbox every week!\n  </h5>\n  <form\n    class=\"row\"\n    action=\"https://cfpland.us15.list-manage.com/subscribe/post?u=4eba8b205fc13380cd3e6f3fc&amp;id=258f553f4e\"\n    method=\"post\"\n  >\n    <div class=\"col-sm-12 col-md-8\">\n      <input\n        name=\"EMAIL\"\n        type=\"email\"\n        class=\"form-control mb-2\"\n        id=\"emailInput\"\n        aria-label=\"Enter email to get CFPs in your inbox every week\"\n        placeholder=\"Enter email\"\n        required\n      />\n    </div>\n    <div class=\"col-sm-12 col-md-3\">\n      <button type=\"submit\" class=\"btn btn-secondary btn-block mb-2\">\n        Sign Up\n      </button>\n    </div>\n  </form>\n</div>\n</div>\n<h2>The Call for Proposals Process</h2>\n<blockquote>\n<p>I wish I had realized sooner that you don’t always have to be personally invited to speak at events. Now that I’m aware of the CFP process, I’m speaking regularly at conferences across the country.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-laura-janusek/\">Laura Janusek</a></em></p>\n</blockquote>\n<p>While there is variability in how an event decides on which speakers they will invite, most technology conferences offer some form of public Call for Proposals (“CFP”). When conference organizers start planning their event, they usually choose a date, and soon after, they will open up a CFP. The CFP may be managed on a platform like <a href=\"https://sessionize.com/\">Sessionize</a> or <a href=\"https://www.papercall.io/\">PaperCall</a> and promoted through channels like <a href=\"https://www.cfpland.com\">CFP Land</a>.</p>\n<p><em>More tips for finding CFPs are available in <a href=\"../finding-cfps/\">Section 4: Finding and Selecting CFPs</a>.</em></p>\n<p>In addition to accepting public submissions, many conferences will invite specific speakers - especially those they’ve identified as possible keynote speakers. It takes a while to get recognized as a possible keynote speaker, and by that point, you’ll likely have met many of the conference organizers already. So, most speakers start by submitting their talk proposals to open CFPs.</p>\n<p>Because most conferences get hundreds of submissions, they use an orderly process to evaluate and select talks. I’ve heard of conferences using one or more of the following methods, but others may also exist:</p>\n<h3>1. Rolling Review</h3>\n<p>Some conferences start reviewing submissions as soon as they come in. This helps the reviewers keep from getting overwhelmed by evaluating hundreds of submissions all at once, but it means that the conference may not have enough spots for late submissions. Sometimes conferences will advertise that they evaluate submissions on a rolling basis, but many do not, so if you’re really serious you might want to email the organizers to ask.</p>\n<p>In the case of rolling reviews, it pays to submit your abstract or proposal early.</p>\n<h3>2. Public Voting</h3>\n<p>Other conferences open up all submissions to public opinion. I’ve usually seen this in the form of an open voting period, so speakers are expected to help promote their session. The upside to the conference is that they build community awareness for the event, and have an easier time selecting talks. The downside is that voters may or may not actually attend the conference, and they may not select a diverse range of topics or speakers. Usually, the conference organizers will mix open voting with some personal selections to ensure a good balance.</p>\n<h3>3. Post-Deadline Review</h3>\n<p>The majority of conference organizers I’ve spoken to wait until all submissions are turned in and the deadline has passed before reviewing them. While this creates a huge backlog of abstracts to review, it allows the organizers to ensure a good mix of talks and not give any preference to early submissions. In this case, submitting early won’t help you, but you really need to work hard to make your proposal stand out.</p>\n<h2>Notifying and Confirming Speakers</h2>\n<p>Sometime after the review process ends (or during it in the case of rolling review), the conference organizers will reach out individually to each speaker they’ve selected. Because speakers often apply months before they hear back, the organizers want to confirm that the speaker is still interested and available. If not, they may invite another speaker to replace them.</p>\n<p>This is the reason that conferences are typically very slow to send rejection emails - if they send them at all. But it also means that even if a conference starts to announce speakers, they aren’t necessarily done with the selection process. You may still have hope!</p>\n<p><em>More on handling success and rejection is available in <a href=\"../success-rejection/\">Section 6: Dealing with Success or Rejection</a>.</em></p>\n<div class=\"card bg-info-light mb-3\">\n<div class=\"card-body\">\n  <h5 class=\"card-title\">\n    <strong>Like this guide?</strong><br/>\n    Subscribe to get advice, interviews with conference speakers, and new speaking opportunities in your inbox every week!\n  </h5>\n  <form\n    class=\"row\"\n    action=\"https://cfpland.us15.list-manage.com/subscribe/post?u=4eba8b205fc13380cd3e6f3fc&amp;id=258f553f4e\"\n    method=\"post\"\n  >\n    <div class=\"col-sm-12 col-md-8\">\n      <input\n        name=\"EMAIL\"\n        type=\"email\"\n        class=\"form-control mb-2\"\n        id=\"emailInput\"\n        aria-label=\"Enter email to get CFPs in your inbox every week\"\n        placeholder=\"Enter email\"\n        required\n      />\n    </div>\n    <div class=\"col-sm-12 col-md-3\">\n      <button type=\"submit\" class=\"btn btn-secondary btn-block mb-2\">\n        Sign Up\n      </button>\n    </div>\n  </form>\n</div>\n</div>\n<h2>Why Do Speakers Get Chosen?</h2>\n<p>Assuming the conference is not using public voting to select speakers, it’s almost impossible to predict exactly what will stand out to a conference organizing committee. Each one is different, and each conference has different stated (and unstated) objectives. It certainly helps if you have been to the conference before (or have seen the sessions they selected in the past), but even then, things can change.</p>\n<p>While there are many factors involved, technology conference speakers are usually chosen based on some combination of the following criteria:</p>\n<h3>1. Great Topic and Abstract</h3>\n<p>Writing a great conference proposal (or abstract) is an art. It takes a mix of skills - writing, storytelling, and creativity among them - but a great abstract for one conference won’t necessarily work at another. The most successful speakers submit multiple abstracts and tailor each to the conference they’re targeting.</p>\n<p><em>Much more on writing and submitting a successful abstract is available in <a href=\"../submitting/\">Section 5: Submitting Abstracts</a>.</em></p>\n<h3>2. A Good Blend of Topics</h3>\n<p>Most conferences want a mix of sessions because attendees are often looking for different things. Some want to be inspired by the big-picture sessions and keynotes; others want to learn specific niche technologies from experts; others are just curious, and want to know what’s trending.</p>\n<blockquote>\n<p>Having big-picture sessions can make for a very generic program. As such, a limited number of big-picture presentations tend to get picked with a larger number of more specialist topics.\n<em><a href=\"https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/\">Jono Bacon</a></em></p>\n</blockquote>\n<p>Experienced organizers usually shoot for a good blend so they can maximize the value to attendees.</p>\n<h3>3. Speaker Reputation</h3>\n<p><img src=\"https://i.imgur.com/0F3l9Qh.jpg\"></p>\n<blockquote>\n<p>Famous speakers will tend to attract money, in the form of more/better sponsors and more attendees.\n<em><a href=\"https://blog.frankel.ch/advices-junior-conference-speakers/\">Nicolas Fränkel</a></em></p>\n</blockquote>\n<p>Developing a reputation as a speaker takes time, but once you’ve done it, organizers will likely give you a leg up over new speakers. It’s not fair, but it makes some sense - there’s always a risk that a first-time speaker will get too nervous and flake out before the event - plus widely known speakers may actually draw an audience on their own.</p>\n<blockquote>\n<p>“The biggest conferences may have selection processes that favor experienced speakers, since they don’t want to risk a 50-minute time slot on an unknown quantity.”\n<em><a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">Nick Heiner</a></em></p>\n</blockquote>\n<p>At the same time, conference organizers are annoyed by overly self-promoting talks too. Speakers who can’t stop talking about themselves will gain a negative reputation that’s just as hard to overcome.</p>\n<blockquote>\n<p>“Program committees often don’t want ego-ridden sessions, not just because they are annoying, but also because they often become advertising carousels for the speaker’s books, videos, events, and other material they are schlepping.”\n<em><a href=\"https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/\">Jono Bacon</a></em></p>\n</blockquote>\n<h3>4. Speaker Qualifications</h3>\n<p>Just because a speaker is new does not mean that they don’t know what they’re talking about. I’ve met a lot of speakers with 20+ years of experience in their field, so it’s pretty safe to say they’re qualified to give a talk - even if they haven’t before. That said, even qualified speakers need to show the organizers that they’re qualified in some way, so writing blog posts, books, or courses can be a good way to demonstrate your knowledge even before you start speaking.</p>\n<blockquote>\n<p>“Why should I listen to them? Are they an amazing speaker and will give a great performance? Are they an expert in a field that they can speak authoritatively on? Do they have some unique experience that makes their content special or different?…Did you win “best comedic presentation” at your local toastmasters? Were you in every theatre play and musical production in school? Did you write an open-source tool or library that deals heavily with the topics involved? Have you spoken before?\n<em><a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">Richard Schneeman</a></em></p>\n</blockquote>\n<h3>5. Diversity of Speakers</h3>\n<blockquote>\n<p>There are many that simply won’t see what’s in front of their eyes. They are completely unaware of how unwelcoming many technical events are for those with diverse backgrounds. There is a reason it is like it is.\n<em><a href=\"https://twitter.com/DBAKevlar/status/1166767440547549184\">Kellyn Command Line</a></em></p>\n</blockquote>\n<p>Speaker diversity comes in many forms, but some examples are:</p>\n<ul>\n<li>Training and education</li>\n<li>Race and ethnicity</li>\n<li>Gender</li>\n<li>Sexual orientation</li>\n<li>Socioeconomic background</li>\n<li>Company and team size</li>\n</ul>\n<p>While some organizers ignore speaker diversity, it is <a href=\"https://www.karllhughes.com/posts/diversity-in-conference-speakers\">becoming a bigger issue for many conferences and speakers</a>.</p>\n<h3>6. Cost of Transportation and Hotel</h3>\n<p>If the conference offers perks like free travel and hotel for speakers, they often must consider this cost when selecting speakers. In other words, even if your abstract is great, some small conferences won’t be able to fly you halfway across the world just to speak. You can get around this limitation if you (or your employer) are willing to cover the cost, so be sure to mention that in your application.</p>\n<h3>7. Event Sponsorship</h3>\n<p>Finally, some technology conferences give dedicated speaking slots to sponsors. If you work in developer relations or you’re hiring a lot of people, your employer may be willing to sponsor some events in exchange for some stage time.</p>\n<p>Now that you’re familiar with how conferences choose speakers, it’s time to find some open calls for proposals (CFPs). The next section covers this in-depth as well as some of the ways you can ensure the event you’re applying to is worth your time.</p>\n<p><a class=\"text-left d-block\" href=\"../why-speak/\">Previous: Why Speak? 11 Reasons People Get on Stage</a>\n<a class=\"text-right d-block\" href=\"../finding-cfps/\">Next: Finding and Selecting CFPs</a></p>","frontmatter":{"layout":"post","title":"How Conferences Choose Their Speakers","path":"/guides/speaking/how-conferences-choose/","category":"Guides","tags":null,"date":null,"image":"https://drive.google.com/uc?id=13idRXpK-5svs-Lp_c5-cYWFPKsahVyWU"}}},{"post":{"html":"<p>If you’re considering submitting a conference talk, but you’re not sure if it’s worth it, read on. In this section, I’ve collected the most common reasons people cite for wanting to speak at conferences. Even experienced speakers are constantly finding new reasons to take the stage, so maybe you’ll find a new reason to <a href=\"/conferences/\">apply to speak at more conferences</a>.</p>\n<!--more-->\n<p><em>This post is part of an 8-part guide to speaking at technology conferences. Be sure to <a href=\"../\">check out the other sections listed here</a>.</em></p>\n<div class=\"card bg-info-light mb-3\">\n<div class=\"card-body\">\n  <h5 class=\"card-title\">\n    <strong>Never miss a speaking opportunity again.</strong><br/>\n    Subscribe to get upcoming CFPs and new advice in your inbox every week!\n  </h5>\n  <form\n    class=\"row\"\n    action=\"https://cfpland.us15.list-manage.com/subscribe/post?u=4eba8b205fc13380cd3e6f3fc&amp;id=258f553f4e\"\n    method=\"post\"\n  >\n    <div class=\"col-sm-12 col-md-8\">\n      <input\n        name=\"EMAIL\"\n        type=\"email\"\n        class=\"form-control mb-2\"\n        id=\"emailInput\"\n        aria-label=\"Enter email to get CFPs in your inbox every week\"\n        placeholder=\"Enter email\"\n        required\n      />\n    </div>\n    <div class=\"col-sm-12 col-md-3\">\n      <button type=\"submit\" class=\"btn btn-secondary btn-block mb-2\">\n        Sign Up\n      </button>\n    </div>\n  </form>\n</div>\n</div>\n<h2>1. Developer Advocates: Professional Technical Speakers</h2>\n<p>I didn’t realize this was a job until I started speaking at conferences and met a few people who did this. “Developer Advocates” (sometimes called DevRels or Developer Evangelists) are paid to get their company’s name out into the public. It’s a lot like marketing, but with a decidedly technical bent.</p>\n<p>Most Developer Advocates still write code, help support the products they work on and are involved in coming up with and testing new features. Because their job is to be in the public eye, many of them are very prolific speakers.</p>\n<blockquote>\n<p>During my first year [in Developer Relations] at Okta…I spoke 37 times, at 20 conferences, in 10 different countries.\n<em><a href=\"https://developer.okta.com/blog/2019/01/28/developer-relations-pro-tips\">Matt Raible</a></em></p>\n</blockquote>\n<p>While an element of their job may require speaking, many also do it for other reasons you’ll read about below.</p>\n<p><img src=\"https://i.imgur.com/eHIEzXQ.jpg\"></p>\n<h2>2. Promote a Business or Project</h2>\n<blockquote>\n<p>Speaking at conferences is a good way to boost my career prospects as a technology consultant.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-jason-swett/\">Jason Swett</a></em></p>\n</blockquote>\n<p>Small business owners and consultants are always looking for an edge, and for many getting recognition by speaking at conferences is a great opportunity. Not only do they get to make a name for themselves, but they may also meet people in the audience who actually want to hire them.</p>\n<blockquote>\n<p>Some of the connections I’ve made at conferences and meetups have definitely helped me land further speaking gigs and new clients.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-keanan-koppenhaver/\">Keanan Koppenhaver</a></em></p>\n</blockquote>\n<p>Some developers also use speaking as an excuse to plug open source products they want to support.</p>\n<blockquote>\n<p>I try to contribute to some [open source] libraries also, but promoting them on stage feels like the best thing that I’m capable of doing. If something makes my life better, and some people invest their efforts and share it for free — I want to help them to gain exposure.\n<em><a href=\"https://medium.com/@tryshchenko/why-am-i-doing-public-speaking-at-tech-events-the-honest-answer-a75d80f85cfd\">Oleksandr Tryshchenko</a></em></p>\n</blockquote>\n<h2>3. Help Others</h2>\n<blockquote>\n<p>What I like about public speaking is that it puts me in a new place to help other people. I am thrilled that I’m providing content that people want to hear, and content that they can take something from to apply to their lives.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-rhia-dixon/\">Rhia Dixon</a></em></p>\n</blockquote>\n<p>One of the most common answers I hear from people about why they got into public speaking is their desire to help others. Speaking is rarely a financially lucrative gig, so it’s a good thing that people find fulfillment just by spreading their knowledge.</p>\n<blockquote>\n<p>I try as much as possible to help other people get into tech, or get better at tech. Knowing I helped at least one person by being on stage and sharing my knowledge makes me feel a bit better about that.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-alex-lakatos/\">Alex Lakatos</a></em></p>\n</blockquote>\n<p>Even if a topic has been spoken about before, there are always new people coming into the industry who need to learn about it. Many speakers realize that their unique spin on something might shed new light on it.</p>\n<blockquote>\n<p>It’s really cool that the way I present something or specifically explain something can help make whatever I’m talking about click with someone in a way that it hasn’t before.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-kara-luton/\">Kara Luton</a></em></p>\n</blockquote>\n<p>While there are plenty of other ways to help others out, it is nice to be able to do it en masse.</p>\n<blockquote>\n<p>I enjoy being able to share my advice with a lot of people at once. It is like mentoring or giving advice on steroids.\n<em><a href=\"https://www.cfpland.com/blog/speaker-molly-struve/\">Molly Struve</a></em></p>\n</blockquote>\n<h2>4. Meet People</h2>\n<blockquote>\n<p>It’s great to be able to speak about the thing you’re interested in in front of a lot of people, because it means for the rest of the conference the other people who share your passion will come up and talk to you.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-nicola-rushton/\">Nicola Rushton</a></em></p>\n</blockquote>\n<p>I never really started meeting people at conferences until I started speaking at them. Like many software engineers, I get intimidated by large groups of new people, but after speaking, attendees would come up to me and introduce themselves. It took a ton of the pressure off of meeting new people.</p>\n<blockquote>\n<p>I think it’s a lot easier to meet people when you’re the one giving the presentation because 1) people already know a topic they can discuss with you which cuts out a lot of networking small talk and 2) people come up to you instead of you having to approach them every time.\n<em><a href=\"https://www.cfpland.com/blog/speakers-bailey-lewis/\">Bailey Lewis</a></em></p>\n</blockquote>\n<p>Local meetups are great for seeing friends and meeting people too, but at a conference, you can meet people from around the world. There’s nothing like it.</p>\n<blockquote>\n<p>“Speaking at conferences is a really fun way to meet other developers and get outside perspectives on things — not just outside your particular industry, but outside your own country!”\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-george-mandis/\">George Mandis</a></em></p>\n</blockquote>\n<p>If you do start speaking at conferences, don’t miss out on the chance to meet new people. Even if it’s just a few of the other speakers, take advantage of the connections you can make at conferences.</p>\n<blockquote>\n<p>“Too many speakers finish their talk and then rush off to catch a plane, or hole themselves up in a hotel room to get back on top of email. If you do this, you’re missing out on one of the most valuable aspects of an event: the networking.”\n<em><a href=\"https://blog.prezi.com/speaking-at-a-conference-here-are-10-things-the-organizer-wants-you-to-keep-in-mind/\">Mark Walker</a></em></p>\n</blockquote>\n<div class=\"card bg-info-light mb-3\">\n<div class=\"card-body\">\n  <h5 class=\"card-title\">\n    <strong>Like this guide?</strong><br/>\n    Subscribe to get advice, interviews with conference speakers, and new speaking opportunities in your inbox every week!\n  </h5>\n  <form\n    class=\"row\"\n    action=\"https://cfpland.us15.list-manage.com/subscribe/post?u=4eba8b205fc13380cd3e6f3fc&amp;id=258f553f4e\"\n    method=\"post\"\n  >\n    <div class=\"col-sm-12 col-md-8\">\n      <input\n        name=\"EMAIL\"\n        type=\"email\"\n        class=\"form-control mb-2\"\n        id=\"emailInput\"\n        aria-label=\"Enter email to get CFPs in your inbox every week\"\n        placeholder=\"Enter email\"\n        required\n      />\n    </div>\n    <div class=\"col-sm-12 col-md-3\">\n      <button type=\"submit\" class=\"btn btn-secondary btn-block mb-2\">\n        Sign Up\n      </button>\n    </div>\n  </form>\n</div>\n</div>\n<h2>5. Recognition</h2>\n<blockquote>\n<p>“There’s something impressive about going to a city for the first time, and have people walk up and introduce themselves to me, mentioning past talks or blog posts.”\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-gant-laborde/\">Gant Laborde</a></em></p>\n</blockquote>\n<p>Some of the most active tech conference speakers have built up quite a following. I’m not one of them, but I have had a couple of talks where people came up to me later in the conference and said they enjoyed my presentation. I’ve even gotten a few Twitter followers as a result.</p>\n<blockquote>\n<p>“Some people have a bunch of Twitter followers and YouTube views, and this seems to make them happy. Building your public brand by speaking at conferences can be a way to work towards this.”\n<em><a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">Nick Heiner</a></em></p>\n</blockquote>\n<p>That said, if fame and recognition is your #1 goal, be careful. Some conferences <a href=\"/guides/speaking/how-conferences-choose/\">prefer not to invite the most egotistical speakers</a>.</p>\n<h2>6. Travel</h2>\n<blockquote>\n<p>“I’ve found so far speaking is a great way to visit new places – I often take a couple of days before or after to explore the area outside of the conference hotel.”\n<em><a href=\"https://www.cfpland.com/blog/speakers-bailey-lewis/\">Bailey Lewis</a></em></p>\n</blockquote>\n<img src=\"https://i.imgur.com/ZeztrR6.jpg\" class=\"right\">\n<p>If you’re new to speaking at conferences, you might not realize this, but many speakers’ airfare and hotel stays are paid for by the event. I’ve worked with organizers to delay my return date by a day or two (with me picking up the extra hotel nights) so I could visit the city on my own time. This opportunity for free or low-cost travel is a great perk.</p>\n<p>Unfortunately, not every conference can afford to pay for every speaker to travel, so you’ll have to be picky if this is something you want. All the conferences listed on CFP Land include details about the perks included for speakers, so be sure to <a href=\"/conferences\">check out our list of CFPs</a>.</p>\n<h2>7. Personal Growth</h2>\n<blockquote>\n<p>“The more I present the more confident I become in my abilities to do so. This has helped with my social anxiety and with my ability to interact with clients or potential clients.”\n<em><a href=\"https://www.cfpland.com/blog/speakers-mike-miles/\">Mike Miles</a></em></p>\n</blockquote>\n<p>Many software engineers and technology professionals don’t have to interact with customers or lead meetings on a daily basis. This lack of practice speaking in public makes it scary, but many people use conference speaking as a way to overcome this fear.</p>\n<blockquote>\n<p>Speaking at conferences has definitely helped to improve my presentation skills. I am more confident in speaking in front of groups of people who I don’t know whereas before I would get nervous and my anxiety levels would go through the roof.\n<em><a href=\"https://www.cfpland.com/blog/speakers-rizwan-javaid/\">Rizwan Javaid</a></em></p>\n</blockquote>\n<p>Others I have talked to cite specific professional opportunities they’ve encountered because of their public speaking efforts. I’ve known several speakers who turned conference talks into books, online courses, or training workshops.</p>\n<blockquote>\n<p>I was given the opportunity to create a course for Lynda.com because I met Lynda.com staff author Ray Villalobos after we both spoke at a conference. It turned out that we were both speaking at another conference a few months later, so he made a point to check out my talk at that conference. He enjoyed it so he recommended me as a course author. Prior to that I had not even considered authoring a course, and after he sold me on the idea, it because a reality that never would have been had I not met Ray.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-john-riviello/\">John Riviello</a></em></p>\n</blockquote>\n<p>For example, the <a href=\"https://developers.google.com/community/experts\">Google Developer Expert program</a> lists “Being an influential and recognized speaker,” as one of its criteria.</p>\n<blockquote>\n<p>Recently I joined the Google Developer Expert program, which is something that would have very likely not happened without my conference speaking.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-george-mandis/\">George Mandis</a></em></p>\n</blockquote>\n<h2>8. Finding a Job</h2>\n<p>In addition to improving your presentation skills and gaining accolades in your field, speaking may even help land you a job. A couple of speakers I know have met people at their future employer at conferences as a result of their talks.</p>\n<blockquote>\n<p>During job interviews, I’ve had interviewers tell me how much they loved my talks!\n<em><a href=\"https://www.cfpland.com/blog/speaker-anjuan-simmons/\">Anjuan Simmons</a></em></p>\n</blockquote>\n<p>Making your resume stand out of the hundreds of others like it is tough; having some unique experience like speaking at a conference can really help set you apart.</p>\n<h2>9. The Rush</h2>\n<blockquote>\n<p>Public speaking is very energizing, probably similar to drugs, but with no bad side-effects!\n<em><a href=\"https://www.cfpland.com/blog/speaker-nicolas-frankel/\">Nicolas Fränkel</a></em></p>\n</blockquote>\n<p>Every time I complete a conference talk, I have a natural high that lasts for a good 2-3 hours. Maybe it’s just the tail end of my nervousness, but speaking can be invigorating.</p>\n<p>Not everyone reacts the same way though. I’ve met speakers who feel the need to run back to their hotel room and sleep after a talk. If you’re more introverted or anxious, the experience of speaking at a conference might just have the opposite effect.</p>\n<h2>10. Advocate a Cause</h2>\n<blockquote>\n<p>I’ve always been fascinated by the ability of human speech to change the world, and I hope that my public speaking is a small brick in the enormous wall of humanity’s ongoing attempt to make ourselves better.\n<em><a href=\"https://www.cfpland.com/blog/speaker-anjuan-simmons/\">Anjuan Simmons</a></em></p>\n</blockquote>\n<p>While tech conferences may remain <em>mostly</em> a-political, there are plenty of places where technology and social good intersect. Some speakers specialize in this arena.</p>\n<p><img src=\"https://i.imgur.com/aslvVbP.jpg\"></p>\n<p>For example, Eva PenzyMoog travels around the United States to give her talk about how technology enables certain kinds of domestic abuse:</p>\n<blockquote>\n<p>These are real people who are being controlled, beaten, and murdered - and we in tech have a role to play in preventing it from happening.\n<em><a href=\"https://www.cfpland.com/blog/speakers-eva-penzeymoog/\">Eva PenzyMoog</a></em></p>\n</blockquote>\n<p>If you want to make a positive impact on the world, speaking at conferences just might be your outlet.</p>\n<h2>11. Learn New Things</h2>\n<blockquote>\n<p>[Speaking is] an excuse to learn and play with new technology…Because my day job tends to focus more on boring tech that works, giving conference talks lets me experiment with stuff I know we wouldn’t touch at work.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-matthew-trask/\">Matthew Trask</a></em></p>\n</blockquote>\n<p>A couple of years ago, I decided I wanted to learn Docker. I didn’t have much of a case for using it at work, but it seemed like promising technology that would be interesting to learn.</p>\n<p>I dove in headfirst - I started a couple of side projects that used it, wrote <a href=\"https://www.shiphp.com/\">a short book about it</a>, and started pitching talks about it to conferences. This year, I designed a four-hour workshop as well. I’ve found lots of other speakers also use their talks as an opportunity to learn something new.</p>\n<blockquote>\n<p>When I submit a talk proposal it’s usually on a topic that I am not an expert on, but one that I am interested in learning more about. I then have a motivator to deep dive into the topic to learn about it.\n<em><a href=\"https://www.cfpland.com/blog/speakers-mike-miles/\">Mike Miles</a></em></p>\n</blockquote>\n<p>Many conference talks include live coding or demonstrations, which are also a good excuse to play with new technology.</p>\n<blockquote>\n<p>Building demos can really help you with learning the ins and outs on a topic and you never know what you may uncover.\n<em><a href=\"https://www.cfpland.com/blog/speaker-taelur-alexis/\">Tae’lur Alexis</a></em></p>\n</blockquote>\n<p>There’s even research that indicates that <a href=\"https://www.edsurge.com/news/2019-01-24-want-students-to-remember-what-they-learn-have-them-teach-it\">teaching a subject is one of the best ways to learn it</a>. If you have to break things down to a point where someone at any experience level can digest it, you’re going to have to understand the concept pretty well.</p>\n<blockquote>\n<p>While writing talks are a huge time commitment, there is nothing quite like explaining a concept to others to help crystalize it in your mind.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-laurie-barth/\">Laurie Barth</a></em></p>\n</blockquote>\n<p>Hopefully, the reasons above have convinced you that speaking at conferences is a worthwhile endeavor. Next, we’ll dive into how conferences choose speakers and learn about the “Call for Proposals” process.</p>\n<p><a class=\"text-left d-block\" href=\"../introduction\">Previous: An Introduction to Technology Conferences</a>\n<a class=\"text-right d-block\" href=\"../how-conferences-choose/\">Next: How Conferences Choose Their Speakers</a></p>","frontmatter":{"layout":"post","title":"Why Speak? 11 Reasons People Get on Stage","path":"/guides/speaking/why-speak/","category":"Guides","tags":null,"date":null,"image":"https://drive.google.com/uc?id=1ULa0I4_bXG3XJnXas6PaFhcuy1T6ujLa"}}},{"post":{"html":"<p>Speaking is a lot like applying for jobs in that most of the time, you’re going to be rejected no matter how good you are. Knowing what to expect when you are accepted or rejected from a conference can help soften the blow, but it still hurts.</p>\n<p>In this section, we’ll cover some of the reasons your talk might have been rejected, what to do when you do get a talk accepted, and how to respectfully decline giving a talk when you can no longer commit to it.</p>\n<!--more-->\n<p><em>This post is part of an 8-part guide to speaking at technology conferences. Be sure to <a href=\"../\">check out the other sections listed here</a>.</em></p>\n<div class=\"card bg-info-light mb-3\">\n<div class=\"card-body\">\n  <h5 class=\"card-title\">\n    <strong>Never miss a speaking opportunity again.</strong><br/>\n    Subscribe to get upcoming CFPs and new advice in your inbox every week!\n  </h5>\n  <form\n    class=\"row\"\n    action=\"https://cfpland.us15.list-manage.com/subscribe/post?u=4eba8b205fc13380cd3e6f3fc&amp;id=258f553f4e\"\n    method=\"post\"\n  >\n    <div class=\"col-sm-12 col-md-8\">\n      <input\n        name=\"EMAIL\"\n        type=\"email\"\n        class=\"form-control mb-2\"\n        id=\"emailInput\"\n        aria-label=\"Enter email to get CFPs in your inbox every week\"\n        placeholder=\"Enter email\"\n        required\n      />\n    </div>\n    <div class=\"col-sm-12 col-md-3\">\n      <button type=\"submit\" class=\"btn btn-secondary btn-block mb-2\">\n        Sign Up\n      </button>\n    </div>\n  </form>\n</div>\n</div>\n<h2>Handling Rejection</h2>\n<blockquote>\n<p>Speaking is a numbers game. The great players in baseball only hit the ball 1/3 of the time at best. I find I only get accepted to every 1 out of 3 conferences I apply to. There’s a zillion reasons why your talk wasn’t accepted that has nothing to do with you:</p>\n<ul>\n<li>Too similar to another already accepted</li>\n<li>Too different to the other talks accepted</li>\n<li>Technical, and they needed more non-technical content</li>\n<li>Too advanced</li>\n<li>Too geared towards beginners</li>\n<li>All over the place</li>\n<li>Too specific</li>\n<li>Not the right fit for attendees</li>\n<li>Your talk isn’t unique (gave at other conferences)</li>\n<li>Your talk is too immature (haven’t given at any other conferences)</li>\n</ul>\n<p><em><a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">Richard Schneeman</a></em></p>\n</blockquote>\n<p>As you can see from the above list of reasons that speakers can be rejected by a conference, there is almost no way to get every talk accepted, and it’s usually not a judgment on you, your ability, or even your qualifications. Conferences are just overwhelmed with submissions and have to draw the lines somewhere. Many times that means you won’t get chosen.</p>\n<blockquote>\n<p>Most of JSConfs receive an average of 500 proposals…\n<em><a href=\"https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32\">Karolina Szczur</a></em></p>\n</blockquote>\n<h3>1. What you’ll hear when you’re rejected</h3>\n<p>Unfortunately, many conferences don’t even notify speakers when they’re not chosen to speak. This means that you might not even know your talk was rejected until the conference releases its lineup. It’s frustrating, but a reality to get used to before you get into speaking.</p>\n<p>That said, it is really nice when the conference does take time to give you a rejection and feedback about why your talk wasn’t chosen.</p>\n<blockquote>\n<p>I really appreciate when conferences give you feedback so you can apply that to the next one you submit to. I’m learning from each rejection I get.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-kara-luton/\">Kara Luton</a></em></p>\n</blockquote>\n<h3>2. You’re not alone</h3>\n<p>Once you realize you’re not going to be speaking at this particular conference, take heart! You’re not alone - most of the people who applied were not accepted. Even prolific speakers at tech conferences are rejected frequently:</p>\n<blockquote>\n<p>My CFP rejected-to-win ratio is probably around 0.00001 which is definitely an exercise in learning how to accept rejection and not take it personally.\n<em><a href=\"https://www.cfpland.com/blog/speakers-rizwan-javaid/\">Rizwan Javaid</a></em></p>\n</blockquote>\n<p><img src=\"https://i.imgur.com/Mk3Wkwq.jpg\"></p>\n<blockquote>\n<p>You shouldn’t let the rejection emails get you down. I’ve spoken at conferences on three different continents, and I still regularly get rejected. Keep applying and refining your proposals.\n<em><a href=\"https://www.cfpland.com/blog/speaker-anjuan-simmons/\">Anjuan Simmons</a></em></p>\n</blockquote>\n<p>It’s especially tough for new speakers though as this kind of rejection is probably not something you’re used to.</p>\n<blockquote>\n<p>It is usually difficult to get started as a conference speaker in terms of getting your CFP submissions accepted. This is totally okay and you don’t need to worry about it!\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-jaime-lopez-jr/\">Jaime Lopez</a></em></p>\n</blockquote>\n<p>The best thing you can do is learn from each rejection and try again. There’s no shortage of <a href=\"https://www.cfpland.com/conferences/\">technology conference CFPs</a> to apply for, so keep a positive attitude and keep trying.</p>\n<blockquote>\n<p>It’s like for pull requests: just as you’re not your code, you’re not your submissions. Accept probabilities are not in your favor, and face rejection with the same maturity.\n<em><a href=\"https://blog.frankel.ch/advices-junior-conference-speakers/\">Nicolas Fränkel</a></em></p>\n</blockquote>\n<h3>3. Improving for next time</h3>\n<p>Rejection is most helpful when it can be turned into a learning experience. If the conference doesn’t give you a reason for your talk not being selected, you can email the organizers and ask them for feedback:</p>\n<blockquote>\n<p>Some conferences are happy to provide feedback when your session isn’t selected. Ask for it. It doesn’t hurt, and if they have time, they may respond. Some won’t though as they are often dealing with hundreds of sessions.\n<em><a href=\"https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/\">Jono Bacon</a></em></p>\n</blockquote>\n<p>In addition to asking for feedback, you can do your own sleuthing to find out how you could improve your talk for next year:</p>\n<blockquote>\n<p>Look at the talks that were accepted, what did they have in common with your proposal? What did they have that was different? Maybe you can ask some of the people who got talks accepted to share their details &#x26; pitch (things that are not put on the schedule).\n<em><a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">Richard Schneeman</a></em></p>\n</blockquote>\n<p>Finally, you might get a discount to attend the conference just because you submitted to. It might be worth going so you can meet some of the other speakers and organizers and learn what things will make your application stand out next year. Getting engaged with the speaker community is a great way to learn more about what makes a successful conference speaking proposal.</p>\n<div class=\"card bg-info-light mb-3\">\n<div class=\"card-body\">\n  <h5 class=\"card-title\">\n    <strong>Like this guide?</strong><br/>\n    Subscribe to get advice, interviews with conference speakers, and new speaking opportunities in your inbox every week!\n  </h5>\n  <form\n    class=\"row\"\n    action=\"https://cfpland.us15.list-manage.com/subscribe/post?u=4eba8b205fc13380cd3e6f3fc&amp;id=258f553f4e\"\n    method=\"post\"\n  >\n    <div class=\"col-sm-12 col-md-8\">\n      <input\n        name=\"EMAIL\"\n        type=\"email\"\n        class=\"form-control mb-2\"\n        id=\"emailInput\"\n        aria-label=\"Enter email to get CFPs in your inbox every week\"\n        placeholder=\"Enter email\"\n        required\n      />\n    </div>\n    <div class=\"col-sm-12 col-md-3\">\n      <button type=\"submit\" class=\"btn btn-secondary btn-block mb-2\">\n        Sign Up\n      </button>\n    </div>\n  </form>\n</div>\n</div>\n<h2>Getting Accepted</h2>\n<p>You will probably get more rejections than you do acceptances, but if you submit CFPs long enough, you’ll eventually get a talk accepted. Congratulations! Enjoy the moment. Once you’re ready to think about what comes next, there are a few things to keep in mind.</p>\n<h3>1. You should confirm or decline the invitation</h3>\n<img src=\"https://i.imgur.com/JaEn0YQ.jpg\" class=\"right\">\n<p>Just because you filled out the application months ago doesn’t mean your schedule will still allow you to speak. Most conference organizers know this, so when they accept your application they’ll ask you to confirm or decline the invitation. If you’re a new speaker or you’re less picky about which speaking opportunities you take, you might start off by accepting all of them, but I’ve met a few popular speakers who have had to decline conflicting speaking opportunities.</p>\n<p>When you must decline a conference’s invitation, here are some tips:</p>\n<ul>\n<li><strong>Be gracious but honest.</strong> You don’t want to burn bridges with the conference in case you have the opportunity to speak again next year.</li>\n<li><strong>Suggest another speaker if you can.</strong> Do you know someone else who might be able to speak about a similar topic? It never hurts to send a recommendation along with your response when you have to decline a speaking opportunity, plus it might give you the chance to help a new speaker get their start.</li>\n<li><strong>Offer to help promote the conference on your social media anyway.</strong> Once a conference picks its speakers, they need to start getting attendees. Anything you can do to help them sell tickets will help keep that relationship healthy in case you apply again next year.</li>\n</ul>\n<p>Hopefully, you won’t have to decline too many opportunities, but when it happens, don’t feel bad. Conference organizers know this happens and probably won’t hold any ill will towards you if you’re prompt in your response.</p>\n<h3>2. Note any logistical details they give you</h3>\n<p>If you can accept the invitation to speak, there’s a lot to figure out before the big day comes. How will you get to the conference? Will you need a flight? Bus? Train? How will you get from the airport to the hotel? How should you book your hotel room? Which meals will be provided? What time am I speaking? Who’s paying for all this?</p>\n<p>Hopefully, you worked out some of those details before you applied, but if not, you should definitely clear them up with the organizers as soon as possible. Experienced conference organizers know these things are on your mind and might give you a laundry list of expectations and a loose schedule, but if not you can certainly ask. Even if they don’t have the details ready yet, you can ask for a date to follow up with them and get them.</p>\n<p>Finally, know what your next steps are. Some conferences are very good about keeping in touch between the moment they accept you and the conference start date, but others go silent until a few days before. As long as you know what’s coming next, that’s fine, but make sure you’re clear on everything first.</p>\n<h3>3. Don’t let imposter syndrome or nerves get you down</h3>\n<p>Sometime between when you get accepted to speak at a conference and the moment you walk on stage, you may feel that you’ve made a huge mistake. About half of the conference speakers I’ve met have specifically mentioned feeling some degree of <a href=\"https://www.fastcompany.com/90178296/5-steps-for-beating-impostor-syndrome-as-a-public-speaker\">imposter syndrome</a>, “the anxious feeling that, despite all your accomplishments, you aren’t actually very competent and everyone’s about to find out.”</p>\n<p>Here are just a few of the speakers I’ve interviewed who specifically mentioned feeling imposter syndrome and a little bit about how they cope with it:</p>\n<blockquote>\n<p>Imposter syndrome is real and a totally normal feeling, so do not let that hold you back. Especially early on, I always had a feeling of “everyone in the audience will already know what I’m talking about.” That is not the case. If they did, they would not be there. Those that show up want to hear YOU and learn from your experiences. If it turns out there are a few people that decide to leave during the talk for whatever reason, there is nothing wrong with that.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-john-riviello/\">John Riviello</a></em></p>\n</blockquote>\n<p><img src=\"https://i.imgur.com/jX78u78.jpg\"></p>\n<blockquote>\n<p>While you may not feel like the expert on this topic, the people listening to you came to hear YOU! Remember you’ve got friends in the audience — some you may know, and some you may not know…yet.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-rhia-dixon/\">Rhia Dixon</a></em></p>\n</blockquote>\n<blockquote>\n<p>I’ve always been extremely uncomfortable with my content not being technical enough because I often feel like I lack technical skill, but I’ve always been confident with the delivery because it seems to come naturally to me for whatever reason.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-tejas-kumar/\">Tejas Kumar</a></em></p>\n</blockquote>\n<p>Knowing that you’re not alone in feeling this way might help some, but the best way to overcome imposter syndrome is to <em>power through it</em>. The more you get on stage, the more comfortable you’ll be and the less inadequate you will feel about being there.</p>\n<h3>4. Keep your expectations in check</h3>\n<p>Finally, even after you’ve been offered a speaking slot and you’ve accepted, keep your expectations in check. In just two years of speaking, I’ve been invited to speak at one conference that was completely canceled, and one that bumped my 45-minute talk down to a 10-minute slot.</p>\n<p>My point is that nothing is certain, so don’t wrap too much of your self-worth up into your conference talks. These kinds of changes may be rare, but if you speak long enough, you’ll run into a last-minute change that throws a wrench in your conference plans.</p>\n<p>Now that you know what to expect upon being accepted to speak, it’s time to create your presentation! In the next section, we’ll look at several types of talk you can give and some tips for delivering your content from several great technology conference speakers.</p>\n<p><a class=\"text-left d-block\" href=\"../submitting/\">Previous: Submitting Abstracts</a>\n<a class=\"text-right d-block\" href=\"../presentation/\">Next: Preparing a Presentation</a></p>","frontmatter":{"layout":"post","title":"What Comes Next? Dealing with Success or Rejection","path":"/guides/speaking/success-rejection/","category":"Guides","tags":null,"date":null,"image":"https://drive.google.com/uc?id=1KY4A0Oa_GplCGpYMzRcOLV1EQ77Fk05t"}}},{"post":{"html":"<p>Writing and submitting an abstract for a conference CFP (Call for Proposals) is a skill just like actually getting up on stage to speak is a skill. In fact, some great speakers struggle with abstracts more than they do with actually delivering their talk.</p>\n<p>Composing a great abstract takes practice, writing skills, and attention to detail that may or may not come naturally to you, but hopefully, this section will help you on your journey. But, before we get to writing an abstract for your talk, you’ll need to pick a topic.</p>\n<!--more-->\n<p><em>This post is part of an 8-part guide to speaking at technology conferences. Be sure to <a href=\"../\">check out the other sections listed here</a>.</em></p>\n<p><img src=\"https://i.imgur.com/2yKDj0x.jpg\"></p>\n<div class=\"card bg-info-light mb-3\">\n<div class=\"card-body\">\n  <h5 class=\"card-title\">\n    <strong>Never miss a speaking opportunity again.</strong><br/>\n    Subscribe to get upcoming CFPs and new advice in your inbox every week!\n  </h5>\n  <form\n    class=\"row\"\n    action=\"https://cfpland.us15.list-manage.com/subscribe/post?u=4eba8b205fc13380cd3e6f3fc&amp;id=258f553f4e\"\n    method=\"post\"\n  >\n    <div class=\"col-sm-12 col-md-8\">\n      <input\n        name=\"EMAIL\"\n        type=\"email\"\n        class=\"form-control mb-2\"\n        id=\"emailInput\"\n        aria-label=\"Enter email to get CFPs in your inbox every week\"\n        placeholder=\"Enter email\"\n        required\n      />\n    </div>\n    <div class=\"col-sm-12 col-md-3\">\n      <button type=\"submit\" class=\"btn btn-secondary btn-block mb-2\">\n        Sign Up\n      </button>\n    </div>\n  </form>\n</div>\n</div>\n<h2>Choosing Topics</h2>\n<blockquote>\n<p>You do NOT need to have the talk written before you write a proposal for that talk to apply to conferences with.\n<em><a href=\"https://www.cfpland.com/blog/speakers-eva-penzeymoog/\">Eva PenzeyMoog</a></em></p>\n</blockquote>\n<p>While you don’t have to have your entire presentation ready before you submit to a CFP, you should have some idea what you might want to talk about. Be sure your topic is something you really want to speak, answer questions, and learn everything you possibly can about.</p>\n<p>Here are some things to consider when choosing a topic:</p>\n<h3>1. Does it fit the conference?</h3>\n<blockquote>\n<p>Think carefully about what your audience is interested in as opposed to what you are. What problems do they want to solve? What are the gaps in their experience? Where do they need guidance? You need to serve a need and purpose, and if you can map your presentation more commonly to these needs, you are more likely to get picked.\n<em><a href=\"https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/\">Jono Bacon</a></em></p>\n</blockquote>\n<p>Matching your talk with the conference’s area of focus is one of the best ways to get more talks accepted. Not only should the talk fit the conference’s broad area, but you should also look at the individual “tracks” the conference will be offering and make sure your abstract fits into one of them.</p>\n<p>For example, you’re never going to get a PHP-focused talk accepted at a Python conference, but if you have a Javascript talk, you might find lots of conferences with a “frontend” track that is appropriate for your topic.</p>\n<h3>2. Does it get you excited?</h3>\n<blockquote>\n<p>DO NOT propose a topic that you think will get you on stage but doesn’t actually excite you at all.\n<em><a href=\"https://rckbt.me/2014/01/conference-proposals/\">Raquel Vélez</a></em></p>\n</blockquote>\n<p>One of the hardest things you will ever have to do as a speaker is stand up on stage for an hour talking about something you’re not really interested in. That’s why you need to pick a topic that gets you excited, but keep in mind that your interests will change over time. Sometimes a topic you cared about 2 years ago will no stop be interesting.</p>\n<blockquote>\n<p>Pick a topic that you wouldn’t mind speaking about for hours and make it interesting for the version of you that would benefit from the talk.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-rhia-dixon/\">Rhia Dixon</a></em></p>\n</blockquote>\n<p>Your interest level and passion for the topic will come across in your presentation. It’s really hard to fake genuine excitement, and having that positive energy will make you a much more confident and effective speaker. Audiences want to listen to speakers who are excited about their topic, and conference committees will notice that in your application.</p>\n<blockquote>\n<p>When you speak about something that you are passionate about; you will actually be pretty excited to speak instead of being nervous. And your energy will be reflected when you present. It will boost your confidence and you will enjoy speaking!\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-drishti-jain/\">Drishti Jain</a></em></p>\n</blockquote>\n<p>Finally, talks that get you excited are easy to prepare for. You probably choose to spend time learning about the topic already, so channeling that knowledge into a talk you can share with others is just the logical next step.</p>\n<blockquote>\n<p>You know you’re passionate about a topic if you’re already spending a lot of time reading about it, thinking about it, and debating it with people on Twitter. Wrap your talks around your passions.\n<em><a href=\"https://www.cfpland.com/blog/speaker-anjuan-simmons/\">Anjuan Simmons</a></em></p>\n</blockquote>\n<h3>3. Is it something you know well?</h3>\n<blockquote>\n<p>Pick a topic you are passionate about but also already knowledgeable about. Don’t experiment on new topics until you start getting accepted to speak. No need to add pressure on top of everything else.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-matthew-trask/\">Matthew Trask</a></em></p>\n</blockquote>\n<p>Just being excited about a topic isn’t enough on its own. You also have to be (or become) very knowledgeable about it. While you may have lots of time to learn about the topic between when your talk gets accepted and when you first present it, don’t underestimate the amount of time it takes to prepare a really strong conference presentation.</p>\n<p>New speakers may want to stick to topic areas they know already to minimize the amount of after-hours work they have to put in.</p>\n<blockquote>\n<p>Think of something you’ve been successful at professionally, and then think of what advice you’d give to others on that topic. Can you come up with 5–10 tips to make your audience better at X? A coding language, a new tool, even a soft skill? Then you’ve got enough to respond to a CFP.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-laura-janusek/\">Laura Janusek</a></em></p>\n</blockquote>\n<p>Using things you’ve learned at work or on a side project are usually a good direction. If you collaborated with others, you can also get their thoughts on the topic and integrate that into your talk as well.</p>\n<h3>4. Is it sufficiently unique?</h3>\n<blockquote>\n<p>Talks that can be summarized as an ‘Intro to (Tool)’ are often lazily conceived, poorly designed, and delivered mechanically. Great talks, meanwhile, dive deeper and are eager to explore fundamental issues, even if they use a tool as the catalyst for discussion.\n<em><a href=\"http://jumpstartlab.com/news/archives/2014/02/15/prototypical-conference-talks\">Justin Searls</a></em></p>\n</blockquote>\n<p>The best conferences are looking for speakers who can do really unique and deep dives into a topic. Surface-level “intro to X” talks aren’t likely to get accepted at the most competitive international events. Speakers are expected to present unique, novel, experimental, and personal talks at these kinds of events.</p>\n<blockquote>\n<p>It’s fairly easy for anyone to step in, read available materials and prepare a mediocre presentation. Don’t get me wrong, I’ve done it too, which now makes me able to see why we can do better. Trust me, we’ve all seen the Angular 2 talks already. Don’t copy your predecessors. Interesting angle on React Native? Experimental usage of Rails to build a realtime app? Your own personal experiences and unexpected solutions? Yes, please.\n<em><a href=\"https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32\">Karolina Szczur</a></em></p>\n</blockquote>\n<p>That said, smaller regional conferences might be interested in simple, “how-to” talks. Some of my most highly accepted talks are introductory-level talks on Docker and Testing because lots of attendees are actually interested in learning about those topics, and can use them as a reason to get their companies to send them to the conference.</p>\n<blockquote>\n<p>ANY topic is fair game even if people have talked about it before. You can always bring a new perspective to a topic.\n<em><a href=\"https://www.cfpland.com/blog/speaker-molly-struve/\">Molly Struve</a></em></p>\n</blockquote>\n<p>While you should try to make your talk unique, you don’t <em>have</em> to be the only person in the world giving talks on a particular topic to get accepted to speak about it.</p>\n<h3>5. Does it make the world a better place?</h3>\n<p>One of the things that <a href=\"../why-speak/\">motivates many speakers</a> is a desire to improve the world around them, and this comes across in their choice of topics. Even technical topics can make the world a better place because they’re spreading knowledge that you have to others.</p>\n<blockquote>\n<p>Talk about topics that make the world a better place; in particular accessibility, diversity, ethics, etc. I [try] to go beyond just technical issues and spread good ideas I believe in.\n<em><a href=\"https://medium.com/@tryshchenko/why-am-i-doing-public-speaking-at-tech-events-the-honest-answer-a75d80f85cfd\">Oleksandr Tryshchenko</a></em></p>\n</blockquote>\n<p>Try to think about how your talk will improve the audience members’ lives. If you can convey that in the talk description or abstract, you’ll make a big impression on the organizing committee.</p>\n<h3>6. Is it genuine?</h3>\n<blockquote>\n<p>Submit sessions that are interesting, engaging, and challenging, but don’t resort to clickbait titles and topics. Break the mold of what people normally talk about and how they discuss it, but stay classy.\n<em><a href=\"https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/\">Jono Bacon</a></em></p>\n</blockquote>\n<p>Some speakers are tempted to take speaking as an opportunity to push the limits of what can be said on stage. This might work, but it’s a risky tactic for a new conference speaker. Selection committees can see through cheap laughs and hackneyed titles, so keep your topics clear and intentions genuine.</p>\n<blockquote>\n<p>The talks that are most engaging to me include stories of failure, they talk about learning something you don’t know and falling down along the way, or they’re a new perspective from an outsider on a specific topic.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-laurie-barth/\">Laurie Barth</a></em></p>\n</blockquote>\n<p>Being genuine can also mean sharing a story about how you failed in the past. This is a great topic because nobody succeeds every time they attempt something, so your audience will probably resonate with the description of challenges you’ve failed to reach.</p>\n<h3>7. Is it actionable?</h3>\n<blockquote>\n<p>Talking about why technology X is cool in a general way can be just fine, but sharing how we used X at Y to achieve Z gives the audience something more concrete to walk away with.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-george-mandis/\">George Mandis</a></em></p>\n</blockquote>\n<p>Thinking about topics that are actually useful to your audience is surprisingly hard. A lot of new technology is interesting but practically useless, so try to center around real problems that can be solved by your area of focus.</p>\n<blockquote>\n<p>OK talks are about the topic. Good talks are about the speaker/presentation. Great talks are about the audience.\n<em><a href=\"https://twitter.com/getify/status/804018344412217344\">Kyle Simpson</a></em></p>\n</blockquote>\n<p>Another way of thinking about this is by thinking about your audience and what they hope to take away from your talk. Keeping your takeaways succinct and clear will help you in this effort. Your slides shouldn’t be bullet points, but there’s no reason your abstract shouldn’t use a list of key learnings for readers.</p>\n<blockquote>\n<p>Your talk should have a point. When someone walks away from your talk they might only take away 2-3 things with them. Those things should be in your proposal\n<em><a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">Richard Schneeman</a></em></p>\n</blockquote>\n<div class=\"card bg-info-light mb-3\">\n<div class=\"card-body\">\n  <h5 class=\"card-title\">\n    <strong>Like this guide?</strong><br/>\n    Subscribe to get advice, interviews with conference speakers, and new speaking opportunities in your inbox every week!\n  </h5>\n  <form\n    class=\"row\"\n    action=\"https://cfpland.us15.list-manage.com/subscribe/post?u=4eba8b205fc13380cd3e6f3fc&amp;id=258f553f4e\"\n    method=\"post\"\n  >\n    <div class=\"col-sm-12 col-md-8\">\n      <input\n        name=\"EMAIL\"\n        type=\"email\"\n        class=\"form-control mb-2\"\n        id=\"emailInput\"\n        aria-label=\"Enter email to get CFPs in your inbox every week\"\n        placeholder=\"Enter email\"\n        required\n      />\n    </div>\n    <div class=\"col-sm-12 col-md-3\">\n      <button type=\"submit\" class=\"btn btn-secondary btn-block mb-2\">\n        Sign Up\n      </button>\n    </div>\n  </form>\n</div>\n</div>\n<h2>Writing a Title and Abstract</h2>\n<p>Now that you have some tips for picking a topic, you can write a talk title and abstract. Each CFP you submit to will require a title and abstract and the organizing committee’s selection will be largely based on these fields, so it’s important to spend time on them.</p>\n<p>Here are some tips for writing a great abstract and title to submit to conference calls for proposals:</p>\n<h3>1. Customize each submission</h3>\n<blockquote>\n<p>At least 30% of ~2,500 proposals I’ve ever read violated the predefined rules for talk abstracts and submissions that have been set…no matter how adept in speaking you are, do read the instructions carefully before submitting and ensure the proposal is following them.\n<em><a href=\"https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32\">Karolina Szczur</a></em></p>\n</blockquote>\n<p>Every conference has its own set of priorities, rules, and requests for abstracts. Be sure to read everything they include on their CFP page as well as their conference website.</p>\n<p>In addition to the clearly-stated rules, every conference attracts a slightly different audience, and as a speaker, you should know who is in that audience before you submit your abstract. Even if the bulk of your talk will be the same at each conference, the abstract may need to be revisited between each one.</p>\n<h3>2. Include enticing details</h3>\n<blockquote>\n<p>Make it easy for a reviewer to get excited about your talk. Be specific and get into the details about what you’re point of view is.\n<em><a href=\"https://medium.com/uxrblog/uxrconf-2020-a-few-tips-for-crafting-a-great-speaker-application-b295e3f61260\">Maggi Mitchell</a></em></p>\n</blockquote>\n<p>Vague abstracts or titles are not easy to assess. Conference attendees won’t go to a talk they don’t understand, so it’s best to be clear and include an appropriate amount of detail in each abstract you submit. This means including tangible details that show the organizers and attendees that you know what you’re talking about as well as some concrete takeaways they can expect to glean from your talk.</p>\n<h3>3. Don’t be too wordy</h3>\n<blockquote>\n<p>Most of JSConfs receive an average of 500 proposals, assuming a very strict 1-minute reading time per submission it’s still a full workday of reading…A good rule of thumb is two to three paragraphs clearly expressing your idea.\n<em><a href=\"https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32\">Karolina Szczur</a></em></p>\n</blockquote>\n<p>Depending on the rules the conference lays out, between 200 and 500 words is usually allowed, so you have to include details while being succinct. It’s not easy, but when you consider that some conferences receive hundreds of submissions, it’s easy to see why it’s necessary.</p>\n<p>Keep in mind that your audience might be reading your abstract on a small, printed handout, so be informative without boring them with jargon or unnecessary detail.</p>\n<h3>4. Get a proofreader</h3>\n<blockquote>\n<p>A typical conference selection team will be reading dozens or hundreds of session proposals…That means conference organizers are going to skim…many if not most will automatically discount anything with obvious typographical and grammar mistakes.\n<em><a href=\"https://www.garfieldtech.com/blog/3-paragraph-pitch\">Larry Garfield</a></em></p>\n</blockquote>\n<p>Think of your abstract like you would your resume when applying for jobs. Details matter. Spelling and grammar mistakes will hurt your credibility and make you look sloppy to organizers who are already looking for any excuse to lighten their submission load.</p>\n<p><img src=\"https://i.imgur.com/jM4NxQD.jpg\"></p>\n<p>This reason alone is probably enough to get a proofreader, but having other people read your proposal can also help make sure you aren’t relying too heavily on jargon or assuming too much about what your reader knows.</p>\n<blockquote>\n<p>Find people from varying backgrounds to read your abstracts — I have a speaker in tech, a speaker not in tech, and a non-speaker in tech review all of my abstracts to tell me what they think the point is, what they would expect to learn, and offer alternative titles.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-rhia-dixon/\">Rhia Dixon</a></em></p>\n</blockquote>\n<p>Stepping back and being your own proofreader can help as well:</p>\n<blockquote>\n<p>Don’t immediately submit your abstract. Write it, and then talk a walk, get away from it, and come back after an hour and see how you feel about it. You may see things you can do better.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-matthew-trask/\">Matthew Trask</a></em></p>\n</blockquote>\n<p>An English teacher once told me to go back and read my papers one word at a time starting at the end. This forces you to think about each word and can help you fix simple spelling mistakes. Tools like Grammarly can help with these fundamentals as well.</p>\n<h3>5. Avoid cliches</h3>\n<blockquote>\n<p>Don’t use cliches, everyone uses cliches and it makes your proposal blend in. If you feel the pull of using a phrase everyone has heard “a million times”, ask yourself if it adds to what you’re trying to convey.\n<em><a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">Richard Schneeman</a></em></p>\n</blockquote>\n<p>Cliches are very tricky to use well without seeming trite. In general, conference speakers should avoid using them in their titles or abstracts. If you need some good examples of cliches, <a href=\"https://examples.yourdictionary.com/examples-of-cliches.html\">here’s a list</a>.</p>\n<h3>6. Find a format that works for your talk</h3>\n<blockquote>\n<p>There’s no one right way to write a session pitch, but I’ve found the 3-part pitch works well for me. A 3-part pitch has three key points, in order:</p>\n<ul>\n<li>State the problem</li>\n<li>Tease the solution</li>\n<li>Explain how you’ll provide the rest of the solution in the session</li>\n</ul>\n<p><em><a href=\"https://www.garfieldtech.com/blog/3-paragraph-pitch\">Larry Garfield</a></em></p>\n</blockquote>\n<p>Not every speaker takes an approach that’s as prescribed as Larry’s above, but it might be a good idea to start with a very formulaic method of writing and submitting talks until you get more comfortable with the process. This can help you focus on the content and mechanics before moving on to creative approaches.</p>\n<h3>7. Get creative</h3>\n<blockquote>\n<p>Conferences are generally looking for novelty when choosing talks.\n<em><a href=\"https://medium.com/uxrblog/uxrconf-2020-a-few-tips-for-crafting-a-great-speaker-application-b295e3f61260\">Maggi Mitchell</a></em></p>\n</blockquote>\n<p>Because you’re trying to stand out, there is some room to break the mold. While having a format for your talk submission might help, don’t feel like you can’t try something a little different from time to time.</p>\n<blockquote>\n<p>One thing I found helps in my abstract creative process, is to make word clouds. Given a topic like “security” or “performance” I write down as many other words come to mind. I then stack rank them based on which are the most interesting. I write about 10-20 different intro sentences. About 3-4 different copies of the “takeaway” sentences, and about 5-10 outro sentences. I then mix them up until they feel right.\n<em><a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">Richard Schneeman</a></em></p>\n</blockquote>\n<p>Look into <a href=\"https://business.tutsplus.com/articles/top-brainstorming-techniques--cms-27181\">brainstorming methods</a> if you have trouble coming up with creative new ideas or topics. Sometimes these will unlock things that will set your talk apart from other similar submissions.</p>\n<h3>8. Aim for a specific experience level</h3>\n<blockquote>\n<p>Learn the approximate proficiency of your target audience before giving a talk. Make it easier or harder if needed. I mismatched several times, and it’s not the best thing to do.\n<em><a href=\"https://medium.com/@tryshchenko/why-am-i-doing-public-speaking-at-tech-events-the-honest-answer-a75d80f85cfd\">Oleksandr Tryshchenko</a></em></p>\n</blockquote>\n<p>Generally, conferences are looking for a wide range of talks directed at different experience levels. When you write your abstract, be sure to make it clear if your talk is especially directed at beginners, intermediate, or advanced learners. This will help the conference organizers know where to slot your talk in and help attendees decide whether your talk is right for them or not.</p>\n<blockquote>\n<p>If a conference was only filled with super-advanced talks, they would lose a huge part of their audience. So, even if you just learned something, you can teach it and many attendees will welcome your perspective as a relatively-recent beginner. Since you just went through it all for the first time yourself, you know and remember all the roadblocks that someone getting started will have and can help them learn even quicker.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-keanan-koppenhaver/\">Keanan Koppenhaver</a></em></p>\n</blockquote>\n<h3>9. Use inclusive, positive language</h3>\n<p>Technology conferences have become <a href=\"https://www.karllhughes.com/posts/diversity-in-conference-speakers\">very aware of the lack of diversity and inclusion</a> in our industry, and many are actively trying to reverse it. Even if the conference isn’t addressing these issues directly, using words and phrases that may offend in your abstract is a really bad idea. It alienates users from your otherwise good content and makes you seem less credible.</p>\n<blockquote>\n<p>Conference track chair here: please don’t curse or use any offensive language in your session title. It’s not cute, it violates the code of conduct, you were told not to in the CFP, and I will automatically rate your submission a zero.\n<em><a href=\"https://twitter.com/aburke626/status/1205566597563404288\">Alanna Burke</a></em></p>\n</blockquote>\n<p>Also, be aware of ableist language. You might think using the word “crazy” is just a way to describe illogical technology choices, but you could also be hurting people.</p>\n<blockquote>\n<p>Common examples of ableist language are words like, “lame,” “dumb,” “retarded,” “blind,” “deaf,” “idiot,” “imbecile,’ “nuts,” “psycho,” and “spaz.” These terms can be associated with a person’s identity or their challenges, and because of that, can be interpreted as insulting or hurtful.\n<em><a href=\"https://deareverybody.hollandbloorview.ca/learn/tips-and-tools/how-to-avoid-using-ableist-language/#.XcXTqJJKigQ\">Holland Bloorview Kids Rehabilitation Hospital</a></em></p>\n</blockquote>\n<h3>10. Take time with the title</h3>\n<blockquote>\n<p>A good title is reasonably short, self-descriptive, contains the appropriate buzzwords for your topic (and no others), and has enough of a “hook” to make someone want to read further (or attend).\n<em><a href=\"https://www.garfieldtech.com/blog/3-paragraph-pitch\">Larry Garfield</a></em></p>\n</blockquote>\n<p>While your abstract may be a few hundred words, your title will probably only be 10 or 20, so it’s really hard to make it convey meaning while being interesting to readers. This is why you should spend a good amount of time thinking about and refining your title.</p>\n<p>This is another area where brainstorming techniques and coming back to it later can help.</p>\n<blockquote>\n<p>Set a timer for 3 minutes, write as many titles as you can. Pick your favorite, then write the rest of your submission. When you’re done go back and throw away the title and re-write it.\n<em><a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">Richard Schneeman</a></em></p>\n</blockquote>\n<h3>11. Close strong</h3>\n<blockquote>\n<p>Make the last sentence in your abstract somewhat memorable, preferably short, even better if it’s actionable.\n<em><a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">Richard Schneeman</a></em></p>\n</blockquote>\n<p>The last sentence in your abstract is your hook. It’s that final word that reels readers in and makes them want more or inspires them. It matters.</p>\n<h2>Submitting Your Talks</h2>\n<img src=\"https://i.imgur.com/rtdrFXw.jpg\" class=\"right\">\n<p>Once you’ve picked a topic and written an abstract and title for your talk, you’re about almost done, but there are a few more things you should consider before you click the final “Submit” button:</p>\n<h3>1. You may be asked to submit more information</h3>\n<p>The organizing committee will select talks based primarily on the abstract and title fields, but they may also have you submit other information like a long description or your qualifications. These fields vary pretty widely, but since the audience is only internal conference organizers, you don’t have to worry quite as much about it being catchy. Shoot for informative, include lots of links to references, and videos of you speaking if possible. Conference organizers want to know that you can stand in front of a crowd.</p>\n<h3>2. Plan to submit multiple talks to each conference</h3>\n<blockquote>\n<p>No matter how confident you are, never bet the farm on one idea — brainstorm and prepare several talks.\n<em><a href=\"https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32\">Karolina Szczur</a></em></p>\n</blockquote>\n<p>Most conferences will encourage you to submit more than one talk, and some may have an upper limit on the number of talks you can submit. Either way, it will not hurt you to submit multiple abstracts. In fact, many conferences want speakers who can give multiple talks because it cuts down on the amount of funding and coordination they have to spend working with speakers:</p>\n<blockquote>\n<p>One thing that started really getting me more speaking opportunities is submitting multiple talks to each CFP. Conference organizers sometimes have an agenda of the talks they’re looking to accept and if you submit more talks, you give them more chances to fit you into the schedule they’re looking to craft.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-keanan-koppenhaver/\">Keanan Koppenhaver</a></em></p>\n</blockquote>\n<h3>3. Consider a workshop</h3>\n<blockquote>\n<p>Workshops require a lot of preparation time that not every speaker has. You can improve your chances of being accepted by submitting such a workshop.\n<em><a href=\"https://blog.frankel.ch/advices-junior-conference-speakers/\">Nicolas Fränkel</a></em></p>\n</blockquote>\n<p>Conferences that offer workshops often struggle to find good speakers to give these 4-8 hour interactive sessions. You might be more likely to get your talk accepted if you offer it as a workshop. Keep in mind that workshops are completely different from typical conference talks though. The first time I gave a conference workshop, it took me about 20 hours of work to convert my slides into an interactive format for attendees.</p>\n<h3>4. Be persistent</h3>\n<blockquote>\n<p>If getting a talk proposal accepted seems like an unattainable goal, just keep sending in proposals and you’ll probably eventually get something accepted.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-jason-swett/\">Jason Swett</a></em></p>\n</blockquote>\n<p>In the next section, we’ll talk more about dealing with success and rejection, but ultimately you have to be persistent if you want to become a conference speaker. Most speakers I talk to have an acceptance rate of around 10%-20%, so expect to submit at least 5-10 before you get a talk accepted.</p>\n<p>Keep trying, and if you’re ready to learn more, keep reading to learn what happens when your talk is accepted or rejected from a conference.</p>\n<p><a class=\"text-left d-block\" href=\"../finding-cfps/\">Previous: Finding and Selecting CFPs</a>\n<a class=\"text-right d-block\" href=\"../success-rejection/\">Next: What Comes Next? Dealing with Success or Rejection</a></p>","frontmatter":{"layout":"post","title":"Submitting Abstracts","path":"/guides/speaking/submitting/","category":"Guides","tags":null,"date":null,"image":"https://drive.google.com/uc?id=1cTsDEdvRq7YFzKpDhMhKEGiXswxe1NDB"}}},{"post":{"html":"<p>As the day of your conference talk gets closer, there are some logistical considerations that many new speakers probably wouldn’t think about. In this section, we’ll cover all the things you should know before and up to the moment you deliver your presentation.</p>\n<!--more-->\n<p><em>This post is part of an 8-part guide to speaking at technology conferences. Be sure to <a href=\"../\">check out the other sections listed here</a>.</em></p>\n<p><img src=\"https://i.imgur.com/wXm1mhP.jpg\"></p>\n<div class=\"card bg-info-light mb-3\">\n<div class=\"card-body\">\n  <h5 class=\"card-title\">\n    <strong>Never miss a speaking opportunity again.</strong><br/>\n    Subscribe to get upcoming CFPs and new advice in your inbox every week!\n  </h5>\n  <form\n    class=\"row\"\n    action=\"https://cfpland.us15.list-manage.com/subscribe/post?u=4eba8b205fc13380cd3e6f3fc&amp;id=258f553f4e\"\n    method=\"post\"\n  >\n    <div class=\"col-sm-12 col-md-8\">\n      <input\n        name=\"EMAIL\"\n        type=\"email\"\n        class=\"form-control mb-2\"\n        id=\"emailInput\"\n        aria-label=\"Enter email to get CFPs in your inbox every week\"\n        placeholder=\"Enter email\"\n        required\n      />\n    </div>\n    <div class=\"col-sm-12 col-md-3\">\n      <button type=\"submit\" class=\"btn btn-secondary btn-block mb-2\">\n        Sign Up\n      </button>\n    </div>\n  </form>\n</div>\n</div>\n<h2>1-3 Months Before the Conference</h2>\n<h3>1. Get permission from your employer</h3>\n<p>Not every employer is as generous about speaking. Some will make you take personal days when you go to a conference, and others will make you show your presentation to the PR or legal department first to ensure you aren’t saying anything untoward. On the other hand, some companies will be thrilled that you’re representing them as a speaker and giving them a little free visibility in the community.</p>\n<p>Either way, address it early and figure out what you need to do to get their compliance.</p>\n<h3>2. Double-check the dates with the organizers</h3>\n<p>Organizing a conference is hard work, and sometimes things have to change for unforeseen reasons. While rare, it’s possible that your session could be cut, the conference may have to change its start date or location, or it may get canceled entirely.</p>\n<p>Before you spend any money or take time off work, double-check with the organizers. They also may have a special process for you to go through in order to qualify for reimbursement.</p>\n<h3>3. Book flights and hotel rooms</h3>\n<p>Once you’ve touched base with the organizers, you can go ahead and book any flights or hotel rooms. If you haven’t already, now is the time to lock in who will be paying for the trip: the conference, your employer, or you personally.</p>\n<p>In my experience, less than half of the tech conferences listed on CFP Land cover travel and hotel costs for speakers (if you want to be sure they do, you can use the <a href=\"/conferences/\">filters on CFP Land</a> to check before you apply).</p>\n<blockquote>\n<p>Reach an agreement with the organizers on what level of reimbursement they’ll provide before you accept their offer. This is more important with international travel.\n<em><a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">Nick Heiner</a></em></p>\n</blockquote>\n<p>Another common consideration is combining your conference talk with a personal vacation. For example, I’m speaking at a conference in Minneapolis this summer, but I’m going to bring my family along and stay a few extra days to see the city. If you’d like to do something similar, make sure you clear it with whoever is funding the trip, and try to schedule the vacation time <em>after</em> your talk:</p>\n<blockquote>\n<p>If you’re going to combine the conference trip with vacation, I highly recommend doing the vacation after the conference, so you’re not stressed about your talk the whole time.\n<em><a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">Nick Heiner</a></em></p>\n</blockquote>\n<h3>4. Gather necessary legal documentation</h3>\n<p>This only applies in certain circumstances, but it’s possible when speaking internationally that you’ll need a passport, tax documents, or even a visa. Talk to the organizers as they’ll likely be fielding similar questions from other speakers.</p>\n<p><img src=\"https://i.imgur.com/2LscPp7.jpg\"></p>\n<h3>5. Get details on the speaker’s dinner</h3>\n<blockquote>\n<p>I really enjoy all the people I’ve been able to meet as a result of the speaking that I’ve done. I especially enjoy chatting with people at the speaker dinners or other informal events surrounding the conference.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-keanan-koppenhaver/\">Keanan Koppenhaver</a></em></p>\n</blockquote>\n<p>Like Keanan, I’ve found speaker dinners to be one of the most valuable networking times at a conference. If the conference isn’t having one, ask the organizers if they are offering a Slack channel specifically for speakers or some other informal networking event for speakers. Take full advantage of these and plan to attend if at all possible.</p>\n<h3>6. Practice your presentation</h3>\n<p>While this is covered in more detail in the <a href=\"../presentation/\">section dedicated to creating your presentation</a>, it bears repeating. Plan time to practice your talk. You may make tweaks up until the week before, but at some point, you’ll have to lock it down and practice. Work out your timings, and make sure it fits within the time slot given.</p>\n<div class=\"card bg-info-light mb-3\">\n<div class=\"card-body\">\n  <h5 class=\"card-title\">\n    <strong>Like this guide?</strong><br/>\n    Subscribe to get advice, interviews with conference speakers, and new speaking opportunities in your inbox every week!\n  </h5>\n  <form\n    class=\"row\"\n    action=\"https://cfpland.us15.list-manage.com/subscribe/post?u=4eba8b205fc13380cd3e6f3fc&amp;id=258f553f4e\"\n    method=\"post\"\n  >\n    <div class=\"col-sm-12 col-md-8\">\n      <input\n        name=\"EMAIL\"\n        type=\"email\"\n        class=\"form-control mb-2\"\n        id=\"emailInput\"\n        aria-label=\"Enter email to get CFPs in your inbox every week\"\n        placeholder=\"Enter email\"\n        required\n      />\n    </div>\n    <div class=\"col-sm-12 col-md-3\">\n      <button type=\"submit\" class=\"btn btn-secondary btn-block mb-2\">\n        Sign Up\n      </button>\n    </div>\n  </form>\n</div>\n</div>\n<h2>1-2 Weeks Before the Conference</h2>\n<h3>1. Read over the conference website and speaker materials</h3>\n<blockquote>\n<p>Most conference organizers will create a speaker brief or handbook to convey all the key information to you about the event. They’ll cover things like who the audience is, the overall event theme, and the agreed title and content of your talk.\n<em><a href=\"https://blog.prezi.com/speaking-at-a-conference-here-are-10-things-the-organizer-wants-you-to-keep-in-mind/\">Mark Walker</a></em></p>\n</blockquote>\n<p>By this time, it’s been months since you applied and accepted your invitation, so it will be helpful to reorient yourself to the conference. This also prevents you from asking the organizers any questions that are already answered elsewhere as they’re probably very busy making final preparations for the event.</p>\n<h3>2. Figure out “last mile” transportation</h3>\n<p>At this point, you should figure out how you’ll get from the airport or train station to your hotel, and finally to the event itself. Well-prepared organizers may sort this out for you and send you instructions (I even spoke at one conference that had limousines pick us up from the airport individually!), but if not, you should look into it. A cab may be expensive, so you might want to find public transportation options, or your hotel might offer shuttle pickup and dropoff.</p>\n<p>Similarly, the conference might not be in the same building as your hotel. If you have to commute, find out if other speakers or attendees are as well, and try to coordinate with them.</p>\n<h3>3. Review the conference schedule</h3>\n<blockquote>\n<p>I try to see as many other talks as I can, though that can be difficult sometimes when my nerves are racing and my talk is still looming.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-george-mandis/\">George Mandis</a></em></p>\n</blockquote>\n<p>You should figure out where your talk fits into the conference schedule, and make note of any other talks you’d like to attend. I started off looking for content that sounded interesting, but now I actually look for speakers who I think would be good to meet and talk with and focus on going to those talks instead.</p>\n<p>You should also be aware of the timing of your talk in the day, and the other sessions that are going on at the same time. I find audiences most attentive early on, so I work a little harder to make my talks interactive if they’re just before closing or right after lunch.</p>\n<h3>4. Do you look the part?</h3>\n<blockquote>\n<p>When you take to the stage, your audience will examine every detail the way they examine a painting — as if it’s there to signify something. For better or worse, clothes serve as visual symbols, so it’s worth thinking about what your clothes are saying as the latest sentence in humanity’s very long visual conversation.\n<em><a href=\"https://hackernoon.com/dressing-for-the-stage-theatre-rules-apply-90a29614ad67\">Cassie Kozyrkov</a></em></p>\n</blockquote>\n<img src=\"https://i.imgur.com/JQ0ZiSk.jpg\" class=\"right\">\n<p>Speaking at tech conferences doesn’t mean you have to dress formally, but you should dress appropriately for the venue, audience, and content. At this point, you should make sure you’ve got a couple of good outfits to pick from and schedule a last-minute haircut (if needed).</p>\n<p>Ultimately, you should be comfortable on stage, but that doesn’t just mean wearing a grey sweatsuit. “Comfortable” means wearing something that gives you confidence and reflects your personal brand.</p>\n<h3>5. Figure out what kind of equipment will be available</h3>\n<p>I talked more about <a href=\"../presentation/\">equipment preparation in the previous section</a>, but at this point, you should double-check with the organizers to see what is available. Will they have a microphone? What kind will it be? Will you be using your laptop or a shared one? Will your power cord work there? What adapters will be available?</p>\n<blockquote>\n<p>Display is not the only point to take into account. If you’re traveling in other countries, power plugs need to be taken care of as well. European countries are mostly compatible with one another, but watch out if you come to Northern America or UK.\n<em><a href=\"https://blog.frankel.ch/advices-junior-conference-speakers/\">Nicolas Fränkel</a></em></p>\n</blockquote>\n<p>Will there be wifi on stage? How fast will it be? (always prepare for it to be slower than you think)</p>\n<blockquote>\n<p>If your presentation requires network access, it’s your responsibility to make sure the Wifi will be good enough on-site. For that, I usually ask if there will be a Wifi network dedicated for speakers: I don’t have confidence in a shared one.\n<em><a href=\"https://blog.frankel.ch/advices-junior-conference-speakers/\">Nicolas Fränkel</a></em></p>\n</blockquote>\n<p>You shouldn’t <em>have</em> to bring anything besides your laptop or presentation aids, but it’s worth asking just to be sure.</p>\n<h3>6. Mentally prepare, and keep practicing</h3>\n<blockquote>\n<p>My current routine starts with preparing my mind, about a week before I am due to give my talk. I start by booking a conference room in my office for an hour each workday morning. I use this time to practice my session out loud.\n<em><a href=\"https://www.cfpland.com/blog/speakers-mike-miles/\">Mike Miles</a></em></p>\n</blockquote>\n<p>While some experienced speakers can deliver a high-quality presentation on the fly, most recommend practicing your talk. If you can give your talk to a real audience (like at a meetup or work event) you’ll feel more confident when the conference comes, but even just practicing alone in front of a mirror can help.</p>\n<h2>When You Arrive at the Conference</h2>\n<h3>1. Scout out your room</h3>\n<blockquote>\n<p>You should also figure out what room you’ll be speaking in — are you in the keynote slot, or in a tiny side-room? Will your talk be recorded? Some conferences only record certain tracks.\n<em><a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">Nick Heiner</a></em></p>\n</blockquote>\n<p>As early as possible, you should take a look at the room you’ll be presenting in. By this point, the schedule should be finalized, so you will be able to see exactly when and where you’ll give your talk. I typically try to watch a couple talks in the room before my own so I know what it feels like as an audience member there as well.</p>\n<h3>2. Test out any media</h3>\n<blockquote>\n<p>If you have any kind of interactivity or rich media in your presentation, you absolutely have to run through it with the organizer onsite before you go on stage.\n<em><a href=\"https://blog.prezi.com/speaking-at-a-conference-here-are-10-things-the-organizer-wants-you-to-keep-in-mind/\">Mark Walker</a></em></p>\n</blockquote>\n<p>If you just need slides, this should be quick, but if you’re trying any video or live coding in your presentation, you really need to make sure the equipment available will work as soon as you arrive.</p>\n<p>Even if you asked before, there’s no substitute for knowing it works in person.</p>\n<h3>3. Follow the conference Twitter hashtag or Slack group</h3>\n<p>Finally, as you prepare to speak, it’s a good idea to plug into the audience’s conversation. Most conferences will provide an official “hashtag” on Twitter, but many also have Slack groups as well.</p>\n<p>After your presentation, you may want to check out the stream to see what the audience says about your talk.</p>\n<h2>The Hours Leading Up To Your Session</h2>\n<blockquote>\n<p>I usually find a quiet spot in the speakers room, or in the bathroom (I want to apologize to anyone who has heard my pre-talk routine), and I start imagining I just won something: pump my chest forward, straighten my shoulders, raise my fist in the air, grin widely, maybe even shout a few “Hell yeah!“s if I think the toilet is empty…it calms my nerves enough so I don’t shake as I speak.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-alex-lakatos/\">Alex Lakatos</a></em></p>\n</blockquote>\n<p>Every speaker’s pre-talk routine is different, but for many of them, having a consistent, confidence-boosting routine is helpful. There are a few things you can try as you develop a pre-talk routine:</p>\n<h3>1. Work out or walk around</h3>\n<p>I always work out or run on the morning of my conference talks. <a href=\"https://www.elitedaily.com/p/how-working-out-makes-you-more-confident-from-the-inside-out-according-to-science-8565734\">Working out helps boost my confidence</a>, but even just walking around a little helps stimulate blood flow and make you feel better.</p>\n<p><img src=\"https://i.imgur.com/7p8WBZD.jpg\"></p>\n<h3>2. Arrive early</h3>\n<blockquote>\n<p>I try to arrive in the room as early as I can after the previous speaker, and normally I run the talk through without notes while getting ready that morning.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-laurie-barth/\">Laurie Barth</a></em></p>\n</blockquote>\n<p>Organizers appreciate it when you are in the room before your talk is scheduled to begin. Try to come in at least halfway through the previous speaker’s talk so you can get set up as soon as they’re finished.</p>\n<h3>3. Talk to people</h3>\n<p>For me, talking builds momentum. If I spend a few minutes on the day of my talk conversing with fellow attendees and speakers, I feel much better about getting on stage. I’m not sure if there’s any scientific basis for this, but it works for me.</p>\n<h3>4. Sit in a quiet room</h3>\n<blockquote>\n<p>I know some speakers will hide in their hotel room up until their talk, others just talk and socialize like its nothing.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-matthew-trask/\">Matthew Trask</a></em></p>\n</blockquote>\n<p>On the other hand, I’ve met speakers who go into a dark, quiet room up until the moment they get on stage. There’s nothing wrong with this method either, so you’ll just have to figure out what works for you.</p>\n<h3>5. Listen to a pump-up playlist</h3>\n<blockquote>\n<p>I have a Presentation Pre-Pump Playlist in Google Music on my phone that I listen to right before I step on stage. The contents of the playlist is classified.\n<em><a href=\"https://www.cfpland.com/blog/speaker-anjuan-simmons/\">Anjuan Simmons</a></em></p>\n</blockquote>\n<p>Another common preparation technique is listening to music. Generally listening to upbeat music can make you feel more confident and care-free, so it makes sense that this appeals to many speakers.</p>\n<p>Going into a conference prepared is one of the best ways to ensure your success as a speaker. It’ll help you be more confident and organizers will appreciate you being proactive.</p>\n<p>If you’ve read through this entire guide, congratulations! You’ve reached the end, and you’re hopefully a little more ready to give your next conference talk. If you skipped around, be sure to <a href=\"../\">check out the other sections</a>.</p>\n<p><a class=\"text-left d-block\" href=\"../success-rejection/\">Previous: Preparing a Presentation</a></p>","frontmatter":{"layout":"post","title":"Preparing for the Conference","path":"/guides/speaking/pre-conference/","category":"Guides","tags":null,"date":null,"image":"https://drive.google.com/uc?id=1AbeTbitf6azEUSY0_-Qn8xN1Xz6Y8dB1"}}},{"post":{"html":"<p>After being accepted to give your conference talk, the next big step is to create your presentation. Even if you’ve given the talk before, you should revisit it each time you deliver it to make sure it’s appropriate for the specific audience and time allotted.</p>\n<p>While your presentation should fulfill the expectations you <a href=\"../submitting/\">set forth in your abstract</a>, there’s a big difference between writing a one-paragraph outline and creating a 60-slide deck to fill an hour of stage time! In this section, I’ll cover some tips for creating a great presentation for a technology conference.</p>\n<!--more-->\n<p><em>This post is part of an 8-part guide to speaking at technology conferences. Be sure to <a href=\"../\">check out the other sections listed here</a>.</em></p>\n<p><img src=\"https://i.imgur.com/PCKPYrR.jpg\"></p>\n<div class=\"card bg-info-light mb-3\">\n<div class=\"card-body\">\n  <h5 class=\"card-title\">\n    <strong>Never miss a speaking opportunity again.</strong><br/>\n    Subscribe to get upcoming CFPs and new advice in your inbox every week!\n  </h5>\n  <form\n    class=\"row\"\n    action=\"https://cfpland.us15.list-manage.com/subscribe/post?u=4eba8b205fc13380cd3e6f3fc&amp;id=258f553f4e\"\n    method=\"post\"\n  >\n    <div class=\"col-sm-12 col-md-8\">\n      <input\n        name=\"EMAIL\"\n        type=\"email\"\n        class=\"form-control mb-2\"\n        id=\"emailInput\"\n        aria-label=\"Enter email to get CFPs in your inbox every week\"\n        placeholder=\"Enter email\"\n        required\n      />\n    </div>\n    <div class=\"col-sm-12 col-md-3\">\n      <button type=\"submit\" class=\"btn btn-secondary btn-block mb-2\">\n        Sign Up\n      </button>\n    </div>\n  </form>\n</div>\n</div>\n<h2>Formats</h2>\n<p>Before you start creating slides, it might help to determine a format that will work for your presentation. Your talk may not fit perfectly into any one of these archetypes, but it’s helpful to start off with one of these formats and then branch out as your talk matures.</p>\n<h3>1. A novel solution to a common problem</h3>\n<blockquote>\n<p>When a new framework becomes popular, there’s often a variety of opinions about the best way to do automated testing for code that uses it. Even if your solution isn’t the best, it can become a standard if you’re the first with a conference video.\n<em><a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">Nick Heiner</a></em></p>\n</blockquote>\n<p>One of the fun things about working in technology today is that there are always new and (arguably) better solutions coming out for various problems. Most new solutions are viable candidates for a conference talk, so this format is pretty common.</p>\n<p>While the specifics vary, a typical presentation of this format might start off by introducing a problem, then talk about existing solutions, and finally give the audience a new (and again arguably better) solution.</p>\n<p>In the talk below, Pete Hunt introduces React by walking through several of the problems that the framework aims to solve. While an introductory talk on React probably won’t get much interest at a conference now, in 2013 React was brand new, so this talk was very popular.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/x7cQ3mrcKaY' frameborder='0' allowfullscreen></iframe></div>\n<p><em>React: Rethinking best practices by Pete Hunt</em></p>\n<h3>2. The hero’s journey</h3>\n<blockquote>\n<p>They learn that hey, this is hard, and it’s ok to struggle. This person, who must be smart because they’re up there on the stage, makes mistakes. I make mistakes too, so we’re kind of similar. They conquered their problem, so maybe I can conquer mine.\n<em><a href=\"http://jumpstartlab.com/news/archives/2014/02/15/prototypical-conference-talks\">Jeff Casimir</a></em></p>\n</blockquote>\n<p>A common pattern for storytelling is <a href=\"https://en.wikipedia.org/wiki/Hero%27s_journey\">the hero’s journey</a>. You may not have heard this term, but you’ve definitely seen it played out in hundreds of movies, TV shows, and books. The way it works in a conference talk is:</p>\n<ol>\n<li>You introduce yourself in a happy initial state,</li>\n<li>Something happens that upsets your initial state,</li>\n<li>You reluctantly start a journey to resolve the conflict,</li>\n<li>You reach a low point when your initial assumption fails,</li>\n<li>And finally, you emerge victorious by solving the problem.</li>\n</ol>\n<p>There are variations on this theme, but if your talk is meant to be more personal or story-driven, this is a good format to use.</p>\n<p>Hero’s Journey Illustration: <a href=\"https://i.imgur.com/Bv2Quqe.png\">https://i.imgur.com/Bv2Quqe.png</a></p>\n<p>In the talk below, TJ VanToll walks the audience through his process of changing his mind about Typescript. Along the way, we learn about the language and why it’s ultimately superior in some cases.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/w6rdLx2LYz8' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Why I Was Wrong About TypeScript by TJ VanToll</em></p>\n<h3>3. The tech-heavy deep dive</h3>\n<blockquote>\n<p>These talks focus on something that’s cool but that not many engineers get to work with on a day to day basis.\n<a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">Nick Heiner</a></p>\n</blockquote>\n<p>A lot of tech people like technical deep dives because they’re inspiring. Most of us don’t use all the cutting edge technology available day-to-day, so we appreciate hearing from those who do.</p>\n<p>Additionally, this structure of talk can show people how to use things better that they may already know at a surface level.</p>\n<blockquote>\n<p>One of my favorite forms is the deep dive. This is what I might call the Pat Shaughnessy talk. It’s been a long time since I studied undergrad Computer Science, and I didn’t understand a lot of it the first time around.\n<em><a href=\"http://jumpstartlab.com/news/archives/2014/02/15/prototypical-conference-talks\">Jeff Casimir</a></em></p>\n</blockquote>\n<p>Here’s one of Pat Shaughnessy’s talks - a deep dive into ActiveRecord. While most Ruby on Rails developers at the conference have used ActiveRecord, most of them probably don’t know exactly how it works under the hood, so they get a lot of value out of learning these mysterious internals.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/rnLnRPZZ1Q4' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Twenty Thousand Leagues Under ActiveRecord by Pat Shaughnessy</em></p>\n<h3>4. The live demo</h3>\n<p>Live demos are among the most impressive (when they work) and the most underwhelming (when they don’t) talks I’ve ever seen at a conference.</p>\n<p>On the one hand, live coding a working application and showing the audience the results is a great way to illustrate how easy a new framework or tool can be. It’s inspiring and impressive to watch, and you’ll get some big “oohs” and “ahhs” when it goes perfectly.</p>\n<p>On the other hand, it rarely goes perfectly.</p>\n<blockquote>\n<p>“Have backups. If your demo breaks on stage, revert to showing the video of the same thing in action.”\n<em><a href=\"https://dev.to/tlakomy/what-i-wished-someone-told-me-about-speaking-at-tech-conferences-3opp\">Tomasz Lakomy</a></em></p>\n</blockquote>\n<p>I saw one live coding talk where the presenter accidentally deleted his whole template and all his notes just minutes before the talk. He was so flustered that he had to bow out early and apologize for being ill-prepared. That’s probably the worst-case scenario.</p>\n<p>If you do choose to attempt a live demo have a robust backup plan, practice a ton, and make sure you can test it out on the same equipment you’ll use for the actual presentation.</p>\n<p>In this example, Andrew Sorensen live codes a concert for his audience. While he’s working, he explains what’s happening and never drops a note. Best of all, he keeps the whole show to a tight 10-minute time slot. This is really impressive, and I can’t imagine how much preparation has gone into it.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/yY1FSsUV-8c' frameborder='0' allowfullscreen></iframe></div>\n<p><em>The Concert Programmer by Andrew Sorensen</em></p>\n<div class=\"card bg-info-light mb-3\">\n<div class=\"card-body\">\n  <h5 class=\"card-title\">\n    <strong>Like this guide?</strong><br/>\n    Subscribe to get advice, interviews with conference speakers, and new speaking opportunities in your inbox every week!\n  </h5>\n  <form\n    class=\"row\"\n    action=\"https://cfpland.us15.list-manage.com/subscribe/post?u=4eba8b205fc13380cd3e6f3fc&amp;id=258f553f4e\"\n    method=\"post\"\n  >\n    <div class=\"col-sm-12 col-md-8\">\n      <input\n        name=\"EMAIL\"\n        type=\"email\"\n        class=\"form-control mb-2\"\n        id=\"emailInput\"\n        aria-label=\"Enter email to get CFPs in your inbox every week\"\n        placeholder=\"Enter email\"\n        required\n      />\n    </div>\n    <div class=\"col-sm-12 col-md-3\">\n      <button type=\"submit\" class=\"btn btn-secondary btn-block mb-2\">\n        Sign Up\n      </button>\n    </div>\n  </form>\n</div>\n</div>\n<h2>Conference Presentation Tools</h2>\n<p>Once you land on a format for your talk, you’ll need to decide which tools you want to use to give the presentation. I’d recommend using the tools you’re most familiar with until you get really comfortable speaking on stage. Once you’ve done this a few times, you can try to get creative, but don’t buck the system your first time.</p>\n<h3>1. Slides</h3>\n<p>Most talks center around a slideshow. PowerPoint and Google Slides are probably the most common options, but <a href=\"https://prezi.com/\">Prezi</a> and <a href=\"https://revealjs.com/#/\">Reveal</a> are also good choices. Again, start with the tools you’re most comfortable with and experiment later.</p>\n<h3>2. Audio-Visual Aids</h3>\n<p>Some speakers like to show short video clips during their presentation. If you do this, be very certain you know the audio will work once it’s up on the big screen. There’s nothing worse than trying to put the microphone near your tiny laptop speakers to amplify the sound.</p>\n<h3>3. Microphone</h3>\n<p>Generally, the conference will provide a microphone if it’s necessary, but I’ve met a few speakers who bring their own because they want to be sure it’s a device they’re used to. The downside to this is that you’ll have to coordinate with the conference’s AV team, and some conferences may not make special accommodations like this.</p>\n<h3>4. Remote</h3>\n<p>I like to walk around while I’m on stage, so when possible, I bring a remote to advance my slides. You can get one for cheap online, or you could try to use a wireless mouse in a pinch. Most conferences don’t provide this for you.</p>\n<h3>5. Laptop</h3>\n<p>Finally, you’ll likely need a device to present from. While occasionally conferences will provide one, most prefer you connect your own before you speak. Be sure your battery will last for the duration of your talk and don’t count on a charger being available.</p>\n<p>I mention all these accessories here because you probably want to practice with the same devices you use for the real thing.</p>\n<h2>Building Your Presentation</h2>\n<p>Much of the same advice that applies when <a href=\"../submitting/\">writing your abstract</a> also applies when creating your presentation, but I’d like to point out a few key tips for creating your slide deck and delivering your presentation.</p>\n<h3>1. Mix stories and information</h3>\n<blockquote>\n<p>Stories, metaphors, examples, jokes, pictures, videos and other props are all excellent ways to keep things interesting, but make sure that they clearly relate to your core takeaways.\n<em><a href=\"https://blog.prezi.com/speaking-at-a-conference-here-are-10-things-the-organizer-wants-you-to-keep-in-mind/\">Mark Walker</a></em></p>\n</blockquote>\n<p>No matter what format you use for your presentation, the best ones are a mix of stories and factual guidance or information. The most common weakness that technology speakers present is not including any interesting anecdotes to help capture their audience’s attention.</p>\n<p>Every speaker and talk is different, but as you build your presentation, make sure that you’re weaving in stories that illustrate your points.</p>\n<h3>2. Use slides for illustrations</h3>\n<blockquote>\n<p>People can only process one inbound message at a time. They will either listen to you or read your slides; they cannot do both.\n<em><a href=\"https://www.duarte.com/wean-yourself-from-presentation-slides/\">Mark Duarte</a></em></p>\n</blockquote>\n<p>Another common mistake speakers make is to fill every slide with bullet points. Because your audience can only listen <em>or</em> read, you should be very careful with the amount of text you cram into a slide.</p>\n<p>This can be a hard habit to break, but it might help to set up speaker notes so that you can look at your bullet points while your audience can actually listen to you or look at an image that frames your topic on the screen.</p>\n<blockquote>\n<p>Your slides only really serve three good purposes: entertainment, illustration, and roadmap. Anything else is distracting your audience from listening to you.\n<em><a href=\"https://hackernoon.com/dressing-for-the-stage-theatre-rules-apply-90a29614ad67\">Cassie Kozyrkov</a></em></p>\n</blockquote>\n<h3>3. First and last slides</h3>\n<blockquote>\n<p>I always set the conference logo on the cover slide. The people behind the conference have put a lot of effort into the organization, it’s only fair play to promote their brand by doing so. Plus, they generally provide logos, so it’s a no-brainer.\n<em><a href=\"https://blog.frankel.ch/advices-junior-conference-speakers/\">Nicolas Fränkel</a></em></p>\n</blockquote>\n<p>Your cover slide will spend a little time on screen while you get set up and your audience gets settled. For that reason, you should probably include the title of your talk (that way people will know they’re in the right place), your name, and the name or logo of the conference you’re speaking at. If the talk is being recorded this is especially important as it will serve to introduce future online viewers as well.</p>\n<p>Your last slide should probably include contact information (if you want to provide it) and a link to your slides or notes so that anyone who wants more detail can go find it. This last slide will probably be up for Q&#x26;A and until the next speaker is ready to take the stage.</p>\n<h3>4. Humor</h3>\n<blockquote>\n<p>Keep politics and religion out of your sessions. Also, avoid sexualized imagery, and try not to be an asshole about other people to make a point.\n<em><a href=\"https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/\">Jono Bacon</a></em></p>\n</blockquote>\n<img src=\"https://i.imgur.com/Uk7Zl4m.jpg\" class=\"right\">\n<p>While you want to be an entertaining speaker, you were not invited to this conference as a standup comedian. Making a programming joke or two during a technical talk is probably okay, but anything that could be considered “dark”, “edgy”, or “controversial” should probably not be included.</p>\n<p>If you are unsure, practice your jokes with a trusted friend or colleague first. Everyone likes a funny speaker, but you don’t want to be remembered as the speaker who offended half the room by going too far.</p>\n<h3>5. Practice</h3>\n<blockquote>\n<p>Stand up and practice out loud. If you screw something up, do not stop. You won’t get to repeat the whole talk on stage so having those prep sessions at home will make you well prepared for any mishap that might happen on stage.\n<em><a href=\"https://dev.to/tlakomy/what-i-wished-someone-told-me-about-speaking-at-tech-conferences-3opp\">Tomasz Łakomy</a></em></p>\n</blockquote>\n<p>I’ve met a few speakers who know their subject matter so well that they don’t really practice anymore, but this is rare. Almost all of the best speakers I’ve talked with practice a lot, especially with a new talk. I typically run through my talk at least 25 times before I give it on stage at a conference.</p>\n<p>At the same time, you don’t want to sound robotic, so don’t memorize a speech word-for-word. Instead, work of bullet points or notes to give you a good idea of which stories and information come at what times. The only things you might want to rehearse to the point of memorization are your opening line, your closing line, and key transition points.</p>\n<blockquote>\n<p>Local user group meetups are always looking for speakers so if you approach them you will rarely hear a, ‘no.’\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-geshan-manandhar/\">Geshan Manandhar</a></em></p>\n</blockquote>\n<p>Practicing alone in front of a mirror is step 1, but most speakers recommend also getting some practice in front of a real group of people. Invite a few of your coworkers to a lunch-and-learn or submit your talk to a Meetup group. As the organizer of a Meetup in Chicago, I can tell you that we always like getting talks submitted by the community.</p>\n<h3>6. Smile and look like you’re having fun</h3>\n<blockquote>\n<p>Enjoy being on the stage and sharing your learnings and experience. Smile! Tell a joke. Be human, and you’ll notice the audience respond to you.\n<em><a href=\"https://blog.prezi.com/speaking-at-a-conference-here-are-10-things-the-organizer-wants-you-to-keep-in-mind/\">Mark Walker</a></em></p>\n</blockquote>\n<p>Finally, as you practice the transitions and mechanics of your talk, remember to smile and convey enthusiasm. Even if you’re actually a nervous wreck underneath, people in the audience can rarely tell if you put on a brave face. Faking enthusiasm and calm usually helps keep you that way, so it’s okay if this doesn’t feel natural at first.</p>\n<p>Creating a presentation for a conference talk is a never-ending job. You’ll probably refine your talks each time you give them, customize them based on the time slot and audience, and learn new things to add every year. As you do, keep in mind the presentation tips above.</p>\n<p>Now that you’ve started preparing your presentation, it’s time to get ready for the conference itself. In the next section, we’ll talk about the pre-conference and pre-talk logistics and best practices you should know about as a new speaker.</p>\n<p><a class=\"text-left d-block\" href=\"../success-rejection/\">Previous: Dealing with Success or Rejection</a>\n<a class=\"text-right d-block\" href=\"../pre-conference/\">Next: Preparing for the Conference</a></p>","frontmatter":{"layout":"post","title":"Preparing a Conference Presentation","path":"/guides/speaking/presentation/","category":"Guides","tags":null,"date":null,"image":"https://drive.google.com/uc?id=11nJ2Hnc3CkmrU97ZV83nP0SB0EV80s_K"}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"category":"Guides"}}