{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"3633f200-0520-56f4-a16e-1508fae62dfb","html":"<p>As the day of your conference talk gets closer, there are some logistical considerations that many new speakers probably wouldn’t think about. In this section, we’ll cover all the things you should know before and up to the moment you deliver your presentation.</p>\n<h2>1-3 Months Before the Conference</h2>\n<h3>1. Get permission from your employer</h3>\n<p>Not every employer is as generous about speaking. Some will make you take personal days when you go to a conference, and others will make you show your presentation to the PR or legal department first to ensure you aren’t saying anything untoward. On the other hand, some companies will be thrilled that you’re representing them as a speaker and giving them a little free visibility in the community.</p>\n<p>Either way, address it early, and figure out what you need to do to get their compliance.</p>\n<h3>2. Double check the dates with the organizers</h3>\n<p>Organizing a conference is hard work, and sometimes things have to change for unforeseen reasons. While rare, it’s possible that your session could be cut, the conference may have to change its start date or location, or it may get cancelled entirely.</p>\n<p>Before you spend any money or take time off work, double check with the organizers. They also may have a special process for you to go through in order to qualify for reimbursement.</p>\n<h3>3. Book flights and hotel rooms</h3>\n<p>Once you’ve touched base with the organizers, you can go ahead and book any flights or hotel rooms. If you haven’t already, now is the time to lock in who will be paying for the trip: the conference, your employer, or you personally.</p>\n<p>In my experience, less than half of the tech conferences listed on CFP Land cover travel and hotel cost for speakers (if you want to be sure they do, you can use the <a href=\"/conferences/\">filters on CFP Land</a> to check before you apply).</p>\n<blockquote>\n<p>Reach an agreement with the organizers on what level of reimbursement they’ll provide before you accept their offer. This is more important with international travel.\n<em><a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">Nick Heiner</a></em></p>\n</blockquote>\n<p>Another common consideration is combining your conference talk with a personal vacation. For example, I’m speaking at a conference in Minneapolis this summer, but I’m going to bring my family along and stay a few extra days to see the city. If you’d like to do something similar, make sure you clear it with whoever is funding the trip, and try to schedule the vacation time <em>after</em> your talk:</p>\n<blockquote>\n<p>If you’re going to combine the conference trip with vacation, I highly recommend doing the vacation after the conference, so you’re not stressed about your talk the whole time.\n<em><a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">Nick Heiner</a></em></p>\n</blockquote>\n<h3>4. Gather necessary legal documentation</h3>\n<p>This only applies in certain circumstances, but it’s possible when speaking internationally that you’ll need a passport, tax documents, or even a visa. Talk to the organizers as they’ll likely be fielding similar questions from other speakers.</p>\n<h3>5. Get details on the speaker’s dinner</h3>\n<blockquote>\n<p>I really enjoy all the people I’ve been able to meet as a result of the speaking that I’ve done. I especially enjoy chatting with people at the speaker dinners or other informal events surrounding the conference.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-keanan-koppenhaver/\">Keanan Koppenhaver</a></em></p>\n</blockquote>\n<p>Like Keanan, I’ve found speaker dinners to be one of the most valuable networking times at a conference. If the conference isn’t having one, ask the organizers if they are offering a Slack channel specifically for speakers or some other informal networking event for speakers. Take full advantage of these and plan to attend if at all possible.</p>\n<h3>6. Practice your presentation</h3>\n<p>While this is covered in more detail in the <a href=\"../presentation/\">section dedicated to creating your presentation</a>, it bears repeating. Plan time to practice your talk. You may make tweaks up until the week before, but at some point you’ll have to lock it down and practice. Work out your timings, and make sure it fits within the time slot given. </p>\n<h2>1-2 Weeks Before the Conference</h2>\n<h3>1. Read over the conference website and speaker materials</h3>\n<blockquote>\n<p>Most conference organizers will create a speaker brief or handbook to convey all the key information to you about the event. They’ll cover things like who the audience is, the overall event theme, and the agreed title and content of your talk.\n<em><a href=\"https://blog.prezi.com/speaking-at-a-conference-here-are-10-things-the-organizer-wants-you-to-keep-in-mind/\">Mark Walker</a></em></p>\n</blockquote>\n<p>By this time, it’s been months since you applied and accepted your invitation, so it will be helpful to reorient yourself to the conference. This also prevents you from asking the organizers any questions that are already answered elsewhere as they’re probably very busy making final preparations for the event. </p>\n<h3>2. Figure out “last mile” transportation</h3>\n<p>At this point you should figure out how you’ll get from the airport or train station to your hotel, and finally to the event itself. Well-prepared organizers may sort this out for you and send you instructions (I even spoke at one conference that had limousines pick us up from the airport individually!), but if not, you should look into it. A cab may be expensive, so you might want to find public transportation options, or your hotel might offer shuttle pickup and dropoff.</p>\n<p>Similarly, the conference might not be in the same building as your hotel. If you have to commute, find out if other speakers or attendees are as well, and try to coordinate with them.</p>\n<h3>3. Review the conference schedule</h3>\n<blockquote>\n<p>I try to see as many other talks as I can, though I that can be difficult sometimes when my nerves are racing and my talk is still looming.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-george-mandis/\">George Mandis</a></em></p>\n</blockquote>\n<p>You should figure out where your talk fits into the conference schedule, and make note of any other talks you’d like to attend. I started off looking for content that sounded interesting, but now I actually look for speakers who I think would be good to meet and talk with and focus on going to those talks instead.</p>\n<p>You should also be aware of the timing of your talk in the day, and the other sessions that are going on at the same time. I find audiences most attentive early on, so I work a little harder to make my talks interactive if they’re just before closing or right after lunch.</p>\n<h3>4. Do you look the part?</h3>\n<blockquote>\n<p>When you take to the stage, your audience will examine every detail the way they examine a painting — as if it’s there to signify something. For better or worse, clothes serve as visual symbols, so it’s worth thinking about what your clothes are saying as the latest sentence in humanity’s very long visual conversation.\n<em><a href=\"https://hackernoon.com/dressing-for-the-stage-theatre-rules-apply-90a29614ad67\"></a></em></p>\n</blockquote>\n<p>Okay, I’m not big on looks, fashion, or </p>\n<ul>\n<li>What kind of equipment will they have?</li>\n<li>\n<p>Prepare</p>\n<ul>\n<li>“My current routine starts with preparing my mind, about a week before I am due to give my talk. I start by booking a conference room in my office for an hour each workday morning. I use this time to practice my session out loud.” - <a href=\"https://www.cfpland.com/blog/speakers-mike-miles/\">https://www.cfpland.com/blog/speakers-mike-miles/</a></li>\n</ul>\n</li>\n<li>\n<p>Clicker or pointer?</p>\n<ul>\n<li>Conference may provide it, may not.</li>\n</ul>\n</li>\n<li>Twitter hashtag</li>\n<li>\n<p>Equipment/adapters</p>\n<ul>\n<li>“Display is not the only point to take into account. If you’re travelling in other countries, power plugs need to be taken care of as well. European countries are mostly compatible with one another, but watch out if you come to Northern America or UK.” - <a href=\"https://blog.frankel.ch/advices-junior-conference-speakers/\">https://blog.frankel.ch/advices-junior-conference-speakers/</a></li>\n</ul>\n</li>\n<li>\n<p>Wifi?</p>\n<ul>\n<li>“If your presentation requires network access, it’s your responsibility to make sure the Wifi will be good enough on-site. For that, I usually ask if there will be a Wifi network dedicated for speakers: I don’t have confidence in a shared one.” - <a href=\"https://blog.frankel.ch/advices-junior-conference-speakers/\">https://blog.frankel.ch/advices-junior-conference-speakers/</a></li>\n</ul>\n</li>\n<li>\n<p>Media?</p>\n<ul>\n<li>“if you have any kind of interactivity or rich media in your presentation, you absolutely have to run through it with the organizer onsite before you go on stage.” - <a href=\"https://blog.prezi.com/speaking-at-a-conference-here-are-10-things-the-organizer-wants-you-to-keep-in-mind/\">https://blog.prezi.com/speaking-at-a-conference-here-are-10-things-the-organizer-wants-you-to-keep-in-mind/</a></li>\n</ul>\n</li>\n<li>\n<p>Room?</p>\n<ul>\n<li>“You should also figure out what room you’ll be speaking in — are you in the keynote slot, or in a tiny side-room? Will your talk be recorded? Some conferences only record certain tracks.”</li>\n</ul>\n</li>\n</ul>\n<h2>When You Arrive at the Conference</h2>\n<h2>1-2 Hours Before Your Session</h2>\n<ul>\n<li>Arrive at your session early</li>\n<li>\n<p>Get pumped up:</p>\n<ul>\n<li>“I have a Presentation Pre-Pump Playlist in Google Music on my phone that I listen to right before I step on stage. The contents of the playlist is classified.”</li>\n</ul>\n</li>\n</ul>","frontmatter":{"layout":"post","title":"Preparing for the Conference","path":"/guides/speaking/pre-conference/","category":"Guides","tags":null,"date":null,"image":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}