{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"3892203b-1500-5310-a244-55fb43f05116","html":"<h2>How Do Speakers Get Chosen?</h2>\n<ul>\n<li>Conference committee</li>\n<li>CFP - “I wish I had realized sooner that you don’t always have to be personally invited to speak at events. Now that I’m aware of the CFP process, I’m speaking regularly at conferences across the country.” - <a href=\"https://www.cfpland.com/blog/speakers-story-laura-janusek/\">Laura Janusek</a></li>\n<li>Abstracts</li>\n<li>Confirming speakers - go through multiple rounds</li>\n</ul>\n<h2>Why do speakers get chosen?</h2>\n<p>“A typical conference selection team will be reading dozens or hundreds of session proposals…That means conference organizers are going to skim, they’re going to skip over anything that doesn’t catch their attention early on, they’re going to skip based on the title, and many if not most will automatically discount anything with obvious typographical and grammar mistakes.” - <a href=\"https://www.garfieldtech.com/blog/3-paragraph-pitch\">https://www.garfieldtech.com/blog/3-paragraph-pitch</a></p>\n<ul>\n<li>\n<p>Great abstract</p>\n<ul>\n<li>See chapter 5</li>\n</ul>\n</li>\n<li>Interesting/unique/aligned topic</li>\n<li>\n<p>Mix of big picture and niche topics:</p>\n<ul>\n<li>“having big picture sessions can make for a very generic program. As such, a limited number of big picture presentations tend to get picked with a larger number of more specialist topics.” - <a href=\"https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/\">https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/</a></li>\n</ul>\n</li>\n<li>\n<p>Qualified to speak on topic</p>\n<ul>\n<li>“Why should I listen to them? Are they an amazing speaker and will give a great performance? Are they an expert in a field that they can speak authoritatively on? Do they have some unique experience that makes their content special or different? You can’t identify yourself here, but you can identify traits or facts about yourself. Did you win “best comedic presentation” at your local toastmasters? Were you in every theatre play and musical production in school? Did you write an open source tool or library that deals heavily with the topics involved? Have you spoken before? It doesn’t have to be at a conference, tell me about your love for speaking at school or user groups, something that indicates your general ability to give a well thought out and prepared talk. Where did you speak? How was it received? What audiences did you resonate with? Did you write a book? Where do you work? Do you hate with a passion due to ? How did you find the topic you’re submitting about, and what makes you the best person to speak on it?” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n</ul>\n</li>\n<li>Cost of transportation/hotel</li>\n<li>\n<p>Known to be reliable/good speaker</p>\n<ul>\n<li>“The most biggest conferences may have selection processes that favor experienced speakers, since they don’t want to risk a 50-minute time slot on an unknown quantity.” - <a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0</a></li>\n<li>Not too egotistical: “Program committees often don’t want ego-ridden sessions, not just because they are annoying, but also because they often become advertising carousels for the speaker’s books, videos, events, and other material they are schlepping.” - <a href=\"https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/\">https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/</a></li>\n</ul>\n</li>\n<li>\n<p>Well known in community</p>\n<ul>\n<li>“Famous speakers will tend to attract money, in the form of more/better sponsors and more attendees.” - <a href=\"https://blog.frankel.ch/advices-junior-conference-speakers/\">https://blog.frankel.ch/advices-junior-conference-speakers/</a></li>\n</ul>\n</li>\n<li>Paid to play</li>\n</ul>\n<p><a class=\"text-left d-block\" href=\"../why-speak\">Previous: Why Speak? 11 Reasons People Get on Stage</a>\n<a class=\"text-right d-block\" href=\"../finding-cfps/\">Next: Finding and Selecting CFPs</a></p>","frontmatter":{"layout":"post","title":"How Conferences Choose Their Speakers","path":"/guides/speaking/how-conferences-choose/","category":"Guides","tags":null,"date":null,"image":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}