{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"f9b5e836-1578-5e74-9db5-95ae12899e58","html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>This week, I interviewed Rhia Dixon, a relatively new conference speaker who’s been accepted to speak at 6 conferences in her first year on the stage! While new to speaking at conferences, Rhia obviously has a gift for communication, and sometimes beginners are actually the best people to take advice from. Read on to hear Rhia’s fresh approach to tech conference speaking and some of the fantastic women in tech who have inspired her.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/GLa6cwP.png\" class=\"right\">\n<p>I’m a software engineer from Kansas City, Missouri. I love to tech, and I love to share the cool things I’ve learned with other people.</p>\n<p>I have always enjoyed going to schools to speak to students, but I was intrigued by conference speaking. One fateful evening I told <a href=\"https://twitter.com/likeOMGitsFEDAY\">Jennifer Wadella</a>, founder of Kansas City Women in Technology, that I was interested in speaking at tech conferences. She volunteered to be my mentor, set me up with resources for writing abstracts, and she sent me links to open CFPs for various conferences for me to begin submitting those abstracts. It felt like a whirlwind of events…I was writing abstracts the first week of December 2018, submitting those to conferences within the next week, and I got my first acceptance in January!</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>What I like about public speaking is that it puts me in a new place to help other people. I am thrilled that I’m providing content that people want to hear, and content that they can take something from to apply to their lives.</p>\n<p>I do believe it has benefited my career, and it has helped me to shine a light on the things I believe are great.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first conference was DevFest KC this past February in Kansas City. <strong>I was super nervous, and I told the audience this was my first time speaking at a conference. I’m used to trying to engage small groups of teenagers, not 20-40 adults.</strong> However, I needn’t have worried so much. My audience was engaged, they asked questions, and they were eager to participate. By the end of the talk, they didn’t believe that was my first time.</p>\n\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 56.25%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <iframe src=\"https://player.vimeo.com/video/312227563\" frameborder=\"0\" allow=\"autoplay; fullscreen\" allowfullscreen style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          \n<p><a href=\"https://vimeo.com/312227563\">Rhia Dixon at the KC Women in Technology 2019 Kickoff</a></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>At the time of this response, I have applied to 28 conferences. Thus far, I have been accepted to speak at 6 of the 16 conferences that have announced their speakers (1 of which I’ve already done).</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>My pre-talk routine consists of taking one last look at my slides, a few deep breaths, and listening to whatever song that currently has my ears hostage (typically something upbeat and relatively positive with great musicality).</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>I would pass on some of the best advice I’ve received:</p>\n<ul>\n<li>Pick a topic that you wouldn’t mind speaking about for hours and make it interesting for the version of you that would benefit from the talk.</li>\n<li>Write your abstract in such a way that the reader gets a pretty good understanding of why they should be at your talk and what they will get from attending.</li>\n<li>While you may not feel like the expert on this topic, the people listening to you came to hear YOU! Remember you’ve got friends in the audience — some you may know, and some you may not know…yet.</li>\n<li>Find people from varying backgrounds to read your abstracts — <strong>I have a speaker in tech, a speaker not in tech, and a non-speaker in tech review all of my abstracts to tell me what they think the point is, what they would expect to learn, and offer alternative titles.</strong> I’ve found this particularly helpful for tweaking my abstracts and tailoring my talks.</li>\n</ul>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>Oh, I have plenty! <a href=\"https://twitter.com/likeOMGitsFEDAY\">Jennifer Wadella</a> is one of my favorites — I know her, she’s relatable, she doesn’t take herself too seriously, and she has a ball on stage sharing what she knows. I’m also inspired by <a href=\"https://twitter.com/techgirl1908\">Angie Jones</a> and <a href=\"https://twitter.com/DrShirleyDavis\">Dr. Shirley Davis</a>. I aspire to these levels of awesomeness and badassery.</p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>I’m pretty active on <a href=\"https://twitter.com/TheFakeRiRi\">Twitter (@TheFakeRiRi)</a>, and I post <a href=\"https://www.rhiadixon.com\">my upcoming conferences on my website</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Rhia Dixon, Software Engineer and Breakout Speaker","path":"/blog/speakers-story-rhia-dixon/","category":"Speaker's Story","tags":null,"date":"2019/05/31","image":"https://i.imgur.com/GLa6cwP.jpg"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}