{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"087ae73c-388f-5446-b10f-e5d34fd03ed7","html":"<p>I launched <a href=\"/members/\">CFP Land Pro</a> back in 2019. After gathering feedback from hundreds of technology conference speakers, I realized that like me, many of them struggled to find and keep up with which CFPs were available and which ones they had applied to. Additionally, I wanted to find a way to make sure CFP Land was self-sustaining, so CFP Land Pro was born.</p>\n<p>If you’re considering a <a href=\"/members/\">Pro Membership</a>, read on to learn more about everything that’s included. Don’t hesitate to <a href=\"mailto:info@cfpland.com\">email me</a> if you have questions about how CFP Land can help you be a more successful speaker.</p>\n<!--more-->\n<h2><span id=\"early-access\">1. Early Access to CFPs</span></h2>\n<p>The weekly CFP Land newsletter and <a href=\"/conferences/\">our free conference listings</a> show all CFPs that close in the next 21 days. Usually this is plenty of time to apply, but many conferences review applicants on a rolling basis. In those cases, <strong>applying as early as possible is advantageous</strong>.</p>\n<p>One of the most popular features among Pro Members is the early access to CFPs. If you’re not a Pro Member already, you won’t see any conferences tagged <code class=\"language-text\">⬆️ Pro</code> in your feed, but if you sign up for a Pro Membership, here’s what it looks like:</p>\n<p><a href=\"/members/\"><img src=\"/img/posts/pro-early-access.png\" alt=\"Pro Members get access to CFPs 21 days before free members\"></a></p>\n<p>As a Pro Member, you can see all the CFPs in our database that are closing in the next <strong>42 days</strong>, meaning you’ll be able to apply much earlier than free users.</p>\n<h2><span id=\"save-cfps\">2. Save CFPs</span></h2>\n<p><a href=\"/members/\"><img src=\"/img/posts/save-cfps-1.gif\" class=\"right\" alt=\"Save conferences to be reminded before they close\"></a></p>\n<p>It’s easy to lose track of which CFPs you want to submit when there are hundreds each month on CFP Land alone. <strong>Saving CFPs is a great way to keep up with the conferences that you care about most.</strong></p>\n<p>Once you save a CFP to your Pro account, you’ll get email reminders 21, 7, and 3 days before it closes. This is great if you’re browsing CFPs on mobile, but you don’t want to forget to submit to them when you’re back at your computer.</p>\n<p>Another useful reason to save CFPs is to personalize your feed of upcoming Calls for Proposals. By default, there may be 50 to 100 open CFPs on the “All” page, so saving CFPs will ensure you don’t have to wade through quite as many irrelevant conferences.</p>\n<h2><span id=\"export-cfps\">3. Export CFPs to Your Personal Calendar</span></h2>\n<p><a href=\"/members/\"><img src=\"/img/posts/export-cfps-2.gif\" alt=\"Using CFP Land Pro to export conferences to your calendar\"></a></p>\n<p>You don’t have to track your CFPs in CFP Land. Pro Members also get a calendar export tool that allows you to save CFPs to Google Calendar, Apple Calendar, or Outlook.</p>\n<p>This is helpful if you want to create custom reminders or use your own calendar notifications rather than the CFP Land emails.</p>\n<h2><span id=\"search-alerts\">4. Custom Search Alerts</span></h2>\n<p><a href=\"/members/\"><img src=\"/img/posts/saved-search-2.gif\" alt=\"Saving searches with your CFP Land Pro Membership\"></a></p>\n<p>All CFP Land users can use filters to search for conferences that match their preferences, but if you’re a free user, you will need to check the site periodically to make sure you don’t miss any new opportunities. In order to make your life a little easier, <strong>CFP Land Pro Members can save their searches to get an email alert when new CFPs are found that match their filters.</strong></p>\n<p><a href=\"/members/\"><img src=\"/img/posts/saved-search-3.png\" class=\"right\" alt=\"Email alert when results from a saved search are found\" /></a></p>\n<p>When a new conference CFP is found that matches one of your saved searches, you’ll get an email about it, letting you know that you can either <a href=\"/blog/pro-saving-cfps/\">Save the CFP</a> or apply right away.</p>\n<p>Hopefully you’ll never miss another great CFP once you set up your searches on <a href=\"/members/\">CFP Land Pro</a>.</p>\n<h2><span id=\"abstracts\">5. Save Your Abstracts</span></h2>\n<p><a href=\"/members/\"><img src=\"/img/posts/abstracts.png\" alt=\"Abstracts on CFP Land Pro\"></a></p>\n<p>Most experienced speakers have a pool of abstracts that they could submit depending on the audience and conference focus. CFP Land Pro Members can save those Abstracts to their CFP Land account so that they can tie them to each CFP they submit.</p>\n<p>This is a great way to see which of your abstracts is the most successful and to remember which Abstract you submitted to which conference.</p>\n<h2><span id=\"track\">6. Track Your Submissions</span></h2>\n<p><a href=\"/members/\"><img src=\"/img/posts/track.gif\" alt=\"Track submissions on CFP Land Pro\"></a></p>\n<p>Finally, if you submit dozens of Abstracts per year, it can be hard to keep up with all of them. In my first year of speaking, I used a giant spreadsheet to track over 50 submissions, and it got to be a huge mess.</p>\n<p>CFP Land Pro Members can track the conferences they’ve applied to, been accepted at, and been rejected from in addition to attaching their Abstracts to each submission.</p>\n<hr>\n<p>Much more will be coming soon, so if you’re interested, <a href=\"/members/\">your CFP Land Pro Membership is just a few clicks away</a>!</p>","frontmatter":{"layout":"post","title":"Pro Members Only: A Complete List of All the Features CFP Land Pro Members Get","path":"/blog/pro-features/","category":"Updates","tags":["Pro Features"],"date":"2020/02/07","image":"/img/posts/pro-early-access.png"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}