{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"3a5e7d36-a593-58af-a3cc-c7833f0caa94","html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Accessibility (shortened “a11y”) is a huge </p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/sZRtBDT.jpg?1\" class=\"left\">\n<p>My name is Adrián Bolonio. I’m an experienced Spanish Frontend developer and Web Team Lead, focusing now in Web Accessibility (a11y), and since 2012 I’m living and working in Vienna. I currently work at <a href=\"www.willhaben.at\">willhaben</a>, the biggest classified company in Austria with the 2nd highest traffic of all Austrian websites.</p>\n<p>I started speaking at local meetups in Vienna, such as ViennaJS, ReactJS and then I talked at the DevFest Vienna, organised by the local Google Developer Group. I had the opportunity to organise an internal frontend conference inside my company for 100 people and I gave a talk as well there. I’m now sending more CFPs to International conferences to continue my speaker path.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>What I like more is the feeling to contribution to the community, the feeling of sharing the knowledge I’ve acquired over the last years as developer, and doing so helps me to improve my public speaking skills as well. Another thing that I love from conferences is networking. Meeting new and amazingly interesting people from all over the world who share your interest and sometimes even hobbies.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I do remember my first talk. It was in the Vienna JS meetup, and I talked a new library my team and I built at my current company. The idea was to share the library and promote it as open-source so anyone can use it. I was extremely nervous before going into the stage, but the fact that my audience was developer as myself allowed me to relax a bit more. At the end it went very good and smooth, I got some very interesting questions after the talk and the people liked it.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/yKYA-7tczuk' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Adrián Bolonio on Accessibility at DevFest Vienna, 2018</em></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve applied to around 15 international conferences so far. In the last 2 years I got accepted in 4 conferences and several meetups.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>At the beginning I was nervous and my only routine was trying to calm down. Now I’m a bit more experienced, so I check that my computer has enough battery or I have a charger that works. I check as well that all my other applications are closed and my notifications are muted. I check that the microphone works properly and the screen where the presentation is shown is readable enough from any point of the venue.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>I think the best and more difficult advice is “calm down”. It’s ok to be a bit nervous, but try to calm down and understand that if you have been chose to give a talk in a conference or in a local meet up is because you’re an expert in that field, so you know what you’re talking about. Just calm down, enjoy the talk, and accept any feedback. It needs to be fun for you, you don’t have to suffer, so please enjoy the process.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>Since I’m very focused now on Web Accessibility I follow a lot of experts, but some of them are <a href=\"https://twitter.com/mmatuzo\">Manuel Matuzovic</a>, <a href=\"https://twitter.com/_sergeikriger\">Sergei Kriger</a> and <a href=\"https://twitter.com/marcysutton\">Marcy Sutton</a>.</p>\n<h3>Where can readers find more about you?</h3>\n<p>My next speaker appearance in a conference will be at the <a href=\"https://jsconf.co/\">JSConf Colombia</a> on October 18th &#x26; 19th, 2019. You can follow me in <a href=\"https://twitter.com/bolonio\">Twitter</a> or <a href=\"https://www.instagram.com/bolonio/\">Instagram</a>, and check <a href=\"https://speakerdeck.com/bolonio/\">my latest talk slides on my deck</a> as well as my repositories in <a href=\"https://github.com/bolonio\">GitHub</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Adrián Bolonio, Team Lead and Accessibility Advocate","path":"/blog/speaker-adrian-bolonio/","category":"Speaker's Story","tags":null,"date":"2019/08/30","image":"https://i.imgur.com/sZRtBDT.jpg?1"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}