{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"aeadb8c6-6d62-53b9-83bd-98437a2d3514","html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/w36pjbN.jpg?1\" class=\"left\">\n<p>Hi, I am Drishti Jain a Computer Engineer at heart and a technology enthusiast. I love to use technology to help the less fortunate. I am a social entrepreneur. I am the Co-founder and President of the non-profit organisation <a href=\"https://www.facebook.com/samyakdrishtifoundation\">Samyak Drishti Foundation</a> which works in environment, education and healthcare sectors in 10 cities across India. I have been titled <a href=\"https://www.instagram.com/theoptimistcitizen/p/BdT0mVJnMhU/\">Eco-Warrior thrice by the Government of Maharashtra, India</a>.</p>\n<p>I have been a good orator since a young age. I got into public speaking at school in grade 4; when I had to give a speech on Mahatma Gandhi Jayanti (for his birth anniversary). Ever since, I’ve loved the stage and sharing knowledge with all. Fun Fact: I also host music concerts sometimes :)</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I love speaking at conferences about things that I am passionate about. While I continue to learn new things and develop myself, I like to share my learning with others. Speaking at conferences, I am sharing with everyone about how cool a technology is or how I make the most of a feature. It gives me immense satisfaction to share my knowledge with all.</p>\n<p>I have learnt a lot speaking at conferences. I would like to share my secret weapon to effectively speaking in front large audiences.</p>\n<p><strong>My secret weapon – the 3 P paradigm: Pace, Pitch, Pause.</strong> These are three key parts of speaking effectively at conferences. Using this paradigm, I am able to more effectively deliver my knowledge.</p>\n<p>Moreover, speaking at conferences I am able to share my learning with all and give them a head start in the technology. I am believer of “Learning by sharing Knowledge” and speaking at conferences just fuels that!</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first conference talk was an exciting experience. Post deciding my topic (after a lot of brainstorming) I realized that I had just entered the long hiking trail of preparing my talk, yet to embark. There was a mountain of information I had gathered through research on the topic. And I had to create my talk in a way that I would cover maximum information and make it interesting. <strong>It all seemed overwhelming at first; but I decide to sit and create a summary of the information, that made it easy to prepare my talk.</strong></p>\n<p>On the day of the conference, I reached the venue early and checked if my laptop was compatible with the system; it was all ok and I was set to present my talk. Having reached early, I got comfortable with the environment and eagerly waited for my talk slot.</p>\n<p>I gave my talk and had a good Q and A for my talk; which gave me the assurance and satisfaction that I presented well and attendees were listening keenly.</p>\n<p>It was an amazing experience!</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Considering events, workshops, tech talks, conferences I have spoken at about 30-40; including a few virtual speaking engagements.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I attend the talk before my talk to set into the energy of the conference hall. <strong>I also do a demo practice with a friend to gain feedback.</strong></p>\n<p>I feel enthusiastic over nervous before my talk. I believe I have learned to convert my nervous energy into enthusiasm by practicing before my talk. I know it can be difficult due to packed schedules of the conference and work; but I do make sure to make time to practice. Sometimes I skim through my talk contents or rehearse the complete talk depending on the time I can make in my schedule.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>I will encourage new speakers to speak about what they are truly passionate about. <strong>When you speak about something that you are passionate about; you will actually be pretty excited to speak instead of being nervous. And your energy will be reflected when you present.</strong> It will boost your confidence and you will enjoy speaking!</p>\n<p>If you feel crunching everything you love about the topic into the 30/45 min talk is getting on to you, <strong>go outside and have fresh air. It will help you have a clear head and invoke creativity in your talk.</strong> It is very trivial to know the audience you will be presenting for. Most importantly remember to be yourself and be excited to share with the world what you like about the technology.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I got inspired by the talk by Pranav Mistry on the Sixth-Sense technology. I liked how he presented the technology and included components in the talk that could be understood by someone new in the technology space. It has inspired me to include an overview of concepts related to my topic in the beginning of my talk for a couple of minutes, so that a participant novice to the topic understands the overall picture and doesn’t feel left out.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/YrtANPtnhyg' frameborder='0' allowfullscreen></iframe></div>\n<p><em>TEDIndia: The thrilling potential of SixthSense technology by Pranav Mistry</em></p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Drishti Jain, Social Entrepreneur and Technology Enthusiast","path":"/blog/speakers-story-drishti-jain/","category":"Speaker's Story","tags":null,"date":"2019/06/22","image":"https://i.imgur.com/w36pjbN.jpg?1"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}