{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"d3cff399-b9c6-5d85-9700-3803697392d6","html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>////</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p>I’m a Lead Designer at 8th Light, a custom software consultancy. I do UX and front-end development and work with various clients on designing and building their software.</p>\n<p>I was never interested in public speaking, but before I became a designer about 3 years ago I worked at an education-focused non-profit, and have a background in teaching, so I’ve always been pretty comfortable in the very small scale stage of a classroom. Before I started at 8th Light I volunteered doing a workshop about domestic violence, and part of my apprenticeship involved doing a talk for a small group of people, and I did that workshop.</p>\n<p>I got a lot of positive feedback, and eventually did a version of it at our internal company conference. A while later, a co-worker who was organizing a Ruby conference asked me to do a short talk about how developers could do quick usability testing, so that they could have good UX of features they were building when there wasn’t a designer in the room. That talk went pretty well despite the fact that I felt like I was going to pass out the entire time.</p>\n<p>I did that talk at another conference, but quickly felt a strong urge to go back to speaking about something I really cared about. I had been thinking for a long time about the ways that technology enables domestic violence, and had been collecting examples, but never felt like I was an “expert” enough to do a talk about it. It really seemed like something that other, smarter people were working on. But eventually I realized that wasn’t true, that if someone out there was already talking about this stuff, I couldn’t for the life of me find them.</p>\n<p>Right around that time, Russ Unger, who leads UX Camp in Chicago, responded to a proposal I’d submitted saying my topic wasn’t quite right, and he asked “is there anything else you’ve though about doing a talk about?” I told him about my idea for a talk about how tech enables domestic violence, and he said that would be perfect for the conference. I owe him a lot for taking the time to figure out that this talk was on my mind and giving me what I needed to finally do it. It took dozens of hours of research and stitching together stories from news articles and people who had disclosed their experiences to me to make my talk, but I finally did it, and ever since UX Camp I’ve had a lot of success with it.</p>\n<h3>What do you focus on speaking about?</h3>\n<p>My speaking is all about how technology enables domestic violence; how abusers can utilize technology to further their power and control over their victims, and how products that don’t enable abuse but are clearly spaces where survivors are taking certain actions that disclose the abuse and meaningful intervention could be provided (“Survivor” is the preferred term instead over “victim”, since it speaks to the person’s ability to endure and survive a dangerous situation.)</p>\n<p>I tell a story about someone experiencing domestic violence in 5 different areas, give stats that correlate to those areas, and describe ways that more thoughtful design or building of the product could prevent the abuse. The 5 areas are financial abuse through online banking tools, harassment and monitoring through “smart” home devices/Internet of Things devices, stalking through GPS-enabled devices, personal security through software such as building management software, and how fitness, wellness, and pregnancy products could be a place of meaningful intervention.</p>\n<p>I think it goes without saying that domestic violence is a worthwhile thing to do a talk about, but just in case you need convincing, here are some stats:</p>\n<ul>\n<li>1 in 3 American women will experience severe physical abuse at the hands of an intimate partner.</li>\n<li>For men, that number is 1 in 4. Domestic violence is not an edge case. </li>\n<li>The number one cause of death among pregnant women in America is murder by her current or ex intimate partner.</li>\n<li>3 women are murdered by their current or ex intimate partners in America each week. </li>\n</ul>\n<p>These are real people who are being controlled, beaten, and murdered - and we in tech have a role to play in preventing it from happening.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I don’t see myself as a “public speaker” - I really just want to spread the content of my talk because I think it’s really important.</p>\n<p>But I’ve learned a few things: ((first, as someone who gets a lot of stage fright, the only thing that helps is just doing it a bunch.** After 4 or 5 times talking a stage, it started to get a lot easier. After doing it a bunch and not dying, you start to realize it’s going to be ok. That’s the advice I give people who ask about speaking even though they’re not a natural public speaker - you have to just do it, but then it quickly gets a lot easier.</p>\n<p><strong>The second thing I like about speaking at conferences is that I also get to attend them!</strong> I think I’ve grown in my career more rapidly than average in part because of attending half a dozen conferences in the past few months and learning a ton. My advice is to focus on applying to conferences you’d actually want to speak at, so that they’re also a learning experience for you. I can only do so many conferences in a year, so I figure I might as well prioritize speaking at ones I also want to attend.</p>\n<p><strong>The third thing I like is that speaking at conferences unexpectedly helped with my social anxiety a lot.</strong> I’m introverted and socially anxious, but so many days of having strangers come up and talk to me about my talk, and share their experiences with violence, was the intense exposure I needed to start to get past my social anxiety. Within 6 months, I’ve become so much more confident talking to strangers and being in new situations that would have induced a lot of anxiety in the past - all thanks to conference speaking. I really want people to know that you can be introverted, awkward, and socially anxious, and still be a great conference speaker and get a ton of benefit from doing it.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>7 so far, with a few more confirmed for the fall - include StrangeLoop, which I almost didn’t apply to because it seemed like such a long shot! I’ve applied to about 40, and gotten 10 rejections, with the other 23 still up in the air.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/ATVKZdl_pEw?start=130' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Bailey Lewis at OKC Design Tech</em></p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>Deep breathing! And lots of practice, to the point that you don’t need to rely on speaker notes. It makes such a difference.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>Two things: </p>\n<p><strong>You do NOT need to have the talk written before you write a proposal for that talk to apply to conferences with, and you do NOT need to already be an expert in the field that you’re proposing a talk about.</strong></p>\n<p>Feeling like you need to know and do so many things before even applying to something you might get rejected from is a surefire way to get overwhelmed and never start. Choose something you’re legitimately interested in and would want to become an expert in, write the proposal and apply to as many conferences as possible. Once you get accepted to one, then create the talk and learn all about it. You don’t need to present the answers in your proposal. I wish someone had spelled this out for me earlier on - I would have started applying with this talk a lot sooner!</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p><a href=\"https://twitter.com/sara_ann_marie\">Sarah Wattcher-Beottcher</a> is a huge inspiration. She keeps it real - she’ll call out the chatbot you’re using at your conference for defaulting to a woman’s name, and point out all the ways Facebook is terrible when a table full of Facebook designers is right in front of her. I really value that, and before her, had seen plenty of men behave that way, but no women. She’s not afraid to hold people accountable, but doesn’t make it personal. She strikes a perfect balance, and getting to see her speak and attend one of her workshops was incredibly valuable to see as I’m working on developing my own speaking style. I was lucky enough to randomly be seated with her at a shared table at a restaurant we were both at after I saw her talk at a conference, and got to ask her all my questions and get amazing advice. I think that was the moment I started to feel like the universe really wants me to do this work. Serendipitous things like that keep happening. And I’m trying to pay it forward -  I’m all about getting more women and other underrepresented voices into the conference speaking circuit.</p>\n<h3>Where can readers find more about you?</h3>\n<p>My website is <a href=\"\">evapenzeymoog.com</a> and my twitter handle is <a href=\"https://twitter.com/epenzeymoog\">@epenzeymoog</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Eva PenzeyMoog, Designer Helping Stamp Out Domestic Abuse","path":"/blog/speakers-eva-penzeymoog/","category":"Speaker's Story","tags":null,"date":"2019/07/26","image":"https://i.imgur.com/l6UnYFz.jpg"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}