{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"e34335bd-a430-5140-959e-3ad6a8a0200a","html":"<p>This year, I’ll be attending <a href=\"https://gotochgo.com/2020/\">GOTO Chicago</a>, so leading up to the event, I wanted to highlight some of the\nspeakers who will be presenting. I was really excited to hear from Bruce Lawson because HTML is such a core piece of technology for\nthe web, but so many of us take it for granted. As a member of the W3C’s HTML5.3 specification team and writer on the topic, I knew\nBruce would make for an interesting speaker to feature here.</p>\n<p>Read on to hear how Bruce got into tech from a background in music and acting, and some of his tips for new speakers.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p>I’m an accessibility and web standards consultant (you can hire me!). Side projects are music: <a href=\"https://www.brucelawson.co.uk/category/my-music/\">writing and recording</a> and developing a new product called <a href=\"https://twitter.com/swordcello\">SwordCello</a>, which isn’t released yet. I got into public speaking as a kid, when I was an actor.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>It used to be an integral part of my job in Developer Relations for Opera, now it’s for fun - it’s a good way of seeing old friends or visiting a new city. It’s definitely benefited my career, and hopefully helped my audience’s careers, too.</p>\n<h3>What makes HTML such an interesting topic for you?</h3>\n<p>HTML is the foundational language of the web: the greatest store of knowledge (and bullshit) ever. It’s forwards and backwards compatible. It’s developed to be accessible, work with any human language or script and to be secure. What’s not to love?</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/f6As5HEkG5E' frameborder='0' allowfullscreen></iframe></div>\n<p><em>”<a href=\"https://www.youtube.com/watch?v=f6As5HEkG5E\">Ensuring a High Performing Web for the Next Billion People</a>” by Bruce Lawson at Velocity Amsterdam</em></p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>It was a 15 minute talk about accessibility in the Netherlands. It went OK, as I remember. But it was very dry.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Ooh, about 150 I think. I probably only applied to about 10; the rest were invitations from the conference organiser.</p>\n<h3>Do you have a pre-talk routine? (Is there anything new speakers should think about just before they give a talk?)</h3>\n<p>Safety pee; check zip is up; make sure you have water (not sparkling, else you might burp down the mic). Go through your slides one last time.</p>\n<h3>What advice do you have for new speakers?</h3>\n<ul>\n<li>Even if you think your subject has been spoken about before, you’re bringing your own unique slant to it.</li>\n<li>Make sure you tell a story - you have a beginning, middle and end.</li>\n<li>Don’t spend ages introducing yourself.</li>\n<li>Never claim something is easy or obvious, just because it is to you.</li>\n<li>Put in a few jokes.</li>\n<li>Relax. If you dry up and can’t remember the next bit, take a sip of water so you don’t feel like a deer in the headlights.</li>\n<li>Don’t take questions; tell the audience that you’ll be around the venue and they are more than welcome to approach you and ask you questions.</li>\n</ul>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p><a href=\"https://twitter.com/SaraSoueidan\">Sara Soueidan</a> for her energy and passion; <a href=\"https://twitter.com/mathias\">Mathias Bynens</a> for his geekery and humour; <a href=\"https://twitter.com/jaffathecake\">Jake Archibald</a> for his knowledge and wit; <a href=\"https://twitter.com/sarah_edo\">Sarah Drasner</a> for her enthusiasm and knowledge. However, I learn from almost every talk I attend.</p>\n<p>Learn more about <a href=\"https://gotochgo.com/2020/speakers/1263/bruce-lawson\">Bruce’s talk at GOTO Chicago 2020 and how you can contact him here</a>.</p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Bruce Lawson, HTML5 Spec Editor and Musician","path":"/blog/speaker-bruce-lawson/","category":"Speaker's Story","tags":null,"date":"2020/02/20","image":"https://drive.google.com/uc?id=1F2ECoS80xRLABMFLcBOgPZhZWAgX6D65"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}