{"pageContext":{"isCreatedByStatefulCreatePages":false,"group":[{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Keanan Koppenhaver and I met through the <a href=\"https://www.meetup.com/Chicago-PHP-User-Group/\">Chicago PHP Usergroup</a> last year,\nand since we’ve been fortunate enough to share the stage at Midwest PHP, and share a meal in the airport on the way home.\nSpeaking is always a good chance to meet other people, but it’s also a fast way to learn new skills. I’ve seen several of\nKeanan’s talks including one about Alexa and another about serverless functions in PHP. Keanan also has an entrepreneurial\nspirit, which I appreciate, so it was great to learn more about his experience speaking.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/Mcsi3b6.jpg\" class=\"left\">\n<p>Hi I’m Keanan and I’m a developer-turned-CTO and I co-founded <a href=\"https://alphaparticle.com/\">Alpha Particle</a>, a digital consultancy in Chicago. I got into public speaking at one of my previous jobs when we decided that our company should get more involved in the development community. So I started reading up on exactly how conferences decided on talks and started submitting to CFPs!</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I really enjoy all the people I’ve been able to meet as a result of the speaking that I’ve done. <strong>I especially enjoy chatting with people at the speaker dinners or other informal events surrounding the conference.</strong> As far as benefits to my career, some of these connections I’ve made at conferences and meetups have definitely helped me land further speaking gigs, new clients and even (arguably) this interview.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first conference talk was at WordCamp Nashville in 2016. The <a href=\"https://wordpress.tv/2017/03/17/keanan-koppenhaver-take-wp-admin-to-the-next-level-with-advanced-custom-fields/\">video is actually online</a>, though I cringe watching it. It was a 20 minute “lightning talk” and I remember having to follow an awesome speaker who had the audience on the edge of their seat the entire time. The majority of my talk actually went well, but near the end (~14:00) you can see my heart jump up into my throat when one of my demos didn’t work correctly! Luckily, I was able to fix it and finish the talk, and <strong>this definitely wasn’t the last time demos didn’t work exactly right</strong>.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>Between conferences and meetups, I’ve probably spoken at between 20-30 and applied to probably twice that many. I don’t really apply to conferences that I don’t feel like I’d be a great fit for, but even then sometimes they just really can’t take everybody.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p><em>Cue Eye of the Tiger montage…</em></p>\n<p>But seriously, I usually just try to get into the room I’ll be speaking in before I have to give my talk (either by getting to the conference early in the morning or during lunch) and make sure my computer can interface with the projector and that the fonts on my slides are readable even in the back of the room.</p>\n<p><strong>I always try to attend the talk before mine in the same room</strong>, just so I can start setting up and doing a final check of everything as soon as the last presenter is done with their talk.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>I think there’s definitely lots of feelings from new speakers around not being knowledgeable enough to start speaking. <strong>But if a conference was only filled with super-advanced talks, they would lose a huge part of their audience.</strong> So, even if you just learned something, you can teach it and many attendees will welcome your perspective as a relatively-recent beginner. <strong>Since you just went through it all for the first time yourself, you know and remember all the roadblocks that someone getting started will have and can help them learn even quicker.</strong></p>\n<p>In addition to that, the one thing that started really getting me more speaking opportunities is <strong>submitting multiple talks to each CFP</strong>. Conference organizers sometimes have an agenda of the talks they’re looking to accept and if you submit more talks, you give them more chances to fit you into the schedule they’re looking to craft. (However, some conferences specifically say to not submit more than X talks, so definitely abide by that.)</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I really enjoy <a href=\"https://twitter.com/garybernhardt\">Gary Bernhardt</a>, specifically <a href=\"https://www.destroyallsoftware.com/talks/the-birth-and-death-of-javascript\">Wat and The Birth and Death of Javascript</a> just because he manages to inject lots of humor into his talks while still keeping them super informative. I also loved <a href=\"https://www.ted.com/talks/tim_urban_inside_the_mind_of_a_master_procrastinator?language=en\">Tim Urban on Procrastination</a> just because of both his graphics and the way he walks the audience through his talk.</p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>More info about me is at <a href=\"https://keanan.dev\">keanan.dev</a> but most of the writing I do is on our company site at <a href=\"https://alphaparticle.com\">alphaparticle.com</a>.</p>\n<p>I’m speaking at a few meetups here in Chicago in the coming months, so I hope to see some familiar faces there!</p>\n<hr>\n<p>If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Keanan Koppenhaver, Software Developer and Entrepreneur","path":"/blog/speakers-story-keanan-koppenhaver/","category":"Speaker's Story","tags":null,"date":"2019/05/05","image":"https://drive.google.com/uc?id=1Hpvw9lfOx1bzUDmXv3UnLd5ur8IlT34z"}}},{"post":{"html":"<p>Last week, I added a couple new sources that more than tripled the number of <a href=\"https://www.cfpland.com/conferences\">conference CFPs listed on our site</a>.\nUnfortunately, I made an assumption that any publicly available API would be okay to integrate with, and one of the new sources\ngot a little bothered about my cross-posting their listings. In order to increase transparency, I’m going to show you where\nI get all the data for this site, and outline my policy on sharing this data.</p>\n<!--more-->\n<h3>CFP Source Data</h3>\n<p>First of all, <strong>my immediate goal for CFP Land is to provide a free feed of all the upcoming CFPs for tech conferences that I can find</strong>.</p>\n<p>With that in mind, I want to give credit to the sources I use to find out about CFPs:</p>\n<ul>\n<li><strong><a href=\"https://confs.tech/\">Confs.tech</a></strong> - An open source list of conferences that I and many others have contributed to.</li>\n<li><strong><a href=\"https://callingallpapers.com/\">Calling All Papers</a></strong> - An open source list and API that aggregates CFPs from joind.in, papercall.io, and lanyrd (which I believe is now defunct).</li>\n<li><strong>Twitter searches and retweets</strong> - People often mention <a href=\"https://twitter.com/cfp_land\">@cfp_land</a> with new conferences, but I also have a few Twitter searches set up to help me find new CFPs.</li>\n<li><strong>Conference Speaker Slack channel</strong> - I am a part of a Slack channel for conference speakers where we often pass CFPs around. I add many of these to my list as well.</li>\n<li><strong>User submissions</strong> - Finally, I’m getting an increasing number of <a href=\"https://www.cfpland.com/submit\">submissions from subscribers</a>. This is really helpful, and I plan on making it even easier to do in the future.</li>\n</ul>\n<h3>Enhancing Source Data</h3>\n<p>Getting the upcoming CFPs is the first part of the process. Next, I manually review each one, make sure it’s categorized, that the location\nis accurate, and I add data about whether they cover travel and hotel costs for speakers. This takes me an increasing amount of time\neach week, but I’m working to automate it. 🤖</p>\n<p>I also have scripts that add logos, Twitter accounts, descriptions, and other metadata.</p>\n<h3>Acceptable Data Use</h3>\n<p>All the data I have is available to the public for any purpose (including building tools that directly compete with CFP Land!) <a href=\"https://www.cfpland.com/conferences\">here on the website</a>, <a href=\"https://feeds.cfpland.com/v2/rss/cfps\">in this RSS feed</a>, or <a href=\"https://cfpland.github.io/api-docs/\">through the API</a>. Seriously, if you want to build something cool with it, go for it. I’d love to hear about it! One guy sent me a message about a <a href=\"https://github.com/jonatasbaldin/cfpland-telegram-bot\">CFP Land Telegram Bot</a> that he built. 👍</p>\n<p>I don’t currently show CFPs that have closed or CFPs that are closing in more than 3 weeks, but I am working on making them available too.</p>\n<h3>Monetization</h3>\n<p><strong>My long-term goal for this project is to make it self-sustaining.</strong></p>\n<p>I do occasionally find sponsors for the newsletter, and I’m exploring building a CFP submission management tool for speakers. If it makes enough to pay for my hosting and email client bills someday, that would be pretty cool. If not, I’ll probably try to do as much as can be fully automated and stop doing as much cleanup.</p>\n<p>If you have questions or problems with any of this, I am a real person. My name is Karl. I live in Chicago, USA and have <a href=\"https://www.instagram.com/urbanmutt_chilidog/\">a dog named Chili</a>. Just <a href=\"mailto:karl@cfpland.com\">email me</a> and I’d love to talk. 💌</p>","frontmatter":{"layout":"post","title":"CFP Land Data Sources & Sharing","path":"/blog/data/","category":"Updates","tags":["Data","Website"],"date":"2019/04/29","image":"https://i.imgur.com/TU40Hf6.jpg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>I was probably a year into speaking at conferences before I heard about “developer relations” (also called “DevRel”).\nIt’s a relatively new field that blends software development and marketing, so many conference speakers get into DevRel (and vice-versa).\nThis week’s featured speaker, Alex Lakatos runs a great newsletter for developer relations professionals\ncalled <a href=\"https://developeravocados.net/\">Developer Avocados 🥑 Weekly</a>. In addition to that, he has a fantastic story about\nhow he accidentally fell into speaking, so read on to learn more about Alex and his tips for technical speakers.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/FDVubKV.png\" class=\"left\">\n<p>About 8 years ago, I was a JavaScript Test Developer working for an outsourcer in Romania (I happen to be Romanian), contracting for Mozilla. A friend was organizing this conference called Open Source Open Mind and wanted someone from our team to come to speak about Mozilla and how to get involved. I was terrified of public speaking, but luckily one of my coworkers, <a href=\"https://twitter.com/ioana_cis\">Ioana</a>, said she’d do it. Ioana was in the US at a client on-site just before the conference though, so she asked me to do the slides for her. Naively, I accepted, thinking there’s no harm in it and it’s the least I could do since she was getting me out of having to be on stage.</p>\n<p>The day of the conference rolls around, and we’re all in the airport early in the morning, waiting for Ioana’s flight to land. Just as the airport was listing her flight as “Cancelled”, we got a message from Ioana to go ahead to the conference, and stall as much as possible, she’ll be on the next flight and should be there in time for the last slot of the day.</p>\n<p><a href=\"https://twitter.com/pensacolla\">Marcela</a>, the conference organizer, being a friend, kept pushing Ioana’s talk further in the schedule. But the last talk of the day comes up, and Ioana is nowhere to be found. So Marcela goes up on stage and looks panicked at the audience, sees me in the front row, and just blurts out: “And now, talking about the Mozilla community…Alex is going to talk about the Mozilla community!“.</p>\n<p>I was dumbstruck, I got on stage and I just sat there quietly for about a minute. And then I started talking and didn’t stop until the Q&#x26;A part. It was horrible, I had my hands in my pocket the entire time, I made a bunch of rookie mistakes. There is a <a href=\"https://www.youtube.com/watch?v=pMnwjpy_3J0\">video of it</a> somewhere on youtube, luckily in Romanian, so not very popular. To this day I still use it as an example of ‘what not to do’ during my public speaking training. 😅</p>\n<p>When the Q&#x26;A part came, people were a bit on edge, and every time someone bashed Firefox with their questions, I took a step into the audience. I think I finished the Q&#x26;A part literally in the middle of the audience, and trying to make a step to my left to go towards the last person that asked a question. That’s when I realized maybe it was time to end the talk, well over my allotted time slot.</p>\n<p>That’s how I started speaking in public. A few weeks after that I was MCing one of the community events we had going, someone from the Mozilla Community team saw me and decided that’s what I was going to do moving forward. I got tons of mentorship from the Mozilla people, like <a href=\"https://twitter.com/codepo8\">Chris Heilmann</a>, as I was starting out and it just encouraged me to get better and be on stage more often than in the audience.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>The reason I speak at conferences is simple. I feel guilty about being privileged enough to have gone to a Computer Science University, so <strong>I try as much as possible to help other people get into tech, or get better at tech</strong>. Knowing I helped at least one person by being on stage and sharing my knowledge makes me feel a bit better about that.</p>\n<p>I used to think public speaking was making me a better communicator, so it was helping me indirectly in my career as a JavaScript Developer. But about two years ago I got a job as a JavaScript Developer Advocate at <a href=\"https://developer.nexmo.com/team\">Nexmo</a>, and my community work and public speaking was the reason I got the job. So it helped me directly in my career, to the point its part of my day to day work! 😅</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/5mWBqS30hoI' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Alex Lakatos at View Source</em></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I don’t really have an exact number, but let’s go with “a lot”. For context, last year I’ve either spoken, attended, hosted or sponsored 40 events (not just conferences, but smaller meetups as well). If I had to venture a guess based on my slides repo on Github, I’d say <strong>I spoke at around 50 conferences and meetups so far</strong>.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>Yes, and it’s a little embarrassing, to be honest. <strong>I get so nervous before going on stage that I can’t eat, drink or interact with people.</strong> There is this Psychology of Winning that tells you how to get into a winner mindset, and that calms down my nerves enough to get on stage and start talking. After the first minute or so practice takes over and I actually enjoy being on stage but let me tell you about getting there.</p>\n<p><strong>I usually find a quiet spot in the speakers room, or in the bathroom (I want to apologize to anyone who has heard my pre-talk routine), and I start imagining I just won</strong> (dunno what, but the point is I’m a winner now!): pump my chest forward, straighten my shoulders, raise my fist in the air, grin widely, maybe even shout a few “Hell yeah!“s if I think the toilet it empty (spoiler alert: it rarely is as empty as I think). That makes me think I just won something, I don’t need to win on stage as well, and it calms my nerves enough so I don’t shake as I speak.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>There are so many things I can list, it’ll just end up being another blog post just for this question. I think there are a lot more resources out there now compared to when I started, so <strong>my advice is just “practice”. No one did great the first time they got on stage or the second one, but practice makes perfect.</strong> So look at your presentations, identify the areas you could have done better (be it slides, content, posture, delivery), and then find the next conference or meetup where you can practice your talk some more and improve on those points.</p>\n<p>If you’re looking for resources on public speaking or want to take the plunge and become a Developer Advocate, I co-curated this newsletter called “Developer Avocados 🥑 Weekly”. If you <a href=\"http://developeravocados.net/\">subscribe</a>, you get a bunch of highly curated articles from the past week in your inbox every Monday, along with a few conferences CFPs that support speakers with travel and accommodation.</p>\n<h3>Are there any other speakers you look up to?</h3>\n<p>When I started out <a href=\"https://twitter.com/codepo8\">Chris Heilmann</a> and <a href=\"https://twitter.com/robertnyman\">Robert Nyman</a> helped me and inspired me a lot.</p>\n<p>Today, I think one of my favorite speakers is <a href=\"https://twitter.com/simona_cotin/\">Simona Cotin</a>. I like her Serverless talks a lot, the live coding with a fallback to recordings is something I keep telling people they should do more of in their talks.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/GTrHSQbxR-Y' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Simona Cotin at JAMStack</em>conf 2018_</p>\n<h3>Where can readers find more about you? Your next conference talk?</h3>\n<p>I hang out on Twitter these days, so <a href=\"https://twitter.com/lakatos88\">follow me there</a>. I’m hoping my next talk is going to be JSUnconf, but it is an unconference so it’s a bit uncertain. My next confirmed talk is going to be the International JavaScript Conference in London.</p>\n<hr>\n<p>If you’re a tech conference speaker, email karl@cfpland.com to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Alex Lakatos of Developer Avocados 🥑 Weekly","path":"/blog/speakers-story-alex-lakatos/","category":"Speaker's Story","tags":null,"date":"2019/04/27","image":"https://drive.google.com/uc?id=1u-naZtVPLy3XMXlvKWOoK5lM4BOPOV2z"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Joe and I are both from Chicago, so we’ve known each other for a few years. One thing I really admire about Joe is his eagerness to help new developers find their way in our industry. While we didn’t talk about it in this interview, he runs <a href=\"http://chicagoapprenticeships.com/\">Chicago Apprenticeships</a>, a site dedicated to helping bootcamp graduates find their first development job.</p>\n<!--more-->\n<p>I’ve always looked at Joe as someone who really knows his stuff, so it was interesting to me to hear that Joe still struggles with nerves when he’s speaking. Remember, people may look like they’ve got it all together on the outside, and still be nervous!</p>\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/pUB2xtQ.jpg\" class=\"left\">\n<p>Hi, I’m Joe! I’ve been in tech for a very long time, and giving talks at conferences for maybe five years. I’m very much a generalist, so I take a lot of different roles in tech. Overall, though, I’d say I’ve been most interested in making teams more effective lately.</p>\n<p><strong>I was originally on the fence about whether I should give a talk. Too nervous.</strong> While grabbing drinks with someone much more experienced than myself, she basically told me to get over it and just apply. That turned out to be great advice. Since then I’ve given a ton of talks, both soft topics and purely technical ones.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p><strong>I’ve been incredibly fortunate to get to meet and become friends with some of my heroes in the industry as a result of speaking at conferences.</strong> That’s probably the biggest benefit for me. The Ruby community — where I give most of my talks — is full of supportive, brilliant folks, so that’s really made me feel good about participating.</p>\n<p>It’s definitely impacted my career. <strong>I still get folks coming to talk to me about talks I gave a few years ago.</strong> I can point to videos of my talks when talking to companies or folks inside my own company. And it let me sharpen my own thinking and discussion skills around tech topics. It’s been a huge boon.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/hFuzIWz6Ynk' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Joe speaking at Rails Conf, 2017</em></p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>Honestly I don’t think I slept for three days before my first talk. One of the reasons I enjoy giving talks is that I get to work on my fear of speaking in front of crowds. That said, <strong>I always struggle right before I actually get on stage.</strong> I was at a single track conference in a theatre auditorium, which made me feel even more nervous.</p>\n<p>But once I was on stage, I was able to get into a rhythm and really get across the ideas I wanted to convey. And at some point I remembered that I do know and care about my topic deeply. That gave me a lot of confidence. I’d say it was a success.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve applied to a few dozen. I’ve been accepted at maybe a quarter of those that I applied to? <strong>I have a much easier time getting accepted at regional and US-based conferences.</strong> I’d really like to do more international speaking, but I think I probably need to have more visibility domestically and focus more on that goal before it’ll happen. I’m also much more comfortable in communities that I feel attached to (Ruby) than general programming conferences.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>Panic? Honestly, I usually spend the morning of a talk walking back and forth clicking through my slides and making sure that I have the major points from that slide down cold. I’ve never been good at preparing to the point where I’ve got my entire talk scripted, so that’s helpful for me as a routine.</p>\n<p>I probably should script my entire talks, but that’s not really my speed.</p>\n<p><strong>I do wear the same t-shirt nearly every time I give a talk. That’s pretty much a ritual at this point.</strong></p>\n<h3>What advice do you have for new speakers?</h3>\n<p><strong>Ignore the fear and just apply.</strong></p>\n<p>I can totally understand the impostor syndrome, it’s hard to make the transition from an audience member to a speaker. It’s a bit cliche, but I do try to help new speakers remember that <strong>the things that they learned in the past year are totally new material to others</strong>.</p>\n<p><strong>I’d definitely recommend taking advantage of any speaker help that conferences offer.</strong> It’s a huge boon to get people to listen to your talk ahead of time. There are also lots of articles out there on how to write a good proposal. Overall, let other peoples’ hard won wisdom get you through the early parts.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I’ve had the fortune or misfortune to speak on the same stage as <a href=\"https://twitter.com/sandimetz\">Sandi Metz</a> before. The clarity of how she conveys deep technical ideas always blows my mind. She’s definitely the person whose style I’d like to get better at emulating. If I would just start scripting my talks.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/VzWLGMtXflg' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Sandi Metz at RubyConf 2017</em></p>\n<p>That said, there are plenty of other speakers with really different styles who all convey ideas really effectively, in really different ways. Say, <a href=\"https://twitter.com/nmeans\">Nick Means</a> versus <a href=\"https://twitter.com/searls\">Justin Searls</a>. You can’t take someone else’s voice, and you don’t need to.</p>\n<h3>Where can readers find more about you?</h3>\n<p>No conferences on the books now as I’m adjusting to a new job and hoping to take advantage of being in a company to get more opportunity to give talks. Hopefully this next CFP season I’ll be back on the trail.</p>\n<p>Until then I’m at <a href=\"http://josephmastey.com/\">josephmastey.com</a>, <a href=\"http://chicagoapprenticeships.com/\">chicagoapprenticeships.com</a>, or on Twitter at <a href=\"https://twitter.com/jmmastey\">@jmmastey</a>.</p>\n<p><img src=\"https://i.imgur.com/RSeC2VQ.jpg\"></p>\n<hr>\n<p>If you’re a tech conference speaker, email karl@cfpland.com to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Joe Mastey, Tech Generalist and Apprenticeship Advocate","path":"/blog/speakers-story-joe-mastey/","category":"Speaker's Story","tags":null,"date":"2019/04/21","image":"https://drive.google.com/uc?id=1bdxa-oqruFe_8gtikD0eCuVf3jHybSvr"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>After being reluctant (and admittedly nervous) to get on stage as a speaker, Nicola was finally\nconvinced that her experience was worth sharing. Her story is inspiring, because as Nicola points\nout, there aren’t a ton of speakers like her (Australian, female designers) out there.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p>I’m an independent product design consultant, working with software teams on their research and design as well as their process. I’m Australian, but I travel around a lot now days.</p>\n<p>I really had to force myself into public speaking. <strong>I was that girl who was so nervous I felt sick when I had to answer a question in class in front of people in high school.</strong> I was so shy and scared of public speaking. I never, ever thought I’d be speaking at conferences one day.</p>\n<p>I was lucky later on that I had a manager (Lawrence Crowther) who kept suggesting I give a talk. I think the fact that he saw me as someone who should be on stage was what I needed to feel like I could do it. Then the guy who runs Web Directions in Sydney reached out to me on Twitter after some blog posts I wrote, and specifically said he’d love to see my application to speak at the conference coming up. They promised speaker training for anyone who wanted it, so I went ahead and applied. Lo and behold, I was accepted… So then I had to force myself to get comfortable with public speaking in a matter of a few months.</p>\n<p>I really appreciate both of these people for believing I was the right person to be on stage, and encouraging me to do it. <strong>I think to get less represented people on stage, we really need to just ask them more.</strong> It’s hard to imagine yourself on stage if you’ve never really seen someone like you doing it. I didn’t feel like I’d seen many young, Aussie, female designers doing talks, so I guess it just didn’t really seem like something I could do.</p>\n<img src=\"https://i.imgur.com/qTCPnIX.jpg\" class=\"center\">\n<h3>What do you like about speaking at conferences?</h3>\n<p>The two things I’ve spoken about most - retrospectives and collaborative user research - are both things I’m really passionate about. So it’s just exciting to be able to share information I really think people should have.</p>\n<p>On a more selfish level, <strong>its great to be able to speak about the thing you’re interested in in front of a lot of people, because it means for the rest of the conference the other people who share your passion will come up and talk to you.</strong> I’ve met some really interesting people. And having spoken about your field at conferences gives you a little boost of initial authority on the subject that you otherwise have to build from scratch every time you meet a new client.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I tested out that my laptop connection and slides were working so many times in the break before my talk that they had to shoo me off stage. And still, the connection totally failed when I got up there in front of 800 people. The AV guy had to actually restart my computer on stage while I was standing there introducing myself at length. Super awkward! But I feel like I swallowed the frog: the possibly worst thing happened the first time. It all had to be uphill from there.</p>\n<p>(For the record, the talk went fine once we got the slides working again!)</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve spoken at 3 conferences, with #4 coming up in June. Two in Sydney one in Kingston, Jamaica (!) and the next in Cornwall in the UK. I’ve applied to a lot more than that!</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/J5mC7jQ3Lto' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Nicola Rushton at WebCraftConf - User Research is for Everyone</em></p>\n<h3>Do you have a pre-talk routine?</h3>\n<p><strong>I always try and test out the talk on a real audience or two before the conference.</strong> Whether that’s at a workplace or a Meetup, I always find things to change and get feedback from people. I will practice my talk probably ten or more times in the few weeks before the conference, just in my house talking to the walls!</p>\n<p>Directly on the day of the talk, I don’t have much of a routine. If anyone asks me about how I’m feeling I tell them “excited!” Even if I’m actually totally nervous, I find that embodying excitement helps me feel that way. I normally don’t eat much on the day.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>The most useful thing I have ever been told regarding public speaking was that <strong>the intense rush of adrenaline and nerves before you get on stage is COMPLETELY NORMAL and it happens to everyone, even people who’ve been doing it for years</strong>. In fact, if it stops happening, there’s something wrong. When I felt like that before, I used to get kind of worried and feel like maybe it would cause me to shake or faint on stage or something. But now I just observe that feeling and think to myself, awesome. My body is giving me all the adrenaline and hormones to do an awesome job of this. And I know it doesn’t come across on stage (especially if you smile!)</p>\n<p><strong>Think about starting by talking at Meetups, being on panels, or even hosting a Meetup.</strong> Smaller moments of being on stage helped me feel comfortable building up to standing up and speaking for 45 minutes straight.</p>\n<p>I think it’s also worth saying that representation on stage can be really useful for other people in the audience. Seeing people like you doing things can make someone reconsider whether they might be the right person to do that thing too. <strong>Just by being up there and being yourself you could be encouraging someone else to get up and share the thing they’re passionate about too.</strong> I find this perspective valuable if I start to feel imposter syndrome.</p>\n<h3>Are there any other speakers you look up to?</h3>\n<p>One of the most useful things I did for myself when forcing myself to become comfortable with public speaking was to <strong>hold myself to a low standard</strong>.</p>\n<p>That might sound really counterintuitive, but I just told myself at the start that if I got on stage, said everything I wanted to say, and didn’t trip over myself, then it would be a huge success. Then the next time, I pushed myself to do all of that and one more thing. Then the next time, just a tiny bit better. This allowed me to always feel REALLY positive and successful and happy about my public speaking. I didn’t want to get into feeling like I didn’t do good enough, and become discouraged. So really, my goal is to just be myself on stage, have good content, and communicate what I want to communicate in an engaging way.</p>\n<p>I don’t compare myself to anyone else!</p>\n<h3>Where can readers find more about you?</h3>\n<ul>\n<li><a href=\"http://nicolarushton.com/\">www.nicolarushton.com</a></li>\n<li><a href=\"https://twitter.com/nicolarushton\">Nicola on Twitter</a></li>\n<li><a href=\"http://linkedin.com/in/nicola-rushton/\">Nicola on Linkedin</a></li>\n</ul>\n<p>My next conference talk is in <a href=\"https://agileonthebeach.com/sessions/2019/bring-the-team-along-for-the-ride-why-products-are-better-when-agile-teams-do-research-together/\">June at Agile on the Beach, UK</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email karl@cfpland.com to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Nicola Rushton, Overcoming Reluctance to Share Her Passion","path":"/blog/speakers-story-nicola-rushton/","category":"Speaker's Story","tags":null,"date":"2019/04/12","image":"https://drive.google.com/uc?id=1npb2OhWZlDsfQEdUPaQu8uTrigII2--w"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Like many people who get into public speaking, Chris Holland has a strong drive to help other engineers perform at their best. When I first met Chris, he was speaking on application security at a regional PHP conference. One thing that comes across here (and if you meet Chris in person) is his passion for helping other engineers learn about topics that can be challenging to tackle.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p>I was raised in Paris, France then moved to Los Angeles in the 90s where I studied some computer science and quickly got into web applications development.</p>\n<p>My early career was focused on front-end development before we had standards such as CSS and the DOM - before AJAX was a thing. Fun trivia, back when Gmail first came out and people were impressed with its “autocompletion” on email addressees, I won a contest to deliver <a href=\"http://wick.sourceforge.net/\">the first open-source framework to do this</a>. Nobody cared, but it was fun.</p>\n<p>Pretty quickly however, I got more into server-side software engineering with Java/J2EE, then PHP and C#/.Net, where I developed a better understanding of Object-Oriented Design, Database Design and Information Security.</p>\n<p>I’ve been managing engineering organizations of various sizes since 2007, and to this day, remain close to the code, seeking out every opportunity to coach software engineers toward successful careers.</p>\n<p>Having learned many lessons “the hard way” over the past 20 years, in 2017 I started developing a growing portfolio of talks shining light on various aspects of Software Crafting and InfoSec. Having spoken at various local meetups, I got into my first “full software conference” as a speaker at the 2017 inaugural Coder <a href=\"https://www.codercruise.com\">Cruise Conference</a> by the fine folks at One for All Events. In 2017 I also spoke at a couple of InfoSec conferences by invitation from contacts developed from speaking at local OWASP meetups. All in all, 2017 ignited my speaking career.</p>\n<img src=\"https://i.imgur.com/eEzegV6.jpg\" class=\"center\">\n<h3>What do you like about speaking at conferences?</h3>\n<p>Speaking at conferences has been a powerful cathartic outlet for overcoming my ever-growing frustration of seeing software engineers making the same mistakes I did earlier-on in my career.</p>\n<p>Far beyond this however, speaking with attendees and listening to their stories, experiences, frustrations and successes, has also been very rewarding and has often given me ideas for new talks, while helping me refine existing talks. Sharing meals and drinks with attendees is a lot of fun. I do tend to be shy though, so I find it easier to engage with people in more intimate settings. <strong>I make a point of sitting at tables of people I don’t know and listening to their conversations while slowly coming out of my shell.</strong></p>\n<p>I also love meeting and learning from other sharp speakers at conferences. It’s helped me correct misconceptions, learn new things, and think about various problems differently.</p>\n<p><strong>Getting to travel the World has been an unbelievable experience. The people, the sights, the food. Just amazing.</strong></p>\n<p>Finally, I absolutely love meeting authors and contributors to open-source projects, with plenty of time to chat with them at speaker dinners and thank them profusely, in person, for their work. I’m also starting to contribute to some projects on Patreon.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first Software Engineering talk lacked structure. I jumped into concepts without sufficiently linking them with a common thread, both with slides and verbally. The audience was very supportive though and in general agreed with my concepts. Questions were thoughtful, and I did get a good amount of spontaneous positive feedback after it, with solid break-out discussions.</p>\n<p>My first InfoSec talk could date as far back as 2015 at a local OWASP Meetup. The graphics in my slides were just too “thin” with insufficient contrast and text that was too small. My delivery wasn’t on-point either. <strong>Despite all that, several people came-up afterward to continue the discussion.</strong></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>In 2018, I started getting accepted to a good number of conferences and spoke at seven of them. In 2019 so-far I’m looking at seven conferences between March and June. I’d be happy to score a couple more for the fall/winter season, but I do have limited availability because speaking at conferences isn’t part of my job description.</p>\n<p>For each conference at which I speak, I take personal time off from work. I also save-up money to bring my Wife to <em>a couple</em> of conferences per year. We strategize about the destinations she’d hope for the most, and when her parents are available to take care of our 2 daughters for a few days.</p>\n<p><strong>I do apply to “several dozen” conferences each year. It’s … overwhelming at times.</strong></p>\n<h3>Do you have a pre-talk routine?</h3>\n<ul>\n<li>Go over my slides, rehearse mental timing milestones at various sections of it. In some cases make some last-minute tweaks if I find an opportunity to more closely align an area of the presentation with the conference’s audience. Or something relevant that just happened in the news.</li>\n<li>Try to scope out the room and check for connectivity, HDMI, Power.</li>\n<li>Make sure my laser pointer works.</li>\n<li>Figure out where I can stash a bottle of water near the podium for mid-talk swig.</li>\n<li>Scope out well ahead of my talk, where the Audio/Video engineers are in case I need their help.</li>\n<li>See whether the previous speaker in my room had any issue with the equipment.</li>\n<li>Get laptop, remote and everything set-up at least 10 minutes before my talk, I like to start setting-up 15-20 minutes ahead of time when I can, and be fully-ready at the 10-minute mark. Yea … I’m also the person who shows-up at the airport at least 2 hours before any flight even with CLEAR and Pre-check.</li>\n</ul>\n<h3>What advice do you have for new speakers?</h3>\n<p><strong>Conferences are literally yearning for new voices. Attendees are growing tired of seeing the same people at conferences year after year.</strong> An increasing number of conferences are focusing their attention on attracting new speakers with no speaking experience with a great emphasis on diversity for underrepresented demographics.</p>\n<p>Check out <a href=\"http://selfconference.org\">SelfConference.org</a> — Speaking at a conference doesn’t have to be about having mastered technology X or methodology Y. It can be about your journey, your struggles, your learning process. Conference attendees love seeing a person to whom they can relate, sharing their struggles and hearing their story.</p>\n<p>Additionally, some of the most compelling talks and keynotes I’ve watched had nothing to do with technology. They were about human topics:</p>\n<ul>\n<li>If you’re struggling with mental health, become a spokesperson for <a href=\"https://osmihelp.org/\">OSMIHelp.org</a>, and educate us.</li>\n<li>If you’re struggling with discrimination, educate us.</li>\n<li>If you’re struggling with accessibility, educate us.</li>\n<li>If you care about something, educate us.</li>\n</ul>\n<p><strong>Turn the World into allies for the causes you care about.</strong></p>\n<p>Back to technology though, if you fear “imposter syndrome”, just know that you have valuable experience to share. I use this syndrome as motivation to more thoroughly research topics I speak on, and to seek out prevailing counter arguments to the points I’m about to make.</p>\n<p>With all this said, the most defensible position lies within what has worked for you, from the confines of realities which you had to face.</p>\n<p>Finally, keep in mind that conference organizers and their speaker selection panels know what they’re doing. <strong>If they’ve picked you, it’s important for you to realize that they’ve done their due-diligence, and that you absolutely, positively, unequivocally belong on that stage.</strong></p>\n<p>So what’s the downside to submitting? What’s the worst that can happen? You might unleash your awesomeness unto the World?</p>\n<p>Bring it.</p>\n<h3>Are there any other speakers you look up to?</h3>\n<p>Yes.</p>\n<ul>\n<li><a href=\"https://www.sandimetz.com\">Sandi Metz</a></li>\n<li><a href=\"https://twitter.com/anjanavakil\">Anjana Vakil</a></li>\n<li><a href=\"https://twitter.com/ieatkillerbees\">Samantha Quiñones</a></li>\n<li><a href=\"https://twitter.com/CalEvans\">Cal Evans</a></li>\n<li><a href=\"https://twitter.com/jonskeet\">Jon Skeet</a></li>\n<li><a href=\"https://twitter.com/likeOMGitsFEDAY\">Jennifer Wadella</a></li>\n<li><a href=\"http://jenna.io\">Jenna Quindica</a></li>\n<li><a href=\"https://twitter.com/xiehan\">Nara Kasbergen</a></li>\n<li><a href=\"http://docondev.com\">Doc Norton</a></li>\n<li><a href=\"https://twitter.com/eryno\">Eryn O’Neil</a></li>\n<li><a href=\"https://twitter.com/philsturgeon\">Phil Sturgeon</a></li>\n<li><a href=\"https://twitter.com/HMSEvans\">Stephanie Evans</a></li>\n<li><a href=\"https://twitter.com/matthewtrask\">Matthew Trask</a></li>\n<li><a href=\"https://twitter.com/JessicaMauerhan\">Jessica Mauerhan</a></li>\n<li><a href=\"https://twitter.com/saramg\">Sara Golemon</a></li>\n<li><a href=\"https://fsharpforfunandprofit.com\">Scott Wlaschin</a></li>\n<li><a href=\"https://twitter.com/IanColdwater\">Ian Coldwater</a></li>\n<li><a href=\"https://www.jbrains.ca\">J.B. Rainsberger</a></li>\n</ul>\n<p>These folks have all delivered amazing talks and keynotes which have impacted how I think about human, management, infosec and software engineering topics.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/VzWLGMtXflg' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Sandi Metz at RubyConf 2017</em></p>\n<h3>Where can readers find more about you?</h3>\n<ul>\n<li><a href=\"http://twitter.com/chrisholland\">Chris on Twitter</a></li>\n<li><a href=\"https://github.com/elchris/speaking\">Talks on Github</a></li>\n<li><a href=\"https://speakerdex.co/chrisholland\">Chris on Speakerdex</a></li>\n</ul>\n<hr>\n<p>If you’re a tech conference speaker, email karl@cfpland.com to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Chris Holland, Engineering Director Driven to Empower Others","path":"/blog/speakers-story-chris-holland/","category":"Speaker's Story","tags":null,"date":"2019/04/07","image":"https://drive.google.com/uc?id=1wviuIeLHd0nObuRL2MQvocWKYBE8CVTv"}}},{"post":{"html":"<p>This week, I released three new features to newsletter subscribers that should improve your experience with CFP Land: Category Preferences, 🔔 New tags, and Perks.</p>\n<!--more-->\n<h2>Category Preferences</h2>\n<p>The most requested feature so far has been the ability for subscribers to choose a preferred category. Each week, the CFP Land newsletter contains more than 30 conferences, so it’s really annoying to sift through all of them looking for the few you really care about. For that reason, each email you get now includes a link to “Update Your Preferences”:</p>\n<p><img src=\"https://i.imgur.com/sp9mq2c.png\" alt=\"Update your preferences in the weekly email\"></p>\n<p>This will take you to form where you can specify the category of conferences you prefer:</p>\n<p><img src=\"https://i.imgur.com/iibk8D7.png\" alt=\"Category preference form\"></p>\n<p>Each week, any CFPs matching your preferred category should show up at the top of your email:</p>\n<p><img src=\"https://i.imgur.com/3utX9jM.png\" alt=\"Preferred CFPs\"></p>\n<p>Location preferences aren’t quite ready yet, but they will be coming soon!</p>\n<h2>“New” Tags</h2>\n<p>Another way to pick out new CFPs from the weekly email is to focus on any that are new. The list is sorted by CFP end date, so usually new ones will be at the bottom, but occasionally I’ll add a conference CFP just before it closes. In this case, it will show up marked with the ”🔔 New” tag. This means the conference has been added since the last email was sent 7 days ago:</p>\n<p><img src=\"https://i.imgur.com/sp9mq2c.png\" alt=\"New tag indicates a conference has been added in the past 7 days\"></p>\n<h2>Perks for Speakers</h2>\n<p>Finally, I’m spending extra time each week looking for the “Perks” that each conference offers to speakers (hopefully I’ll be able to automate this eventually). This was another highly requested feature, and it definitely helps if you’re trying to prioritize conferences that will cover travel or hotel costs for you.</p>\n<p>Right now the perks I look for are:</p>\n<ul>\n<li><strong>Travel</strong> meaning that the conference will pay for your travel to and from the event.</li>\n<li><strong>Hotel</strong> indicates that the conference offers reimbursement for hotel costs.</li>\n<li><strong>Stipend</strong> is an offer for payment or extra cash to cover miscellaneous expenses while speaking. Not many conferences offer this, so it’s nice when they do!</li>\n</ul>\n<p>Because my resources are limited, I only include these perks when they are <strong>clearly listed</strong> on the conference’s website page for speakers. If I miss something, you can always email me to let me know. Also, I decided not to include whether a free ticket for the event was included because <em>almost</em> every conference includes this by default.</p>\n<p><img src=\"https://i.imgur.com/P03MMW4.png\" alt=\"Perks like travel, hotel, and stipend are included in each email\"></p>\n<p>That’s it for this month’s new features. All new subscribers are asked to fill out a feedback form, so if you’d like to see improvements, keep an eye out for that email after you subscribe or contact me (<a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a>) to start a conversation.</p>","frontmatter":{"layout":"post","title":"New Features: Category Preferences, \"New\" Tags, and Perks","path":"/blog/category-preferences-perks/","category":"Updates","tags":["Email","Website"],"date":"2019/04/05","image":null}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>Laura is currently the <a href=\"https://www.modernteacher.com/\">Chief Product Officer at Modern\nTeacher</a>, an edtech startup based in Chicago,\nIL. She was recently featured as a <a href=\"https://www.asianentrepreneur.org/women-on-top-in-tech-laura-janusek-vice-president-of-product-and-founding-team-member-of-modern-teacher/\">“Woman on Top in\nTech”</a> by Asian Entrepreneur magazine, and has been involved in public speaking for\nmany years. In this interview, we cover how she got into speaking at tech\nconferences, her advice for new speakers, and some of the ways speaking has\nbenefited her professionally.</p>\n<!--more-->\n<img src=\"https://cdn-images-1.medium.com/max/1200/1*0KSCAln6MEJrW0a3URY6ow.jpeg\" class=\"left\">\n<h3>How did you get into public speaking?</h3>\n<p>I’ve become a more active speaker at technical conferences just in the last\nyear. Over the past several years, I would speak here and there, generally after\nbeing invited by someone involved with the event. But last year I was looking\ninto conferences I might want to attend for women in tech, and I saw a CFP on\nthe website for one of them. I thought, “Oh, maybe instead of just attending\nthese conferences, I could speak at them,” and I was right!</p>\n<p>I wish I had realized sooner that <strong>you don’t always have to be personally\ninvited to speak at events.</strong> Now that I’m aware of the CFP process, I’m\nspeaking regularly at conferences across the country.</p>\n<h3>What do you like about speaking at conferences? Has it benefited your career?</h3>\n<p>I think conferences can be such a fun way to meet people, whether you’re\nspeaking or not. But I have to admit, being a speaker has its perks. There are\ndinners, networking events, sometimes lounges specifically for the speakers,\nwhich build an immediate sense of community. I’ve been blown away by some of the\nother speakers I’ve met in these settings.</p>\n<p>Speaking also establishes your authority in your subject area, and it gives you\nthe chance to genuinely help people learn something new. This teaching aspect is\nespecially important to me, given my background in the education space.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>Being in EdTech, I’ve always spoken at events for teachers, which was a natural\nprogression from being in the classroom and participating in or leading\nprofessional development sessions. But my first speaking engagement that was for\nmore of a technical and business-oriented audience was on a panel of EdTech\nentrepreneurs at <a href=\"https://1871.com/\">Chicago’s tech incubator and hub, 1871</a>.\nOne of the organizers had seen me giving a product demo and asked for me to join\nthe event, perhaps to help them avoid the dreaded all-male panel (or “manel”).</p>\n<p>And again, this experience corrected some misconceptions I had about public\nspeaking. I used to think all panelists must be exceptional at coming up with\noff-the-cuff responses to tricky questions on the spot, and maybe some of them\nare, but that’s definitely not the norm.</p>\n<p>In my experience at the 1871’s event, the panelists were all given the questions\nahead of time so we could prepare, and I was asked if I’d be comfortable kicking\nthe panel off by responding to the first question. I didn’t need to worry about\ncoming up with responses in the moment, because I was prepped ahead of time,\nwhich made the experience a lot less intimidating. And the format of a panel —\nbeing seated, one in a row of several speakers — creates a more casual vibe as\nwell. <strong>I’d definitely recommend panels as a gateway experience for anyone who\nis considering branching out into public speaking.</strong></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve spoken at about 10 conferences to date, and I currently have 4 more\nscheduled in the coming months. I don’t keep count on how many I’ve applied to,\nbut it’s been a lot! <strong>I definitely don’t get accepted to every event — I don’t\nthink anyone does.</strong> But I’ve very much enjoyed the conferences I’ve been a part\nof, and I’m looking forward to the ones ahead.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I try to access the room some time before my session to make sure the AV setup\nis good to go, but apart from that, I’m usually attending someone else’s session\nright up until it’s time for mine to start!</p>\n<p>I know not everyone’s schedules allow them to spend the full day at the event,\nbut <strong>I think it’s a shame when speakers come in just for their session and then\nleave.</strong> I make it a point to support and learn from the other speakers when I’m\nat a conference, so my session is usually one of many that I participate in\nthroughout the day.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>My biggest piece of advice is to just go for it!</p>\n<p>I’m involved in a lot of online communities, and I’ll see people posting in\nSlack, asking if they should respond to a CFP they’re interested in. My response\nis always yes. Why not? <strong>It doesn’t take much to respond to a CFP. You don’t\nhave to have a whole session ready to go. You just need an idea and an\nabstract.</strong></p>\n<p>Think of something you’ve been successful at professionally, and then think of\nwhat advice you’d give to others on that topic. Can you come up with 5–10 tips\nto make your audience better at X? A coding language, a new tool, even a soft\nskill? Then you’ve got enough to respond to a CFP.</p>\n<p>There are a lot of resources on writing strong CFP submissions, so I’d recommend\ndoing a little research in that area, but <strong>don’t be intimidated, especially if\nyou’re a member of an underrepresented group. Conferences need more\nrepresentation of diversity and inclusion.</strong> Go for it!</p>\n<h3>Are there any other speakers who have inspired you?</h3>\n<p>One that comes to mind is Jennifer Wesley at Google, who gave the opening\nremarks at the Women Techmakers Summit in Chicago for International Women’s Day\nrecently. She stands out to me because she was able to get personal on stage,\nand in doing so, she established that the summit was a safe space for women.\n<strong>By being willing to be a little vulnerable with her personal story, she set\nthe tone for the whole day.</strong></p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/95g2cd8pwe8' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Jennifer Wesley at TEDxParker speaking about women in STEM</em></p>\n<h3>Where can readers find more about you?</h3>\n<p>I always post about my upcoming sessions on\n<a href=\"https://twitter.com/LBJanusek\">Twitter</a> and\n<a href=\"https://www.linkedin.com/in/lbjanusek/\">LinkedIn</a>, and I share speaker\ndiscounts there when I can, so follow or connect with me if you’re interested.</p>\n<hr>\n<p>If you’re a tech conference speaker, email karl@cfpland.com to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Laura Janusek, Chief Product Officer in Educational Technology","path":"/blog/speakers-story-laura-janusek/","category":"Speaker's Story","tags":null,"date":"2019/03/31","image":"https://cdn-images-1.medium.com/max/1200/1*0KSCAln6MEJrW0a3URY6ow.jpeg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>This week, I’m thrilled to bring you the story of <a href=\"https://geshan.com.np/\">Geshan\nManandhar</a>, a native of Nepal who now lives in\nAustralia. One of the things I love about speaking at conferences is the\nopportunity to meet people from all over the world, so reading Geshan’s\nexperience as a speaker on multiple continents was inspiring.</p>\n<!--more-->\n<img src=\"https://cdn-images-1.medium.com/max/1200/1*mQ216JZETiJBtVpHdGLBkA.jpeg\" class=\"left\">\n<h3>Tell me about yourself? How did you get into public speaking?</h3>\n<p>I have been a software engineer for more than a decade now. I have worked as a\nsoftware engineer in 3 countries in the past 10 years. I am primarily a backend\nsoftware engineer who dabbles in the frontend side of things once in a while.</p>\n<p>I used to do public speaking even in 2010 but I restarted doing it in 2014 when\nI spoke at a meetup in Kathmandu, Nepal. Then I started sending out abstract to\nCFPs in 2015, and in 2016 I spoke at my first conference: Code Motion Dubai.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I like meeting like-minded people with the profession in common. All of us are\nsolution providers at the end of the day at times with code and sometimes\nwithout code too. I like the positive energy conferences have and regardless of\nwhere you work or the number of years of experience one has all of the\nparticipants are there to learn and share the experience. I admire the time,\neffort and resources put in by speakers for their talk.</p>\n<p>Public speaking, to be honest, has benefited my career both directly and\nindirectly. It has surely given me recognition and many people have approached\nme after doing some public speaking for various reasons. To be honest, adding a\nsection in your CV where you have spoken in a couple of good conferences does\nadd more value.</p>\n<h3>Do you remember your first conference talk?</h3>\n<p>My first big conference talk was in August, 2016 in Amsterdam for Laracon EU.\nProbably that was the biggest audience I had spoken in front of and included all\nthe who’s who of that community. It was a talk on ChatOps and I think for that\ncommunity of people it was a relatively new thing then.</p>\n<p><span class=\"figcaption_hack\">Geshan’s first big conference talk at Laracon EU, 2016</span></p>\n<p>I think it went pretty well, I was shaky and nervous when I started of course\nand then after the first 10 minutes I think I was in the flow and telling most\nof the things I had to talk about.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>To be honest, I have lost count on how many CFPs I have submitted my abstracts,\nfrom 2015 it surely should be in the 100s. I generally submit to conferences\nthat cover both travel and accommodations or at least travel. Like an e-commerce\nwebsite, I believe (at least for me) the conversion (success) rate is like 1% or\nless :). In total from 2016 to now I have spoken at 4 conferences in 4\ncontinents, not sure if it qualifies me to be called an international speaker\nfrom Nepal though :).</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I narrate the talk to myself the night before. Then right before the talk, I\nmake sure I have things I need with me like water, screen connections, and that\nthe screen size is fine. After I get on stage, I focus on delivering the message\nwith the right impact.</p>\n<p>I try to keep preparation pretty simple: don’t over-prepare, keep things\nspontaneous, but have some direction and keep an eye on the time.</p>\n<p>I usually don’t have speaker notes so I look at the slides and then improvise on\nthem. That’s why even if I do the same talk a second time, the details I include\neach time will be different.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>For new speakers, there are two main pieces of advice:</p>\n<p><strong>First, give your talk on local meetups.</strong> Local user group meetups are always\nlooking for speakers so if you approach them you will rarely hear a no you can’t\npresent. Depending on your city, the frequency of meetups in your area of tech\nmight be many, little, or none. When you practice your talk in a smaller group\nyou get feedback and also get over imposter syndrome.</p>\n<p>Speaking is not a thing for everyone, so try it in a smaller group. If you like\nit do it more, but bare in mind public speaking is a very important skill for\nyour career.</p>\n<p><strong>The second one is to work on your title and abstract.</strong> When conferences have\nCFPs the main thing in my opinion that stands out is your title and abstract.\nThe relevance of the talk in that conference is vital too, for instance, a Ruby\nconference will never accept a PHP 7 features talk. As some conferences have\nblind speaker selection, always work an extra bit on your title and abstracts.</p>\n<p>Then, it’s all about submitting your talk to all the CFPs you can find. The best\nway to find CFPs is <a href=\"https://www.cfpland.com/\">CFP Land</a>,\n<a href=\"https://www.papercall.io/\">papercall.io</a>, <a href=\"https://confs.tech/\">confs.tech</a>,\nlanyrd.com (it’s usually down though),\n<a href=\"https://callingallpapers.com/\">callingallpapers.com</a>. I wrote some <a href=\"https://geshan.com.np/blog/2016/09/some-useful-resources-for-conference-speakers-and-wanna-be-speakers/\">more advice\nfor finding speaking opportunities on my blog\ntoo</a>.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>One tech speaker who is great to listen to is <a href=\"https://twitter.com/kelseyhightower\">Kelsey\nHightower</a> from Google. His talks are\nspontaneous, fun, and filled with information.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/_1-5YFfJCqM' frameborder='0' allowfullscreen></iframe></div>\n<p>Someone that I witnessed in-person who is very good on stage is <a href=\"https://twitter.com/adamwathan\">Adam\nWathan</a>. He was able to explain a complex topic\nin a very easy way and had the courage to do live coding on a stage with like\n500+ people watching.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/dfgtKb-VpRk' frameborder='0' allowfullscreen></iframe></div>\n<h3>Where can readers find more about you?</h3>\n<p>I blog at Geshan.com.np, I don’t have my next talks up yet, but the talks I have\ndone in the past are in the <a href=\"https://geshan.com.np/blog/categories/talks/\">“talks” section of my\nblog</a>.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed//QitdhwHYAVE' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Geshan’s more recent talk from DevOps Days Newcastle on Microservices</em></p>\n<hr>\n<p>If you’re a tech conference speaker, email karl@cfpland.com to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Geshan Manandhar, Intercontinental Speaker and Senior Software Engineer","path":"/blog/speakers-story-geshan-manandhar/","category":"Speaker's Story","tags":null,"date":"2019/03/24","image":"https://cdn-images-1.medium.com/max/1200/1*mQ216JZETiJBtVpHdGLBkA.jpeg"}}},{"post":{"html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<!--more-->\n<h3>Tell me about yourself? How did you get into public speaking?</h3>\n<p>I’m Laurie and I’m a software engineer. I got into speaking for a couple of\nreasons. In my former life I was an active member of the debate team and did a\nlot of musical theatre, so audiences don’t scare me. I decided I wanted to be\ninvolved in technical speaking in part because I wanted to see more diversity\nrepresented on the stage.</p>\n<img src=\"https://cdn-images-1.medium.com/max/1200/1*fM3yLcP58eVXUsdeHAnVdA.jpeg\" class=\"left\">\n<h3>What do you like about speaking at conferences?</h3>\n<p>There is so much to love about speaking.</p>\n<p>I like thinking up the talk subject and coming up with something I think is new\nor interesting that will benefit attendees. While writing talks are a huge time\ncommitment, there is nothing quite like explaining a concept to others to help\ncrystalize it in your mind.</p>\n<p>And, speaking is an incredible way to connect with other people outside of your\ntech silo and/or geographic area. It has also opened up additional career\nopportunities for me, and has resulted in growing in different directions as\nwell, like writing blog posts and answering interview questions!</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I do! It was a local first year conference. I think the talk was meant to be 20\nminutes or so and I was overly concerned about running short.</p>\n<p>It went pretty well, and people laughed at my jokes, but I was far more nervous\nthan I’d expected to be. If you want to judge for yourself <a href=\"https://www.youtube.com/watch?v=eS8tO3Z6E7U&#x26;t=579s\">the video is\nonline</a>. I really should\nretool this talk and give it again.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed//eS8tO3Z6E7U' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Laurie Barth’s first ever conference talk at DC Full Stack Web Summit, 2017</em></p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I looked at my Trello board, and I’ve applied to around 35 conferences over the\ncourse of 3 years. I’ve been accepted at 12 and spoken at 9–10 of those.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I try to arrive in the room as early as I can after the previous speaker, and\nnormally I run the talk through without notes while getting ready that morning.\nAs long as I know I have the cues in my head I’m not worried about any further\nmemorization.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>My biggest piece of advice is about content.</p>\n<p>The talks that are most engaging to me include stories of failure, they talk\nabout learning something you don’t know and falling down along the way, or\nthey’re a new perspective from an outsider on a specific topic.</p>\n<p>This isn’t a hard and fast rule, but I think it’s a great way to think about\npotential topics and to feel confident being honest with your audience. You’ll\nbe more memorable.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>So so many! I really couldn’t pick so I’ll try and talk about speakers with\ntotally different types of talks.</p>\n<p>I love <a href=\"https://twitter.com/nmeans\">Nicholas Means</a> who takes you through\nincredibly real stories about disasters and almost disasters and what we can\nlearn from them.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed//099cHWSbAL8' frameborder='0' allowfullscreen></iframe></div>\n<p>I love <a href=\"https://twitter.com/editingemily\">Emily Freeman</a> who talks about how the\nhuman reactions of all of us manifest themselves in our work and how that can\nhelp us be more cognizant of our actions.</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed//dbKjzxd-f70' frameborder='0' allowfullscreen></iframe></div>\n<p>I’ve recently discovered some amazing speakers through youtube videos like\n<a href=\"https://twitter.com/philip_roberts\">Philip Roberts</a> who did a great talk on the\njavascript event loop:</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed//8aGhZQkoFbQ' frameborder='0' allowfullscreen></iframe></div>\n<h3>Where can readers find out more about you?</h3>\n<p>I have a website: <a href=\"http://laurieontech.com/\">laurieontech.com</a> (pardon the lack\nof responsive design, I just migrated to a new framework and it’s a work in\nprogress). I also tweet a fair amount\n@<a href=\"https://twitter.com/laurieontech?lang=en\">laurieontech</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email karl@cfpland.com to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Laurie Barth, Software Engineer and Conference Speaker","path":"/blog/speakers-story-laurie-barth/","category":"Speaker's Story","tags":null,"date":"2019/03/17","image":"https://cdn-images-1.medium.com/max/1200/1*fM3yLcP58eVXUsdeHAnVdA.jpeg"}}}],"pathPrefix":"blog","first":false,"last":false,"index":4,"pageCount":5,"additionalContext":{}}}