{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"3892203b-1500-5310-a244-55fb43f05116","html":"<p>Most technology conference attendees never dream of speaking at an event, so they probably don’t even realize what goes into the speaker selection process. While there is variability in how an event decides on which speakers they will invite, most technology conferences offer some form of public Call for Proposals of “CFP”.  </p>\n<h2>The Call for Proposals Process</h2>\n<blockquote>\n<p>I wish I had realized sooner that you don’t always have to be personally invited to speak at events. Now that I’m aware of the CFP process, I’m speaking regularly at conferences across the country.\n<em><a href=\"https://www.cfpland.com/blog/speakers-story-laura-janusek/\">Laura Janusek</a></em></p>\n</blockquote>\n<p>When conference organizers start planning their event, they usually choose a date, and soon after, they will open up a Call for Proposals. The CFP may be managed on a platform like </p>\n<ul>\n<li>Public submissions</li>\n<li>Special invites</li>\n<li>Evaluating submissions - Conference committee</li>\n<li>Confirming speakers - may go through multiple rounds</li>\n</ul>\n<h2>Why Do Speakers Get Chosen?</h2>\n<p>It’s impossible to predict exactly what will stand out to a conference organizing committee. Each one is different, and each conference has different stated (and unstated) objectives. While there are many factors involved, technology conference speakers are usually chosen based on some combination of the following criteria: </p>\n<h3>Great Topic and Abstract</h3>\n<ul>\n<li>Interesting/unique/aligned</li>\n<li>Well-written</li>\n<li>See chapter 5</li>\n</ul>\n<h3>A Good Blend of Topics</h3>\n<p>big picture and niche</p>\n<blockquote>\n<p>“Having big picture sessions can make for a very generic program. As such, a limited number of big picture presentations tend to get picked with a larger number of more specialist topics.” - <a href=\"https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/\">https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/</a></p>\n</blockquote>\n<h3>Speaker Qualifications</h3>\n<blockquote>\n<p>“Why should I listen to them? Are they an amazing speaker and will give a great performance? Are they an expert in a field that they can speak authoritatively on? Do they have some unique experience that makes their content special or different? You can’t identify yourself here, but you can identify traits or facts about yourself. Did you win “best comedic presentation” at your local toastmasters? Were you in every theatre play and musical production in school? Did you write an open source tool or library that deals heavily with the topics involved? Have you spoken before? It doesn’t have to be at a conference, tell me about your love for speaking at school or user groups, something that indicates your general ability to give a well thought out and prepared talk. Where did you speak? How was it received? What audiences did you resonate with? Did you write a book? Where do you work? Do you hate with a passion due to ? How did you find the topic you’re submitting about, and what makes you the best person to speak on it?” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></p>\n</blockquote>\n<h3>Speaker Reputation</h3>\n<ul>\n<li>“Famous speakers will tend to attract money, in the form of more/better sponsors and more attendees.” - <a href=\"https://blog.frankel.ch/advices-junior-conference-speakers/\">https://blog.frankel.ch/advices-junior-conference-speakers/</a></li>\n<li>“The most biggest conferences may have selection processes that favor experienced speakers, since they don’t want to risk a 50-minute time slot on an unknown quantity.” - <a href=\"https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0\">https://hackernoon.com/how-and-why-to-speak-at-tech-conferences-1d50a3f548e0</a></li>\n<li>Not too egotistical: “Program committees often don’t want ego-ridden sessions, not just because they are annoying, but also because they often become advertising carousels for the speaker’s books, videos, events, and other material they are schlepping.” - <a href=\"https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/\">https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/</a></li>\n</ul>\n<h3>Diversity of Speakers</h3>\n<h3>Cost of Transportation and Hotel</h3>\n<h3>Event Sponsorship</h3>\n<p><a class=\"text-left d-block\" href=\"../why-speak\">Previous: Why Speak? 11 Reasons People Get on Stage</a>\n<a class=\"text-right d-block\" href=\"../finding-cfps/\">Next: Finding and Selecting CFPs</a></p>","frontmatter":{"layout":"post","title":"How Conferences Choose Their Speakers","path":"/guides/speaking/how-conferences-choose/","category":"Guides","tags":null,"date":null,"image":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}