{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"9957cf84-b1ea-5cdf-bb31-108a40c0b4d1","html":"<p>I first saw Anjuan speak at <a href=\"https://www.youtube.com/watch?v=9HuvC1ME68I\">The Lead Dev</a> in Austin, TX. I really love when technology speakers draw parallels to events and characters outside of our industry, so his talk on leadership lessons learned through the underground railroad was right up my alley. Anjuan is a prolific and talented speaker who’s spoken at over 50 conferences across the world, so I’m very excited to bring his story to you here today. In this interview, Anjuan outlines some of the topics he’s passionate about and lessons he’s learned on his speaker’s journey.</p>\n<!--more-->\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/9HuvC1ME68I' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Anjuan Simmons at The Lead Dev Austin</em></p>\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<img src=\"https://i.imgur.com/CXHhfJH.jpg\" class=\"right\">\n<p>I’m an Engineering Coach at Help Scout, and my daily job is to make sure that the engineers on my team are successful and that we’re shipping features that our customers love.</p>\n<p>I got into public speaking at a young age. I did one-act plays in high school, and I also competed in <a href=\"https://www.uiltexas.org/speech/oral-interp/2019-20-uil-poetry-categories\">UIL poetry interpretation</a>. I’ve always been fascinated by the ability of human speech to change the world, and I hope that my public speaking is a small brick in the enormous wall of humanity’s ongoing attempt to make ourselves better.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>I love speaking at conferences!</p>\n<p>I give my talks because <strong>I believe that I have something to say that will help the attendees be better at the work they do</strong>. So, speaking is a way that I can help people, and helpfulness is one of my core values. There’s nothing better than the feeling I get when people come up to me after my talk (or sometimes weeks/months later) and tell me how it changed the way they thought about the topic. It’s even better when they share how it changed their behavior!</p>\n<p>Speaking isn’t part of my job, but it has greatly benefited my career. During job interviews, <strong>I’ve had interviewers tell me how much they loved my talks!</strong> While giving great talks alone wouldn’t have gotten me the offer, being qualified and a good speaker has been an incredible combination!</p>\n<h3>What topics do you typically speak about?</h3>\n<p>My two primary topics are technology leadership and diversity and inclusion. My technology leadership talks draw on core principles as well as historical examples.</p>\n<p>My <a href=\"https://anjuansimmons.com/talks/leadership-lessons-from-the-agile-manifesto/\">Leadership Lessons from the Agile Manifesto</a> talk takes the values of the <a href=\"https://agilemanifesto.org/\">Manifesto for Agile Software Development</a> and distills lessons for engineering managers and technical leads. I give easy to understand guidelines for making the tough decisions that leaders have to make when guiding engineering teams.</p>\n<p>My <a href=\"https://anjuansimmons.com/talks/technical-leadership-through-the-underground-railroad/\">Technical Leadership Through the Underground Railroad</a> talk uses the story of the daring John P. Parker who was a Conductor on the legendary Underground Railroad. I use his experience helping a group of enslaved people in 19th Century America escape from the Slave States to freedom.</p>\n<p>I give a talk with my wife, Dr. Aneika Simmons, called <a href=\"https://anjuansimmons.com/talks/managing-the-burnout-burndown/\">Managing the Burnout Burndown</a>, and we use the burndown chart used my many Agile teams as a metaphor for burning down stress. We describe how protecting your health, forming strong relationships, and removing distractions can help you avoid burn out.</p>\n<p>My <a href=\"https://anjuansimmons.com/talks/lending-privilege/\">Lending Privilege</a> talk describes how everyone has privilege and can use it to create a more diverse and inclusive technology industry. We can all help those who lack our privileges be more visible, have their voices heard, and get a chance to contribute their expertise to the software development process at our companies.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>My first conference talk was at Podcamp Houston back in 2009. I think it went very well!</p>\n<p>My talk was called “Restoring Tech Cred to Houston”, and I made the case for Houston being an often overlooked tech hub when compared to other areas of the country like Silicon Valley, New York City, and Austin. One thing that’s important to know about this first talk was that I had the fortune of getting a lot of speaking experience as a normal part of my job. As an engineering manager, I did a lot of speaking as a person tasked with leading development teams. Of course, this work was done inside company walls and was not visible to the public. However, I found that when I did start public speaking I already had a great set of skills just from what I did at work. </p>\n<p><strong>So, if you’re a new speaker, you probably are more experienced than you realize if your job requires you to do a lot of communication (even if it’s just in small team meetings or Slack conversations).</strong></p>\n<p>My first large conference talk was at South by Southwest in 2010, and I went on to speak there several times. I started to really get serious about speaking at conferences when I did a Lightning Talk at OSCON in 2016. That’s when my public speaking work really began to take off!</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I would guess over 500. I’ve spoken at about 50 conferences so that tells you how tough the ratio of applications to acceptances can be.</p>\n<p>Speaking at conferences is a numbers game, and <strong>you shouldn’t let the rejection emails get you down</strong>. I’ve spoken at conferences on three different continents, and I still regularly get rejected. Keep applying and refining your proposals. You’ll start getting acceptances which usually lead to a higher acceptance rate.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>My pre-talk routine is meant to minimize variables and distractions as much as possible. I avoid drinking or eating anything two hours before my talk. That reduces the chance that I’ll have an upset stomach or have to deal with digestion issues. I may drink coffee, but no later than 30 minutes before I go on stage (to avoid being too jittery).</p>\n<p>I make sure I’ve been mic’d and have done a sound check and laptop check at least 30 minutes before my talk. I want to make sure that the mic is working, my slides are properly displayed on the screens, and my clicker (I use a <a href=\"https://www.logitech.com/en-us/product/spotlight-presentation-remote\">Logitech Spotlight</a>) and laptop are both fully charged.</p>\n<p>I have a Presentation Pre-Pump Playlist in Google Music on my phone that I listen to right before I step on stage. The contents of the playlist is classified. 😃</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>I think the best and more difficult advice is “calm down”.</p>\n<p>It’s ok to be a bit nervous, but try to understand that if you have been chosen to give a talk at a conference or at a local meetup it’s because you’re an expert in that field, so you know what you’re talking about. Just calm down, enjoy the talk, and accept any feedback.</p>\n<p>It needs to be fun for you, you don’t have to suffer, so please enjoy the process.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>I look up to and have been inspired by so many speakers. Here is a list of their Twitter accounts:</p>\n<ul>\n<li><a href=\"https://twitter.com/catehstn\">https://twitter.com/catehstn</a></li>\n<li><a href=\"https://twitter.com/alicegoldfuss\">https://twitter.com/alicegoldfuss</a></li>\n<li><a href=\"https://twitter.com/likeOMGitsFEDAY\">https://twitter.com/likeOMGitsFEDAY</a></li>\n<li><a href=\"https://twitter.com/nodunayo\">https://twitter.com/nodunayo</a></li>\n<li><a href=\"https://twitter.com/sarahmei\">https://twitter.com/sarahmei</a></li>\n<li><a href=\"https://twitter.com/lara_hogan\">https://twitter.com/lara_hogan</a></li>\n<li><a href=\"https://twitter.com/vaidehijoshi\">https://twitter.com/vaidehijoshi</a></li>\n<li><a href=\"https://twitter.com/Geek_Managerhttps://twitter.com/wiredferret\">https://twitter.com/Geek_Managerhttps://twitter.com/wiredferret</a></li>\n<li><a href=\"https://twitter.com/skamille\">https://twitter.com/skamille</a></li>\n<li><a href=\"https://twitter.com/sharonsteed\">https://twitter.com/sharonsteed</a></li>\n<li><a href=\"https://twitter.com/kytrinyx\">https://twitter.com/kytrinyx</a></li>\n<li><a href=\"https://twitter.com/heddle317\">https://twitter.com/heddle317</a></li>\n<li><a href=\"https://twitter.com/saronyitbarek\">https://twitter.com/saronyitbarek</a></li>\n<li><a href=\"https://twitter.com/6Gems\">https://twitter.com/6Gems</a></li>\n</ul>\n<p>Of course, the speaker that I look up to the most and inspires me every day is my wife who you can <a href=\"https://twitter.com/aneika\">follow on Twitter here</a>.</p>\n<h3>Where can readers find more about you?</h3>\n<p>You can find more about me on my <a href=\"https://anjuansimmons.com/\">website</a>, <a href=\"https://twitter.com/anjuan\">Twitter</a>, or <a href=\"https://www.instagram.com/anjuan/\">Instagram</a>.</p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Anjuan Simmons, Engineering Coach and Inclusive Technology Speaker","path":"/blog/speaker-anjuan-simmons/","category":"Speaker's Story","tags":null,"date":"2019/09/18","image":"https://i.imgur.com/CXHhfJH.jpg"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}