{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"d0855a95-6337-585d-8a29-7ff438ec23a6","html":"<p>I recently mentioned on a podcast <a href=\"https://soundcloud.com/technicallytrue/career-advancement-through-public-speaking-karl-hughes\">that Twilio was my favorite Developer Relations team</a>, so when Phil Nash of Twilio <a href=\"https://philna.sh/blog/2020/01/29/how-to-find-cfps-for-developer-conferences/\">mentioned CFP Land</a> in a blog post he wrote, I knew I wanted to get his story up here.</p>\n<p>As many conference speakers do, Phil has a passion for teaching people and sharing his knowledge. You see that in his talks as well as his contributions to open source and helpful blog posts. Read on for his perspective on speaking, technology, and the benefits that getting on stage has given his career.</p>\n<!--more-->\n<h3>Tell me about yourself. What’s your job and how did you get into speaking?</h3>\n<img src=\"https://drive.google.com/uc?id=1G9YoZUE9RJzUMGKuzwOhqW82nek6qNsj\" class=\"right\">\n<p>My name is Phil Nash and I am a Developer Evangelist for <a href=\"https://www.twilio.com\">Twilio</a>. I like working with Ruby, JavaScript and anything on the web platform. As an evangelist I spend my days working on example applications, building tools to help developers, and on writing blog posts, documentation and talks.</p>\n<p>Before evangelism I worked as a developer in London in an agency and product studio called <a href=\"https://mintdigital.com/\">Mint Digital</a>, which gave me the chance to work across a number of different styles of project. That was also where I was encouraged to get into public speaking, the company had a great policy that let us attend 2 conferences a year and would support us for more if we got accepted to speak. I seized that opportunity and it led to a few speaking engagements in European conferences, and eventually to this role in evangelism.</p>\n<p>On the side I like <a href=\"https://philna.sh/blog/\">blogging on my own site</a> and maintaining <a href=\"https://github.com/philnash?tab=repositories\">a bunch of open source applications, rubygems and node modules</a>. I’m also a Google Developer Expert, a <a href=\"https://untappd.com/user/philnash\">lover of beer</a> and now living in Melbourne, Australia.</p>\n<h3>What do you like about speaking at conferences?</h3>\n<p>Speaking at conferences has absolutely had a direct benefit to my career, it is part of my career now, but that doesn’t stop it being fun too. Something I realised as I started my evangelism career was that <strong>I enjoy speaking because I enjoy teaching people, showing them new things or new ways to achieve something</strong>. Breaking down topics, giving them my spin and hopefully making it entertaining along the way has become a passion.</p>\n<p>That’s what I love about the speaking side of things, but attending conferences in general has led to meeting so many kind, intelligent, community minded people that the best part of speaking is being able to do this more. Anyone can go to a conference and meet people, but if you speak it becomes a lot easier. Most people get a lot out of conferences because they get to listen to and learn from the experiences of those on stage. The real benefits lie in making connections with and learning from the experiences of as many people in the audience too.</p>\n<h3>What topics do you typically speak about?</h3>\n<p>I love talking about advancing the web platform. When I got into development professionally the number of features we had available to us to build experiences on the web were very few. The power of things like WebRTC, service workers, speech recognition and push notifications expand the amazing things we can build on the web. I like to experiment with these features and hopefully inspire others to use them in new and interesting ways.</p>\n<p>I also like picking up things that aren’t well understood and going in a bit deeper on them. I did this for two factor authentication, initially wanting to find out exactly how a website and a mobile app could agree on a 6 digit code, and building that into an experience.</p>\n<p>Finally, <strong>I just like talking about things I’ve worked on. They tend to be things I’m passionate about and while the audience may learn about that particular project</strong>, I hope they also take away things they can use in their own projects too.</p>\n<h3>Do you remember your first conference talk?</h3>\n<p>It seems that my first conference talk is now confined to <a href=\"https://web.archive.org/web/20160809165416/http://devslovebacon.com/conferences/bacon-2012/talks/html5-takes-over-the-world\">the Wayback Machine</a>. It was a talk called “HTML5 takes over the world” and was about all the fancy new features of the web back in 2012, including an experimental build of the Opera browser that had the first implementation of <code class=\"language-text\">getUserMedia</code> for getting access to a user’s camera and microphone.</p>\n<p>I remember being very nervous and drinking 3 cups of coffee before getting on stage. <strong>I had a half hour slot for the talk and I stormed through the talk, I think I finished in around 17 minutes and out of breath.</strong> I remember being happy with what I said, but a bit taken aback by the performance itself. At least we had plenty of time for questions.</p>\n<p>To this day I won’t have more than one cup of coffee before getting on stage in case I set myself speaking at double speed again.</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>After a quick count through my <a href=\"https://philna.sh/speaking/history\">speaking history</a>, it looks as though I’ve spoken at between 70 and 80 conferences since 2012. I’ve applied to so many more though, it’s not even funny. <strong>I must have sent in hundreds of proposals and been rejected hundreds of times too.</strong></p>\n<p>I’ve learned not to take that to heart as each conference organiser or CFP committee member has a different view on the talks they want to see at their event. <strong>A talk may be wrong for once conference and right for another</strong>, which is why it is worth finding the open CFPs and finding the right conference for your talk.</p>\n<h3>Do you have a pre-talk routine?</h3>\n<p>I think my pre-talk routine mostly consists of pacing around and going through the talk in my head. And not drinking too much coffee.</p>\n<p>I still get nervous before crowds, particularly if it’s the first outing of a talk. I don’t think that will ever go away fully, so I embrace it. I don’t have rituals or anything that makes it better so I just try to use the nervous energy to my advantage.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>Every person that gets on a stage to give a talk to an audience is up there telling their story and if you want to give a talk on something you need to find your angle on it. When you include your experiences it makes your talk unique. <strong>I could happily watch presentations on the same piece of code by 10 different people because I bet I would learn something new from each of them.</strong> You are the world’s foremost expert on your own experiences, and I believe that needs to come across in your presentation. That way you can’t be an imposter because no-one else has had your experience.</p>\n<p>When it comes to finding conferences to apply to, I recently wrote up a <a href=\"https://philna.sh/blog/2020/01/29/how-to-find-cfps-for-developer-conferences/\">list of different sites and mailing lists you can use to keep up to date with open CFPs</a> (including <a href=\"https://www.cfpland.com/\">CFP Land</a> of course).</p>\n<p><strong>The most important thing for giving talks is to practice, out loud.</strong> You don’t need to have an audience to practice to, but running through the slides and saying the words you want to say out loud will stick them in your head much better for when you come to say them in front of other people. Nothing can substitute rehearsal for ensuring you are prepared when it comes time to speak.</p>\n<p>If you are speaking at a conference, I’d recommend giving your talk to a local meet-up first too. That way you can get a good gauge on what the audience thinks of it, anything useful you might have missed and what the questions might be. It also forces you to practice at least once before you get to the conference.</p>\n<h3>Are there any other speakers you look up to? Anyone who’s inspired you?</h3>\n<p>Oh so many people. I’ve been fortunate to have been at so many conferences and seen so many speakers that I have inspiration all around. I already know I’m forgetting so many people as I write this following list, but here’s some fantastic people off the top of my head:</p>\n<ul>\n<li>All my fellow (and former) developer evangelist colleagues at Twilio, they both inspire me and also challenge me to improve all the time</li>\n<li><a href=\"https://twitter.com/devdevcharlie\">Charlie Gerard</a> for her amazing side projects leading to AI and web powered live demos</li>\n<li><a href=\"https://twitter.com/LeaVerou\">Lea Verou</a> for her ability to break down the most complicated parts of CSS and make anyone understand</li>\n<li><a href=\"https://twitter.com/tenderlove\">Aaron Patterson</a> for taking the deepest of dives into how Ruby works but doing so in a flurry of puns</li>\n<li><a href=\"https://twitter.com/erinjzimmer\">Erin Zimmer</a> for digging into browsers, Angular and web components and making them accessible to all</li>\n</ul>\n<p>And many, many more.</p>\n<h3>Where can readers</h3>\n<p>You can find me almost anywhere on the internet as <em>philnash</em>, from <a href=\"https://twitter.com/philnash\">Twitter</a>, <a href=\"https://github.com/philnash\">GitHub</a> and <a href=\"https://www.linkedin.com/in/philnash/\">LinkedIn</a> to my own site, <a href=\"https://philna.sh\">philna.sh</a>.</p>\n<p>I’m also streaming <a href=\"https://twitch.tv/phil_nash/\">live coding on Twitch frequently</a>, so come say “Hi! 👋” sometime!</p>\n<hr>\n<p><em>Technology conference speakers come from a wide range of backgrounds, experience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we highlight different speakers every week in our Speaker’s Story blog posts. If you’re a tech conference speaker, email <a href=\"mailto:karl@cfpland.com\">karl@cfpland.com</a> to tell your story.</em> 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Phil Nash, Developer Evangelist and Open Source Maintainer","path":"/blog/speaker-phil-nash/","category":"Speaker's Story","tags":null,"date":"2020/03/11","image":"https://drive.google.com/uc?id=1G9YoZUE9RJzUMGKuzwOhqW82nek6qNsj"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}