{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"2f9a7a2e-2382-59e6-bd12-98d784d578b8","html":"<p><em>Technology conference speakers come from a wide range of backgrounds,\nexperience levels, and interests. At <a href=\"https://www.cfpland.com/\">CFP Land</a>, we\nhighlight different speakers every week in our Speaker’s Story blog posts.</em></p>\n<p>After being reluctant (and admittedly nervous) to get on stage as a speaker, Nicola was finally\nconvinced that her experience was worth sharing. Her story is inspiring, because as Nicola points\nout, there aren’t a ton of speakers like her (Australian, female designers) out there.</p>\n<!--more-->\n<h3>Tell me about yourself. How did you get into public speaking?</h3>\n<p>I’m an independent product design consultant, working with software teams on their research and design as well as their process. I’m Australian, but I travel around a lot now days.</p>\n<p>I really had to force myself into public speaking. <strong>I was that girl who was so nervous I felt sick when I had to answer a question in class in front of people in high school.</strong> I was so shy and scared of public speaking. I never, ever thought I’d be speaking at conferences one day.</p>\n<p>I was lucky later on that I had a manager (Lawrence Crowther) who kept suggesting I give a talk. I think the fact that he saw me as someone who should be on stage was what I needed to feel like I could do it. Then the guy who runs Web Directions in Sydney reached out to me on Twitter after some blog posts I wrote, and specifically said he’d love to see my application to speak at the conference coming up. They promised speaker training for anyone who wanted it, so I went ahead and applied. Lo and behold, I was accepted… So then I had to force myself to get comfortable with public speaking in a matter of a few months.</p>\n<p>I really appreciate both of these people for believing I was the right person to be on stage, and encouraging me to do it. <strong>I think to get less represented people on stage, we really need to just ask them more.</strong> It’s hard to imagine yourself on stage if you’ve never really seen someone like you doing it. I didn’t feel like I’d seen many young, Aussie, female designers doing talks, so I guess it just didn’t really seem like something I could do.</p>\n<img src=\"https://i.imgur.com/qTCPnIX.jpg\" class=\"center\">\n<h3>What do you like about speaking at conferences?</h3>\n<p>The two things I’ve spoken about most - retrospectives and collaborative user research - are both things I’m really passionate about. So it’s just exciting to be able to share information I really think people should have.</p>\n<p>On a more selfish level, <strong>its great to be able to speak about the thing you’re interested in in front of a lot of people, because it means for the rest of the conference the other people who share your passion will come up and talk to you.</strong> I’ve met some really interesting people. And having spoken about your field at conferences gives you a little boost of initial authority on the subject that you otherwise have to build from scratch every time you meet a new client.</p>\n<h3>Do you remember your first conference talk? How did it go?</h3>\n<p>I tested out that my laptop connection and slides were working so many times in the break before my talk that they had to shoo me off stage. And still, the connection totally failed when I got up there in front of 800 people. The AV guy had to actually restart my computer on stage while I was standing there introducing myself at length. Super awkward! But I feel like I swallowed the frog: the possibly worst thing happened the first time. It all had to be uphill from there.</p>\n<p>(For the record, the talk went fine once we got the slides working again!)</p>\n<h3>How many conferences have you applied to and spoken at?</h3>\n<p>I’ve spoken at 3 conferences, with #4 coming up in June. Two in Sydney one in Kingston, Jamaica (!) and the next in Cornwall in the UK. I’ve applied to a lot more than that!</p>\n<div class='embed-container'><iframe src='https://www.youtube.com/embed/J5mC7jQ3Lto' frameborder='0' allowfullscreen></iframe></div>\n<p><em>Nicola Rushton at WebCraftConf - User Research is for Everyone</em></p>\n<h3>Do you have a pre-talk routine?</h3>\n<p><strong>I always try and test out the talk on a real audience or two before the conference.</strong> Whether that’s at a workplace or a Meetup, I always find things to change and get feedback from people. I will practice my talk probably ten or more times in the few weeks before the conference, just in my house talking to the walls!</p>\n<p>Directly on the day of the talk, I don’t have much of a routine. If anyone asks me about how I’m feeling I tell them “excited!” Even if I’m actually totally nervous, I find that embodying excitement helps me feel that way. I normally don’t eat much on the day.</p>\n<h3>What advice do you have for new speakers?</h3>\n<p>The most useful thing I have ever been told regarding public speaking was that <strong>the intense rush of adrenaline and nerves before you get on stage is COMPLETELY NORMAL and it happens to everyone, even people who’ve been doing it for years</strong>. In fact, if it stops happening, there’s something wrong. When I felt like that before, I used to get kind of worried and feel like maybe it would cause me to shake or faint on stage or something. But now I just observe that feeling and think to myself, awesome. My body is giving me all the adrenaline and hormones to do an awesome job of this. And I know it doesn’t come across on stage (especially if you smile!)</p>\n<p><strong>Think about starting by talking at Meetups, being on panels, or even hosting a Meetup.</strong> Smaller moments of being on stage helped me feel comfortable building up to standing up and speaking for 45 minutes straight.</p>\n<p>I think it’s also worth saying that representation on stage can be really useful for other people in the audience. Seeing people like you doing things can make someone reconsider whether they might be the right person to do that thing too. <strong>Just by being up there and being yourself you could be encouraging someone else to get up and share the thing they’re passionate about too.</strong> I find this perspective valuable if I start to feel imposter syndrome.</p>\n<h3>Are there any other speakers you look up to?</h3>\n<p>One of the most useful things I did for myself when forcing myself to become comfortable with public speaking was to <strong>hold myself to a low standard</strong>.</p>\n<p>That might sound really counterintuitive, but I just told myself at the start that if I got on stage, said everything I wanted to say, and didn’t trip over myself, then it would be a huge success. Then the next time, I pushed myself to do all of that and one more thing. Then the next time, just a tiny bit better. This allowed me to always feel REALLY positive and successful and happy about my public speaking. I didn’t want to get into feeling like I didn’t do good enough, and become discouraged. So really, my goal is to just be myself on stage, have good content, and communicate what I want to communicate in an engaging way.</p>\n<p>I don’t compare myself to anyone else!</p>\n<h3>Where can readers find more about you?</h3>\n<ul>\n<li><a href=\"http://nicolarushton.com/\">www.nicolarushton.com</a></li>\n<li><a href=\"https://twitter.com/nicolarushton\">Nicola on Twitter</a></li>\n<li><a href=\"http://linkedin.com/in/nicola-rushton/\">Nicola on Linkedin</a></li>\n</ul>\n<p>My next conference talk is in <a href=\"https://agileonthebeach.com/sessions/2019/bring-the-team-along-for-the-ride-why-products-are-better-when-agile-teams-do-research-together/\">June at Agile on the Beach, UK</a>.</p>\n<hr>\n<p>If you’re a tech conference speaker, email karl@cfpland.com to tell your story. 💌</p>","frontmatter":{"layout":"post","title":"Speaker’s Story: Nicola Rushton, Overcoming Reluctance to Share Her Passion","path":"/blog/speakers-story-nicola-rushton/","category":"Speaker's Story","tags":null,"date":"2019/04/12","image":"https://i.imgur.com/qTCPnIX.jpg"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}