{"data":{"site":{"meta":{"title":"CFP Land","description":"Calls for Proposals, Tech Conferences, and Speaking Tips","url":"https://www.cfpland.com","author":"Karl L. Hughes","twitter":"cfp_land","image":"/img/default.png"}},"post":{"id":"acdae069-3765-5b1d-8185-d1a82803c731","html":"<blockquote>\n<p>Speaking is a numbers game. The great players in baseball only hit the ball 1/3 of the time at best. I find I only get accepted to every 1 out of 3 conferences I apply to. There’s a zillion reasons why your talk wasn’t accepted that has nothing to do with you.</p>\n<p>Too similar to another already accepted\nToo different to the other talks accepted\nTechnical, and they needed more non-technical content\nToo advanced\nToo geared towards beginners\nAll over the place\nToo specific\nNot the right fit for attendees\nYour talk isn’t unique (gave at other confs)\nYour talk is too immature (haven’t given at any other confs)\n<a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></p>\n</blockquote>\n<h2>Handling Rejection</h2>\n<ul>\n<li>Not usually a judgement on you</li>\n<li>Confs get lots of submissions - “Most of JSConfs receive an average of 500 proposals” - <a href=\"https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32\">https://medium.com/@fox/how-to-write-a-successful-conference-proposal-4461509d3e32</a></li>\n<li>“It is usually difficult to get started as a conference speaker in terms of getting your CFP submissions accepted. This is totally okay and you don’t need to worry about it!” - <a href=\"https://www.cfpland.com/blog/speakers-story-jaime-lopez-jr/\">Jaime Lopez</a></li>\n<li>“Look at the talks that were accepted, what did they have in common with your proposal? What did they have that was different? Maybe you can ask some of the people who got talks accepted to share their details &#x26; pitch (things that are not put on the schedule).” - <a href=\"https://schneems.com/blogs/2016-04-07-conference-proposal\">https://schneems.com/blogs/2016-04-07-conference-proposal</a></li>\n<li>“It’s like for pull requests: just as you’re not your code, you’re not your submissions. Accept probabilities are not in your favor, and face rejection with the same maturity.” - <a href=\"https://blog.frankel.ch/advices-junior-conference-speakers/\">https://blog.frankel.ch/advices-junior-conference-speakers/</a></li>\n<li>“I really appreciate when conferences give you feedback so you can apply that to the next one you submit to. I’m learning from each rejection I get.” - <a href=\"https://www.cfpland.com/blog/speakers-story-kara-luton/\">https://www.cfpland.com/blog/speakers-story-kara-luton/</a></li>\n<li>“My CFP rejected-to-win ratio is probably around 0.00001 which is definitely an exercise in learning how to accept rejection and not take it personally.” - <a href=\"https://www.cfpland.com/blog/speakers-rizwan-javaid/\">https://www.cfpland.com/blog/speakers-rizwan-javaid/</a></li>\n<li>“you shouldn’t let the rejection emails get you down. I’ve spoken at conferences on three different continents, and I still regularly get rejected. Keep applying and refining your proposals.” - <a href=\"https://www.cfpland.com/blog/speaker-anjuan-simmons/\">https://www.cfpland.com/blog/speaker-anjuan-simmons/</a></li>\n<li>“Some conferences are happy to provide feedback when your session isn’t selected. Ask for it. It doesn’t hurt, and if they have time, they may respond. Some won’t though as they are often dealing with hundreds of sessions.” - <a href=\"https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/\">https://www.jonobacon.com/2019/01/21/get-your-cfp-session-picked/</a></li>\n<li>“In 2015 I saw a comment on the internet like “it’s the worst thing I ever seen, how organizers allowed him to speak on stage.”. It demotivated me to do anything for half a year. It has taken a while to overcome this bias and give it another try.” - <a href=\"https://medium.com/@tryshchenko/why-am-i-doing-public-speaking-at-tech-events-the-honest-answer-a75d80f85cfd\">https://medium.com/@tryshchenko/why-am-i-doing-public-speaking-at-tech-events-the-honest-answer-a75d80f85cfd</a></li>\n</ul>\n<h2>Getting Accepted</h2>\n<ul>\n<li>Will coordinate details</li>\n<li>conf may not actually happen</li>\n<li>“Imposter syndrome is real and a totally normal feeling, so do not let that hold you back. Especially early on, I always had a feeling of “everyone in the audience will already know what I’m talking about.” That is not the case. If they did, they would not be there. Those that show up want to hear YOU and learn from your experiences. If it turns out there are a few people that decide to leave during the talk for whatever reason, there is nothing wrong with that.” - <a href=\"https://www.cfpland.com/blog/speakers-story-john-riviello/\">John Riviello</a></li>\n<li>While you may not feel like the expert on this topic, the people listening to you came to hear YOU! Remember you’ve got friends in the audience — some you may know, and some you may not know…yet. - <a href=\"https://www.cfpland.com/blog/speakers-story-rhia-dixon/\">https://www.cfpland.com/blog/speakers-story-rhia-dixon/</a></li>\n<li>“I’ve always been extremely uncomfortable with my content not being technical enough because I often feel like I lack technical skill, but I’ve always been confident with the delivery because it seems to come naturally to me for whatever reason.” - <a href=\"https://www.cfpland.com/blog/speakers-story-tejas-kumar/\">https://www.cfpland.com/blog/speakers-story-tejas-kumar/</a></li>\n<li>“Feeling the pre-conference jitters is totally normal. I tell people all the time that if you don’t feel nervous before your talk, including the day of, you might want to go to the doctor. Indeed there is something wrong with your nervous system.” - <a href=\"https://medium.com/@saltnburnem/speaker-tips-legit-feels-b17b30a464d\">https://medium.com/@saltnburnem/speaker-tips-legit-feels-b17b30a464d</a></li>\n</ul>\n<h2>Declining invitations</h2>","frontmatter":{"layout":"post","title":"What Comes Next? Dealing with Success or Rejection","path":"/guides/speaking/success-rejection/","category":"Guides","tags":null,"date":null,"image":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}